[
  {
    "uuid": "634f1802bcbfb314ddee9d28",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "acidic igneous material",
    "definition": "Igneous material with more than 63 percent SiO2.",
    "children": []
  },
  {
    "uuid": "634f1802bcbfb314ddee9d29",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "acidic igneous rock",
    "definition": "Igneous rock with more than 63 percent SiO2.",
    "children": []
  },
  {
    "uuid": "634f1803bcbfb314ddee9d2b",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "alkali feldspar granite",
    "definition": "Granitic rock that has a plagioclase to total feldspar ratio less than 0.1. QAPF field 2.",
    "children": []
  },
  {
    "uuid": "634f1803bcbfb314ddee9d2c",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "alkali feldspar rhyolite",
    "definition": "Rhyolitoid in which the ratio of plagioclase to total feldspar is less than 0.1. QAPF field 2.",
    "children": []
  },
  {
    "uuid": "634f1803bcbfb314ddee9d2d",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "alkali feldspar syenite",
    "definition": "Alkali feldspar syenitic rock that contains 0-5 percent quartz and no feldspathoid in the QAPF fraction. QAPF field 6.",
    "children": []
  },
  {
    "uuid": "634f1803bcbfb314ddee9d2e",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "alkali feldspar syenitic rock",
    "definition": "Syenitoid with a plagioclase to total feldspar ratio of less than 0.1. QAPF fields 6, 6*, and 6'.",
    "children": []
  },
  {
    "uuid": "634f1803bcbfb314ddee9d2f",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "alkali feldspar trachyte",
    "definition": "Trachytoid that has a plagioclase to total feldspar ratio less than 0.1, between 0 and 5 percent quartz in the QAPF fraction, and no feldspathoid minerals. QAPF field 6.",
    "children": []
  },
  {
    "uuid": "634f1803bcbfb314ddee9d30",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "alkali feldspar trachytic rock",
    "definition": "Trachytoid that has a plagioclase to total feldspar ratio less than 0.1. QAPF fields 6, 6', and 6*.",
    "children": []
  },
  {
    "uuid": "634f1802bcbfb314ddee9d2a",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "alkali olivine basalt",
    "definition": "Alkali olivine basalt is silica-undersaturated, characterized by the absence of orthopyroxene, absence of quartz, presence of olivine, and typically contains some feldspathoid mineral, alkali feldspar or phlogopite in the groundmass. Feldspar phenocrysts typically are labradorite to andesine in composition. Augite is rich in titanium compared to augite in tholeiitic basalt. Alkali olivine basalt is relatively rich in sodium.",
    "children": []
  },
  {
    "uuid": "634f1803bcbfb314ddee9d31",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "amphibolite",
    "definition": "Metamorphic rock mainly consisting of green, brown or black amphibole and plagioclase (including albite), which combined form 75 percent or more of the rock, and both of which are present as major constituents. The amphibole constitutes 50 percent or more of the total mafic constituents and is present in an amount of 30 percent or more; other common minerals include quartz, clinopyroxene, garnet, epidote-group minerals, biotite, titanite and scapolite.",
    "children": []
  },
  {
    "uuid": "634f1804bcbfb314ddee9d32",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "andesite",
    "definition": "Fine-grained igneous rock with less than 20 percent quartz and less than 10 percent feldspathoid minerals in the QAPF fraction, in which the ratio of plagioclase to total feldspar is greater 0.65. Includes rocks defined modally in QAPF fields 9 and 10 or chemically in TAS field O2 as andesite. Basalt and andesite, which share the same QAPF fields, are distinguished chemically based on silica content, with basalt defined to contain less than 52 weight percent silica. If chemical data are not available, the color index is used to distinguish the categories, with basalt defined to contain greater than 35 percent mafic minerals by volume or greater than 40 percent mafic minerals by weight. Typically consists of plagioclase (frequently zoned from labradorite to oligoclase), pyroxene, hornblende and/or biotite. Fine grained equivalent of dioritic rock.",
    "children": []
  },
  {
    "uuid": "634f1804bcbfb314ddee9d33",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "anorthosite",
    "definition": "Anorthositic rock that contains between 0 and 5 percent quartz and no feldspathoid mineral in the QAPF fraction. QAPF field 10.",
    "children": []
  },
  {
    "uuid": "634f1804bcbfb314ddee9d34",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "anorthositic rock",
    "definition": "Leucocratic phaneritic crystalline igneous rock consisting essentially of plagioclase, often with small amounts of pyroxene. By definition, colour index M is less than 10, and plagiclase to total feldspar ratio is greater than 0.9. Less than 20 percent quartz and less than 10 percent feldspathoid in the QAPF fraction. QAPF field 10, 10*, and 10'.",
    "children": []
  },
  {
    "uuid": "634f1804bcbfb314ddee9d35",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "anthracite",
    "definition": "Coal that has vitrinite mean random reflectance greater than 2.0% (determined in conformance with ISO 7404-5). Less than 12-14 percent volatiles (dry, ash free), greater than 91 percent fixed carbon (dry, ash free basis). The highest rank coal; very hard, glossy, black, with semimetallic luster, semi conchoidal fracture.",
    "children": []
  },
  {
    "uuid": "634f1804bcbfb314ddee9d36",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "anthropogenic material",
    "definition": "Material known to have artificial (human-related) origin; insufficient information to classify in more detail.",
    "children": []
  },
  {
    "uuid": "634f1804bcbfb314ddee9d37",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "anthropogenic unconsolidated material",
    "definition": "Unconsolidated material known to have artificial (human-related) origin.",
    "children": []
  },
  {
    "uuid": "634f1804bcbfb314ddee9d38",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "aphanite",
    "definition": "Rock that is too fine grained to categorize in more detail.",
    "children": []
  },
  {
    "uuid": "634f1804bcbfb314ddee9d39",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "aplite",
    "definition": "Light coloured crystalline rock, characterized by a fine grained allotriomorphic-granular (aplitic, saccharoidal or xenomorphic) texture; typically granitic composition, consisting of quartz, alkali feldspar and sodic plagioclase.",
    "children": []
  },
  {
    "uuid": "634f1804bcbfb314ddee9d3a",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "arenite",
    "definition": "Clastic sandstone that contains less than 10 percent matrix. Matrix is mud-size silicate minerals (clay, feldspar, quartz, rock fragments, and alteration products) of detrital or diagenetic nature.",
    "children": []
  },
  {
    "uuid": "634f1804bcbfb314ddee9d3b",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "ash and lapilli",
    "definition": "Tephra in which less than 25 percent of fragments are greater than 64 mm in longest dimension",
    "children": []
  },
  {
    "uuid": "634f1804bcbfb314ddee9d3c",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "ash breccia bomb or block tephra",
    "definition": "Tephra in which more than 25 percent of particles are greater than 64 mm in largest dimension. Includes ash breccia, bomb tephra and block tephra of Gillespie and Styles (1999)",
    "children": []
  },
  {
    "uuid": "634f1804bcbfb314ddee9d3d",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "ash tuff lapillistone and lapilli tuff",
    "definition": "Pyroclastic rock in which less than 25 percent of rock by volume are more than 64 mm in longest diameter. Includes tuff, lapilli tuff, and lapillistone.",
    "children": []
  },
  {
    "uuid": "634f1804bcbfb314ddee9d3e",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "basalt",
    "definition": "Fine-grained or porphyritic igneous rock with less than 20 percent quartz, and less than 10 percent feldspathoid minerals, in which the ratio of plagioclase to total feldspar is greater 0.65. Typically composed of calcic plagioclase and clinopyroxene; phenocrysts typically include one or more of calcic plagioclase, clinopyroxene, orthopyroxene, and olivine. Includes rocks defined modally in QAPF fields 9 and 10 or chemically in TAS field B as basalt. Basalt and andesite are distinguished chemically based on silica content, with basalt defined to contain less than 52 weight percent silica. If chemical data are not available, the color index is used to distinguish the categories, with basalt defined to contain greater than 35 percent mafic minerals by volume or greater than 40 percent mafic minerals by weight.",
    "children": []
  },
  {
    "uuid": "634f1804bcbfb314ddee9d3f",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "basanite",
    "definition": "Tephritoid that has a plagioclase to total feldspar ratio greater than 0.9, and contains more than 10 percent normative (CIPW) olivine.",
    "children": []
  },
  {
    "uuid": "634f1804bcbfb314ddee9d40",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "basanitic foidite",
    "definition": "Foiditoid that contains less than 90 percent feldspathoid minerals in the QAPF fraction, and has a plagioclase to total feldspar ratio that is greater than 0.5, with greater than 10 percent normative olivine.",
    "children": []
  },
  {
    "uuid": "634f1805bcbfb314ddee9d41",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "basic igneous material",
    "definition": "Igneous material with between 45 and 52 percent SiO2.",
    "children": []
  },
  {
    "uuid": "634f1805bcbfb314ddee9d42",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "basic igneous rock",
    "definition": "Igneous rock with between 45 and 52 percent SiO2.",
    "children": []
  },
  {
    "uuid": "634f1805bcbfb314ddee9d43",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "bauxite",
    "definition": "Highly aluminous material containing abundant aluminium hydroxides (gibbsite, less commonly boehmite, diaspore) and aluminium-substituted iron oxides or hydroxides and generally minor or negligible kaolin minerals; may contain up to 20 percent quartz. commonly has a pisolitic or nodular texture, and may be cemented.",
    "children": []
  },
  {
    "uuid": "634f1805bcbfb314ddee9d44",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "biogenic sediment",
    "definition": "Sediment composed of greater than 50 percent material of biogenic origin. Because the biogenic material may be skeletal remains that are not organic, all biogenic sediment is not necessarily organic-rich.",
    "children": []
  },
  {
    "uuid": "634f1805bcbfb314ddee9d45",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "biogenic silica sedimentary rock",
    "definition": "Sedimentary rock that consists of at least 50 percent silicate mineral material, deposited directly by biological processes at the depositional surface, or in particles formed by biological processes within the basin of deposition.",
    "children": []
  },
  {
    "uuid": "634f1805bcbfb314ddee9d46",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "bituminous coal",
    "definition": "Coal that has vitrinite mean random reflectance greater than 0.6% and less than 2.0% (determined in conformance with ISO 7404-5), or has a gross calorific value greater than 24 MJ/kg (determined in conformance with ISO 1928). Hard, black, organic rich sedimentary rock; contains less than 91 percent fixed carbon on a dry, mineral-matter-free basis, and greater than 13-14 percent volatiles (dry, ash free). Formed from the compaction or induration of variously altered plant remains similar to those of peaty deposits.",
    "children": []
  },
  {
    "uuid": "634f1805bcbfb314ddee9d47",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "boninite",
    "definition": "andesitic rock that contains more than 8 percent MgO. Typically consists of phenocrysts of protoenstatite, orthopyroxene, clinopyroxene, and olivine in a glassy base full of crystallites, and exhibits textures characterisitc of rapid crystal growth.",
    "children": []
  },
  {
    "uuid": "634f1805bcbfb314ddee9d48",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "boulder gravel size sediment",
    "definition": "Sediment containing greater than 30 percent boulder-size particles (greater than 256 mm in diameter)",
    "children": []
  },
  {
    "uuid": "634f1805bcbfb314ddee9d49",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "boundstone",
    "definition": "Sedimentary carbonate rock with preserved biogenic texture, whose original components were bound and encrusted together during deposition by the action of plants and animals during deposition, and remained substantially in the position of growth.",
    "children": []
  },
  {
    "uuid": "634f1805bcbfb314ddee9d4a",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "breccia",
    "definition": "Coarse-grained material composed of angular broken rock fragments; the fragments typically have sharp edges and unworn corners. The fragments may be held together by a mineral cement or in a fine-grained matrix, and consolidated or nonconsolidated. Clasts may be of any composition or origin. In sedimentary environments, breccia is used for material that consists entirely of angular fragments, mostly derived from a single source rock body, as in a rock avalanche deposit, and matrix is interpreted to be the product of comminution of clasts during transport. Diamictite or diamicton is used when the material reflects mixing of rock from a variety of sources, some sub angular or subrounded clasts may be present, and matrix is pre-existing fine grained material that is not a direct product of the brecciation/deposition process.",
    "children": []
  },
  {
    "uuid": "634f1805bcbfb314ddee9d4b",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "breccia gouge series",
    "definition": "Fault material with features such as void spaces (filled or unfilled), or unconsolidated matrix material between fragments, indicating loss of cohesion during deformation. Includes fault-related breccia and gouge.",
    "children": []
  },
  {
    "uuid": "634f1805bcbfb314ddee9d4c",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "calcareous carbonate sediment",
    "definition": "Carbonate sediment with a calcite (plus aragonite) to dolomite ratio greater than 1 to 1. Includes lime-sediments.",
    "children": []
  },
  {
    "uuid": "634f1805bcbfb314ddee9d4d",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "calcareous carbonate sedimentary material",
    "definition": "Carbonate sedimentary material of unspecified consolidation state with a calcite (plus aragonite) to dolomite ratio greater than 1 to 1. Includes lime-sediments, limestone and dolomitic limestone.",
    "children": []
  },
  {
    "uuid": "634f1805bcbfb314ddee9d4e",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "calcareous carbonate sedimentary rock",
    "definition": "Carbonate sedimentary rock with a calcite (plus aragonite) to dolomite ratio greater than 1 to 1. Includes limestone and dolomitic limestone.",
    "children": []
  },
  {
    "uuid": "634f1806bcbfb314ddee9d4f",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "carbonate mud",
    "definition": "Carbonate sediment composed of less than 25 percent clasts that have a maximum diameter more than 2 mm, and the ratio of sand size to mud size clasts is less than one.",
    "children": []
  },
  {
    "uuid": "634f1806bcbfb314ddee9d50",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "carbonate mudstone",
    "definition": "Mudstone that consists of greater than 50 percent carbonate minerals of any origin in the mud size fraction.",
    "children": []
  },
  {
    "uuid": "634f1806bcbfb314ddee9d51",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "carbonate ooze",
    "definition": "ooze that consists of more than 50 percent carbonate skeletal remains",
    "children": []
  },
  {
    "uuid": "634f1806bcbfb314ddee9d52",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "carbonate rich mud",
    "definition": "Mud size sediment that contains between 10 and 50 percent carbonate minerals in any size fraction. Carbonate origin is not specified.",
    "children": []
  },
  {
    "uuid": "634f1806bcbfb314ddee9d53",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "carbonate rich mudstone",
    "definition": "Mudstone that contains between 10 and 50 percent carbonate minerals in the mud size fraction. Carbonate origin is not specified.",
    "children": []
  },
  {
    "uuid": "634f1806bcbfb314ddee9d54",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "carbonate sediment",
    "definition": "Sediment in which at least 50 percent of the primary and/or recrystallized constituents are composed of one (or more) of the carbonate minerals calcite, aragonite and dolomite, in particles of intrabasinal origin.",
    "children": []
  },
  {
    "uuid": "634f1806bcbfb314ddee9d55",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "carbonate sedimentary material",
    "definition": "Sedimentary material in which at least 50 percent of the primary and/or recrystallized constituents are composed of one (or more) of the carbonate minerals calcite, aragonite and dolomite, in particles of intrabasinal origin.",
    "children": []
  },
  {
    "uuid": "634f1806bcbfb314ddee9d56",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "carbonate sedimentary rock",
    "definition": "Sedimentary rock in which at least 50 percent of the primary and/or recrystallized constituents are composed of one (or more) of the carbonate minerals calcite, aragonite, magnesite or dolomite.",
    "children": []
  },
  {
    "uuid": "634f1806bcbfb314ddee9d57",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "carbonate wackestone",
    "definition": "Carbonate sedimentary rock with discernible mud supported depositional texture and containing greater than 10 percent allochems, and constituent particles are of intrabasinal origin. If particles are not intrabasinal, categorization as a mudstone or wackestone should be considered.",
    "children": []
  },
  {
    "uuid": "634f1806bcbfb314ddee9d58",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "carbonatite",
    "definition": "Igneous rock composed of more than 50 percent modal carbonate minerals.",
    "children": []
  },
  {
    "uuid": "634f1806bcbfb314ddee9d59",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "cataclasite series",
    "definition": "Fault-related rock that maintained primary cohesion during deformation, with matrix comprising greater than 10 percent of rock mass; matrix is fine-grained material formed through grain size reduction by fracture as opposed to crystal plastic process that operate in mylonitic rock. Includes cataclasite, protocataclasite and ultracataclasite.",
    "children": []
  },
  {
    "uuid": "634f1806bcbfb314ddee9d5a",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "chalk",
    "definition": "A generally soft, white, very fine-grained, extremely pure, porous limestone. It forms under marine conditions from the gradual accumulation of skeletal elements from minute planktonic green algae (cocoliths), associated with varying proportions of larger microscopic fragments of bivalves, foraminifera and ostracods. It is common to find flint and chert nodules embedded in chalk.",
    "children": []
  },
  {
    "uuid": "634f1806bcbfb314ddee9d5b",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "chemical sedimentary material",
    "definition": "Sedimentary material that consists of at least 50 percent material produced by inorganic chemical processes within the basin of deposition. Includes inorganic siliceous, carbonate, evaporite, iron-rich, and phosphatic sediment classes.",
    "children": []
  },
  {
    "uuid": "634f1806bcbfb314ddee9d5c",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "chlorite actinolite epidote metamorphic rock",
    "definition": "Metamorphic rock characterized by 50 percent or more of combined chlorite, actinolite and epidote. Category for rocks generally named greenschist or greenstone.",
    "children": []
  },
  {
    "uuid": "634f1807bcbfb314ddee9d60",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "clastic sediment",
    "definition": "Sediment in which at least 50 percent of the constituent particles were derived from erosion, weathering, or mass-wasting of pre-existing earth materials, and transported to the place of deposition by mechanical agents such as water, wind, ice and gravity.",
    "children": []
  },
  {
    "uuid": "634f1807bcbfb314ddee9d61",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "clastic sedimentary material",
    "definition": "Sedimentary material of unspecified consolidation state in which at least 50 percent of the constituent particles were derived from erosion, weathering, or mass-wasting of pre-existing earth materials, and transported to the place of deposition by mechanical agents such as water, wind, ice and gravity.",
    "children": []
  },
  {
    "uuid": "634f1807bcbfb314ddee9d62",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "clastic sedimentary rock",
    "definition": "Sedimentary rock in which at least 50 percent of the constituent particles were derived from erosion, weathering, or mass-wasting of pre-existing earth materials, and transported to the place of deposition by mechanical agents such as water, wind, ice and gravity.",
    "children": []
  },
  {
    "uuid": "634f1807bcbfb314ddee9d63",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "clay",
    "definition": "Mud that consists of greater than 50 percent particles with grain size less than 0.004 mm",
    "children": []
  },
  {
    "uuid": "634f1807bcbfb314ddee9d64",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "claystone",
    "definition": "Mudstone that contains no detectable silt, inferred to consist virtually entirely of clay-size particles.",
    "children": []
  },
  {
    "uuid": "634f1807bcbfb314ddee9d65",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "coal",
    "definition": "A consolidated organic sedimentary material having less than 75% moisture. This category includes low, medium, and high rank coals according to International Classification of In-Seam Coal (United Nations, 1998), thus including lignite. Sapropelic coal is not distinguished in this category from humic coals. Formed from the compaction or induration of variously altered plant remains similar to those of peaty deposits.",
    "children": []
  },
  {
    "uuid": "634f1807bcbfb314ddee9d66",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "cobble gravel size sediment",
    "definition": "Sediment containing greater than 30 percent cobble-size particles (64-256 mm in diameter)",
    "children": []
  },
  {
    "uuid": "634f1807bcbfb314ddee9d67",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "composite genesis material",
    "definition": "Material of unspecified consolidation state formed by geological modification of pre-existing materials outside the realm of igneous and sedimentary processes. Includes rocks formed by impact metamorphism, standard dynamothermal metamorphism, brittle deformation, weathering, metasomatism and hydrothermal alteration (diagenesis is a sedimentary process in this context).",
    "children": []
  },
  {
    "uuid": "634f1807bcbfb314ddee9d68",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "composite genesis rock",
    "definition": "Rock formed by geological modification of pre-existing rocks outside the realm of igneous and sedimentary processes. Includes rocks formed by impact metamorphism, standard dynamothermal metamorphism, brittle deformation, weathering, metasomatism and hydrothermal alteration (diagenesis is a sedimentary process in this context).",
    "children": []
  },
  {
    "uuid": "634f1808bcbfb314ddee9d69",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "compound material",
    "definition": "An Earth Material composed of an aggregation of particles of Earth Material, possibly including other compound Materials. This is 'top' of lithology category hierarchy, and should be used to indicate 'any rock or unconsolidated material'.",
    "children": []
  },
  {
    "uuid": "634f1807bcbfb314ddee9d5d",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "conglomerate",
    "definition": "Clastic sedimentary rock composed of at least 30 percent rounded to subangular fragments larger than 2 mm in diameter; typically contains finer grained material in interstices between larger fragments. If more than 15 percent of the fine grained matrix is of indeterminant clastic or diagenetic origin and the fabric is matrix supported, may also be categorized as wackestone. If rock has unsorted or poorly sorted texture with a wide range of particle sizes, may also be categorized as diamictite.",
    "children": []
  },
  {
    "uuid": "634f1808bcbfb314ddee9d6a",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "crystalline carbonate",
    "definition": "Carbonate rock of indeterminate mineralogy in which diagenetic processes have obliterated any original depositional texture.",
    "children": []
  },
  {
    "uuid": "634f1808bcbfb314ddee9d6b",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "dacite",
    "definition": "Fine grained or porphyritic crystalline rock that contains less than 90 percent mafic minerals, between 20 and 60 percent quartz in the QAPF fraction, and has a plagioclase to total feldspar ratio greater than 0.65. Includes rocks defined modally in QAPF fields 4 and 5 or chemically in TAS Field O3. Typcially composed of quartz and sodic plagioclase with minor amounts of biotite and/or hornblende and/or pyroxene; fine-grained equivalent of granodiorite and tonalite.",
    "children": []
  },
  {
    "uuid": "634f1808bcbfb314ddee9d6c",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "diamictite",
    "definition": "Unsorted or poorly sorted, clastic sedimentary rock with a wide range of particle sizes including a muddy matrix. Biogenic materials that have such texture are excluded. Distinguished from conglomerate, sandstone, mudstone based on polymodality and lack of structures related to transport and deposition of sediment by moving air or water. If more than 10 percent of the fine grained matrix is of indeterminant clastic or diagenetic origin and the fabric is matrix supported, may also be categorized as wacke.",
    "children": []
  },
  {
    "uuid": "634f1808bcbfb314ddee9d6d",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "diamicton",
    "definition": "Unsorted or poorly sorted, clastic sediment with a wide range of particle sizes, including a muddy matrix. Biogenic materials that have such texture are excluded. Distinguished from conglomerate, sandstone, mudstone based on polymodality and lack of structures related to transport and deposition of sediment by moving air or water. Assignment to an other size class can be used in conjunction to indicate the dominant grain size.",
    "children": []
  },
  {
    "uuid": "634f1808bcbfb314ddee9d6e",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "diorite",
    "definition": "Phaneritic crystalline rock consisting of intermediate plagioclase, commonly with hornblende and often with biotite or augite; colour index M less than 90, sodic plagioclase (An0-An50), no feldspathoid, and between 0 and 5 percent quartz. Includes rocks defined modally in QAPF field 10 as diorite.",
    "children": []
  },
  {
    "uuid": "634f1808bcbfb314ddee9d6f",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "dioritic rock",
    "definition": "Phaneritic crystalline rock with M less than 90, consisting of intermediate plagioclase, commonly with hornblende and often with biotite or augite. A dioritoid with a plagioclase to total feldspar ratio (in the QAPF fraction) greater than 0.9. Includes rocks defined modally in QAPF fields 10, 10' and 10*.",
    "children": []
  },
  {
    "uuid": "634f1808bcbfb314ddee9d70",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "dioritoid",
    "definition": "Phaneritic crystalline igneous rock with M less than 90, consisting of intermediate plagioclase, commonly with hornblende and often with biotite or augite. Plagioclase to total feldspar ratio is greater that 0.65, and anorthite content of plagioclase is less than 50 percent. Less than 10 percent feldspathoid mineral and less than 20 percent quartz in the QAPF fraction. Includes rocks defined modally in QAPF fields 9 and 10 (and their subdivisions).",
    "children": []
  },
  {
    "uuid": "634f1808bcbfb314ddee9d71",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "doleritic rock",
    "definition": "Dark colored gabbroic (basaltic) or dioritic (andesitic) rock intermediate in grain size between basalt and gabbro and composed of plagioclase, pyroxene and opaque minerals; often with ophitic texture. Typically occurs as hypabyssal intrusions. Includes dolerite, microdiorite, diabase and microgabbro.",
    "children": []
  },
  {
    "uuid": "634f1808bcbfb314ddee9d75",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "dolomite",
    "definition": "Pure carbonate sedimentary rock with a ratio of magnesium carbonate to calcite (plus aragonite) greater than 1 to 1.",
    "children": []
  },
  {
    "uuid": "634f1808bcbfb314ddee9d72",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "dolomitic or magnesian sedimentary material",
    "definition": "Carbonate sedimentary material of unspecified consolidation degree with a ratio of magnesium carbonate to calcite (plus aragonite) greater than 1 to 1. Includes dolomite sediment, dolostone, lime dolostone and magnesite-stone.",
    "children": []
  },
  {
    "uuid": "634f1808bcbfb314ddee9d73",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "dolomitic or magnesian sedimentary rock",
    "definition": "Carbonate sedimentary rock with a ratio of magnesium carbonate to calcite (plus aragonite) greater than 1 to 1. Includes dolostone, lime dolostone and magnesite-stone.",
    "children": []
  },
  {
    "uuid": "634f1808bcbfb314ddee9d74",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "dolomitic sediment",
    "definition": "Carbonate sediment with a ratio of magnesium carbonate to calcite (plus aragonite) greater than 1 to 1.",
    "children": []
  },
  {
    "uuid": "634f1808bcbfb314ddee9d76",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "duricrust",
    "definition": "Rock forming a hard crust or layer at or near the Earth's surface at the time of formation, e.g. in the upper horizons of a soil, characterized by structures indicative of pedogenic origin.",
    "children": []
  },
  {
    "uuid": "634f1809bcbfb314ddee9d77",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "eclogite",
    "definition": "Metamorphic rock composed of 75 percent or more (by volume) omphacite and garnet, both of which are present as major constituents, the amount of neither of them being higher than 75 percent (by volume); the presence of plagioclase precludes classification as an eclogite.",
    "children": []
  },
  {
    "uuid": "634f1809bcbfb314ddee9d78",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "evaporite",
    "definition": "Nonclastic sedimentary rock composed of at least 50 percent non-carbonate salts, including chloride, sulfate or borate minerals; formed through precipitation of mineral salts from a saline solution (non-carbonate salt rock).",
    "children": []
  },
  {
    "uuid": "634f1809bcbfb314ddee9d79",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "exotic alkaline rock",
    "definition": "Kimberlite, lamproite, or lamprophyre. Generally are potassic, mafic or ultramafic rocks. Olivine (commonly serpentinized in kimberlite), and phlogopite are significant constituents.",
    "children": []
  },
  {
    "uuid": "634f1809bcbfb314ddee9d7a",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "exotic composition igneous rock",
    "definition": "Rock with 'exotic' mineralogical, textural or field setting characteristics; typically dark colored, with abundant phenocrysts. Criteria include: presence of greater than 10 percent melilite or leucite, or presence of kalsilite, or greater than 50 percent carbonate minerals. Includes Carbonatite, Melilitic rock, Kalsilitic rocks, Kimberlite, Lamproite, Leucitic rock and Lamprophyres.",
    "children": []
  },
  {
    "uuid": "634f1809bcbfb314ddee9d7b",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "exotic evaporite",
    "definition": "Evaporite that is not 50 percent halite or 50 percent gypsum or anhydrite.",
    "children": []
  },
  {
    "uuid": "634f1809bcbfb314ddee9d7c",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "fault related material",
    "definition": "Material formed as a result brittle faulting, composed of greater than 10 percent matrix; matrix is fine-grained material caused by tectonic grainsize reduction. Includes cohesive (cataclasite series) and non-cohesive (breccia-gouge series) material.",
    "children": []
  },
  {
    "uuid": "634f1809bcbfb314ddee9d7d",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "fine grained igneous rock",
    "definition": "Igneous rock in which the framework of the rock consists of crystals that are too small to determine mineralogy with the unaided eye; framework may include up to 50 percent glass. A significant percentage of the rock by volume may be phenocrysts. Includes rocks that are generally called volcanic rocks.",
    "children": []
  },
  {
    "uuid": "634f1809bcbfb314ddee9d7e",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "foid bearing alkali feldspar syenite",
    "definition": "Alkali feldspar syenitic rock that contains 0-10 percent feldspathoid mineral and no quartz in the QAPF fraction. QAPF field 6'.",
    "children": []
  },
  {
    "uuid": "634f1809bcbfb314ddee9d7f",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "foid bearing alkali feldspar trachyte",
    "definition": "Alkali feldspar trachytic rock that contains no quartz and between 0 and 10 percent feldspathoid mineral in the QAPF fraction. QAPF field 6'.",
    "children": []
  },
  {
    "uuid": "634f1809bcbfb314ddee9d80",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "foid bearing anorthosite",
    "definition": "Anorthositic rock that contains between 0 and 10 percent feldspathoid mineral and no quartz in the QAPF fraction. QAPF field 10'.",
    "children": []
  },
  {
    "uuid": "634f1809bcbfb314ddee9d81",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "foid bearing diorite",
    "definition": "Dioritic rock that contains between 0 and 10 percent feldspathoid minerals in the QAPF fraction. QAPF field 10'.",
    "children": []
  },
  {
    "uuid": "634f1809bcbfb314ddee9d82",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "foid bearing gabbro",
    "definition": "Gabbroic rock that contains 0-10 percent feldspathoid minerals and no quartz in the QAPF fraction. QAPF field 10'.",
    "children": []
  },
  {
    "uuid": "634f1809bcbfb314ddee9d83",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "foid bearing latite",
    "definition": "Latitic rock that contains no quartz and between 0 and 10 percent feldspathoid minerals in the QAPF fraction. QAPF field 8'.",
    "children": []
  },
  {
    "uuid": "634f1809bcbfb314ddee9d84",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "foid bearing monzodiorite",
    "definition": "Monzodioritic rock that contains between 0 and 10 percent feldspathoid mineral.",
    "children": []
  },
  {
    "uuid": "634f180abcbfb314ddee9d85",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "foid bearing monzogabbro",
    "definition": "Monzogabbroic rock that contains 0 to 10 percent feldspathoid mineral in the QAPF fraction. QAPF field 9'.",
    "children": []
  },
  {
    "uuid": "634f180abcbfb314ddee9d86",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "foid bearing monzonite",
    "definition": "Monzonitic rock that contains 0-10 percent feldspathoid mineral and no quartz in the QAPF fraction. Includes rocks defined modally in QAPF Field 8'.",
    "children": []
  },
  {
    "uuid": "634f180abcbfb314ddee9d87",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "foid bearing syenite",
    "definition": "Syenitic rock that contains between 0 and 10 percent feldspathoid mineral and no quartz in the QAPF fraction. Defined modally in QAPF Field 7'.",
    "children": []
  },
  {
    "uuid": "634f180abcbfb314ddee9d88",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "foid bearing trachyte",
    "definition": "Trachytic rock that contains between 0 and 10 percent feldspathoid in the QAPF fraction, and no quartz. QAPF field 7'.",
    "children": []
  },
  {
    "uuid": "634f180abcbfb314ddee9d89",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "foid diorite",
    "definition": "Foid dioritoid in which the plagioclase to total feldspar ratio is greater than 0.9. Includes rocks defined modally in QAPF field 14.",
    "children": []
  },
  {
    "uuid": "634f180abcbfb314ddee9d8a",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "foid dioritoid",
    "definition": "Phaneritic crystalline igneous rock in which M is less than 90, the plagioclase to total feldspar ratio is greater than 0.5, feldspathoid minerals form 10-60 percent of the QAPF fraction, plagioclase has anorthite content less than 50 percent. These rocks typically contain large amounts of mafic minerals. Includes rocks defined modally in QAPF fields 13 and 14.",
    "children": []
  },
  {
    "uuid": "634f180abcbfb314ddee9d8b",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "foid gabbro",
    "definition": "Foid gabbroid that has a plagioclase to total feldspar ratio greater than 0.9. Includes rocks defined modally in QAPF field 14.",
    "children": []
  },
  {
    "uuid": "634f180abcbfb314ddee9d8c",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "foid gabbroid",
    "definition": "Phaneritic crystalline igneous rock in which M is less than 90, the plagioclase to total feldspar ratio is greater than 0.5, feldspathoids form 10-60 percent of the QAPF fraction, and plagioclase has anorthite content greater than 50 percent. These rocks typically contain large amounts of mafic minerals. Includes rocks defined modally in QAPF fields 13 and 14.",
    "children": []
  },
  {
    "uuid": "634f180abcbfb314ddee9d8d",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "foid monzodiorite",
    "definition": "Foid dioritoid in which the plagioclase to total feldspar ratio is between 0.1 and 0.9. Includes rocks defined modally in QAPF field 13.",
    "children": []
  },
  {
    "uuid": "634f180abcbfb314ddee9d8e",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "foid monzogabbro",
    "definition": "Foid gabbroid that has a plagioclase to total feldspar ratio between 0.5 and 0.9. Includes rocks defined modally in QAPF field 13.",
    "children": []
  },
  {
    "uuid": "634f180abcbfb314ddee9d8f",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "foid monzosyenite",
    "definition": "Foid syenitoid rock that has a plagioclase to total feldspar ratio of between 0.1 and 0.5. Includes rocks defined modally in QAPF Field 12.",
    "children": []
  },
  {
    "uuid": "634f180abcbfb314ddee9d90",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "foid syenite",
    "definition": "Foid syenitoid that has a plagioclase to total feldspar ratio of less than 0.1. Includes rocks defined modally in QAPF field 11.",
    "children": []
  },
  {
    "uuid": "634f180abcbfb314ddee9d91",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "foid syenitoid",
    "definition": "Phaneritic crystalline igneous rock with M less than 90, contains between 10 and 60 percent feldspathoid mineral in the QAPF fraction, and has a plagioclase to total feldspar ratio less than 0.5. Includes QAPF fields 11 and 12.",
    "children": []
  },
  {
    "uuid": "634f180abcbfb314ddee9d92",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "foidite",
    "definition": "Foiditoid that contains greater than 90 percent feldspathoid minerals in the QAPF fraction.",
    "children": []
  },
  {
    "uuid": "634f180abcbfb314ddee9d93",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "foiditoid",
    "definition": "Fine grained crystalline rock containing less than 90 percent mafic minerals and more than 60 percent feldspathoid minerals in the QAPF fraction. Includes rocks defined modally in QAPF field 15 or chemically in TAS field F.",
    "children": []
  },
  {
    "uuid": "634f180bbcbfb314ddee9d94",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "foidolite",
    "definition": "Phaneritic crystalline rock containing more than 60 percent feldspathoid minerals in the QAPF fraction. Includes rocks defined modally in QAPF field 15",
    "children": []
  },
  {
    "uuid": "634f180bbcbfb314ddee9d95",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "foliated metamorphic rock",
    "definition": "Metamorphic rock in which 10 percent or more of the contained mineral grains are elements in a planar or linear fabric. Cataclastic or glassy character precludes classification with this concept.",
    "children": []
  },
  {
    "uuid": "634f180bbcbfb314ddee9d96",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "fragmental igneous material",
    "definition": "igneous_material of unspecified consolidation state in which greater than 75 percent of the rock consists of fragments produced as a result of igneous rock-forming process.",
    "children": []
  },
  {
    "uuid": "634f180bbcbfb314ddee9d97",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "fragmental igneous rock",
    "definition": "Igneous rock in which greater than 75 percent of the rock consists of fragments produced as a result of igneous rock-forming process. Includes pyroclastic rocks, autobreccia associated with lava flows and intrusive breccias. Excludes deposits reworked by epiclastic processes (see Tuffite)",
    "children": []
  },
  {
    "uuid": "634f180bbcbfb314ddee9d98",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "framestone",
    "definition": "Carbonate reef rock consisting of a rigid framework of colonies, shells or skeletons, with internal cavities filled with fine sediment; usually created through the activities of colonial organisms.",
    "children": []
  },
  {
    "uuid": "634f180bbcbfb314ddee9d99",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "gabbro",
    "definition": "Gabbroic rock that contains between 0 and 5 percent quartz and no feldspathoid mineral in the QAPF fraction. Includes rocks defined modally in QAPF Field 10 as gabbro.",
    "children": []
  },
  {
    "uuid": "634f180bbcbfb314ddee9d9a",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "gabbroic rock",
    "definition": "Gabbroid that has a plagioclase to total feldspar ratio greater than 0.9 in the QAPF fraction. Includes QAPF fields 10*, 10, and 10'. This category includes the various categories defined in LeMaitre et al. (2002) based on the mafic mineralogy, but apparently not subdivided based on the quartz/feldspathoid content.",
    "children": []
  },
  {
    "uuid": "634f180bbcbfb314ddee9d9b",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "gabbroid",
    "definition": "Phaneritic crystalline igneous rock that contains less than 90 percent mafic minerals, and up to 20 percent quartz or up to 10 percent feldspathoid in the QAPF fraction. The ratio of plagioclase to total feldspar is greater than 0.65, and anorthite content of the plagioclase is greater than 50 percent. Includes rocks defined modally in QAPF fields 9 and 10 and their subdivisions.",
    "children": []
  },
  {
    "uuid": "634f180bbcbfb314ddee9d9c",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "generic conglomerate",
    "definition": "Sedimentary rock composed of at least 30 percent rounded to subangular fragments larger than 2 mm in diameter; typically contains finer grained material in interstices between larger fragments. If more than 15 percent of the fine grained matrix is of indeterminant clastic or diagenetic origin and the fabric is matrix supported, may also be categorized as wackestone. If rock has unsorted or poorly sorted texture with a wide range of particle sizes, may also be categorized as diamictite.",
    "children": []
  },
  {
    "uuid": "634f180bbcbfb314ddee9d9d",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "generic mudstone",
    "definition": "Sedimentary rock consisting of less than 30 percent gravel-size (2 mm) particles and with a mud to sand ratio greater than 1. Clasts may be of any composition or origin.",
    "children": []
  },
  {
    "uuid": "634f180bbcbfb314ddee9d9e",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "generic sandstone",
    "definition": "Sedimentary rock in which less than 30 percent of particles are greater than 2 mm in diameter (gravel) and the sand to mud ratio is at least 1.",
    "children": []
  },
  {
    "uuid": "634f180bbcbfb314ddee9d9f",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "glass rich igneous rock",
    "definition": "Igneous rock that contains greater than 50 percent massive glass.",
    "children": []
  },
  {
    "uuid": "634f180bbcbfb314ddee9da0",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "glassy igneous rock",
    "definition": "Igneous rock that consists of greater than 80 percent massive glass.",
    "children": []
  },
  {
    "uuid": "634f180cbcbfb314ddee9da1",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "glaucophane lawsonite epidote metamorphic rock",
    "definition": "A metamorphic rock of roughly basaltic composition, defined by the presence of glaucophane with lawsonite or epidote. Other minerals that may be present include jadeite, albite, chlorite, garnet, and muscovite (phengitic white mica). Typically fine-grained, dark colored. Category for rocks commonly referred to as blueschist.",
    "children": []
  },
  {
    "uuid": "634f180cbcbfb314ddee9da2",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "gneiss",
    "definition": "Foliated metamorphic rock with bands or lenticles rich in granular minerals alternating with bands or lenticles rich in minerals with a flaky or elongate prismatic habit. Mylonitic foliation or well developed, continuous schistosity (greater than 50 percent of the rock consists of grains participate in a planar or linear fabric) precludes classification with this concept.",
    "children": []
  },
  {
    "uuid": "634f180cbcbfb314ddee9da3",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "grainstone",
    "definition": "Carbonate sedimentary rock with recognizable depositional fabric that is grain-supported, and constituent particles are of intrabasinal origin; contains little or no mud matrix. Distinction from sandstone is based on interpretation of intrabasinal origin of clasts and grain-supported fabric, but grainstone definition does not include a grain size criteria.",
    "children": []
  },
  {
    "uuid": "634f180cbcbfb314ddee9da4",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "granite",
    "definition": "Phaneritic crystalline rock consisting of quartz, alkali feldspar and plagioclase (typically sodic) in variable amounts, usually with biotite and/or hornblende. Includes rocks defined modally in QAPF Field 3.",
    "children": []
  },
  {
    "uuid": "634f180cbcbfb314ddee9da5",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "granitoid",
    "definition": "Phaneritic crystalline igneous rock consisting of quartz, alkali feldspar and/or plagioclase. Includes rocks defined modally in QAPF fields 2, 3, 4 and 5 as alkali feldspar granite, granite, granodiorite or tonalite.",
    "children": []
  },
  {
    "uuid": "634f180cbcbfb314ddee9da6",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "granodiorite",
    "definition": "Phaneritic crystalline rock consisting essentially of quartz, sodic plagioclase and lesser amounts of alkali feldspar with minor hornblende and biotite. Includes rocks defined modally in QAPF field 4.",
    "children": []
  },
  {
    "uuid": "634f180cbcbfb314ddee9da7",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "granofels",
    "definition": "Metamorphic rock with granoblastic fabric and very little or no foliation (less than 10 percent of the mineral grains in the rock are elements in a planar or linear fabric). Grainsize not specified.",
    "children": []
  },
  {
    "uuid": "634f180cbcbfb314ddee9da8",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "granulite",
    "definition": "Metamorphic rock of high metamorphic grade in which Fe-Mg silicate minerals are dominantly hydroxl-free; feldspar must be present, and muscovite is absent; rock contains less than 90 percent mafic minerals, less than 75 percent calcite and/or dolomite, less than 75 percent quartz, less than 50 percent iron-bearing minerals (hematite, magnetite, limonite-group, siderite, iron-sulfides), and less than 50 percent calc-silicate minerals.",
    "children": []
  },
  {
    "uuid": "634f180cbcbfb314ddee9da9",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "gravel",
    "definition": "Clastic sediment containing greater than 30 percent gravel-size particles (greater than 2.0 mm diameter). Gravel in which more than half of the particles are of epiclastic origin",
    "children": []
  },
  {
    "uuid": "634f180cbcbfb314ddee9daa",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "gravel size sediment",
    "definition": "Sediment containing greater than 30 percent gravel-size particles (greater than 2.0 mm diameter). Composition or gensis of clasts not specified.",
    "children": []
  },
  {
    "uuid": "634f181dbcbfb314ddee9e09",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "gypsum or anhydrite",
    "definition": "Evaporite composed of at least 50 percent gypsum or anhydrite.",
    "children": []
  },
  {
    "uuid": "634f180cbcbfb314ddee9dab",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "high magnesium fine grained igneous rock",
    "definition": "fine-grained igneous rock that contains unusually high concentration of MgO. For rocks that contain greater than 52 percent silica, MgO must be greater than 8 percent. For rocks containing less than 52 percent silica, MgO must be greater than 12 percent.",
    "children": []
  },
  {
    "uuid": "634f1814bcbfb314ddee9dac",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "hornblendite",
    "definition": "Ultramafic rock that consists of greater than 40 percent hornblende plus pyroxene and has a hornblende to pyroxene ratio greater than 1. Includes olivine hornblendite, olivine-pyroxene hornblendite, pyroxene hornblendite, and hornblendite.",
    "children": []
  },
  {
    "uuid": "634f1814bcbfb314ddee9dad",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "hornfels",
    "definition": "Granofels formed by contact metamorphism, composed of a mosaic of equidimensional grains in a characteristically granoblastic or decussate matrix; porphyroblasts or relict phenocrysts may be present. Typically fine grained.",
    "children": []
  },
  {
    "uuid": "634f1814bcbfb314ddee9dae",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "hybrid sediment",
    "definition": "Sediment that does not fit any of the other sediment composition/genesis categories. Sediment consisting of three or more components which form more than 5 percent but less than 50 precent of the material.",
    "children": []
  },
  {
    "uuid": "634f1814bcbfb314ddee9daf",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "hybrid sedimentary rock",
    "definition": "Sedimentary rock that does not fit any of the other composition/genesis categories. Sedimentary rock consisting of three or more components which form more than 5 percent but less than 50 precent of the material.",
    "children": []
  },
  {
    "uuid": "634f1814bcbfb314ddee9db0",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "igneous material",
    "definition": "Earth material formed as a result of igneous processes, eg. intrusion and cooling of magma in the crust, volcanic eruption.",
    "children": []
  },
  {
    "uuid": "634f1814bcbfb314ddee9db1",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "igneous rock",
    "definition": "rock formed as a result of igneous processes, for example intrusion and cooling of magma in the crust, or volcanic eruption.",
    "children": []
  },
  {
    "uuid": "634f1814bcbfb314ddee9db2",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "impact generated material",
    "definition": "Material that contains features indicative of shock metamorphism, such as microscopic planar deformation features within grains or shatter cones, interpreted to be the result of extraterrestrial bolide impact. Includes breccias and melt rocks.",
    "children": []
  },
  {
    "uuid": "634f1814bcbfb314ddee9db3",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "impure calcareous carbonate sediment",
    "definition": "Carbonate sediment in which between 50 and 90 percent of the constituents are composed of one (or more) of the carbonate minerals in particles of intrabasinal origin, and a calcite (plus aragonite) to dolomite ratio greater than 1 to 1.",
    "children": []
  },
  {
    "uuid": "634f1814bcbfb314ddee9db4",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "impure carbonate sediment",
    "definition": "Carbonate sediment in which between 50 and 90 percent of the constituents are composed of one (or more) of the carbonate minerals in particles of intrabasinal origin.",
    "children": []
  },
  {
    "uuid": "634f1814bcbfb314ddee9db5",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "impure carbonate sedimentary rock",
    "definition": "Sedimentary rock in which between 50 and 90 percent of the primary and/or recrystallized constituents are composed of carbonate minerals.",
    "children": []
  },
  {
    "uuid": "634f1815bcbfb314ddee9db7",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "impure dolomite",
    "definition": "Impure carbonate sedimentary rock with a ratio of magnesium carbonate to calcite (plus aragonite) greater than 1 to 1.",
    "children": []
  },
  {
    "uuid": "634f1814bcbfb314ddee9db6",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "impure dolomitic sediment",
    "definition": "Carbonate sediment in which between 50 and 90 percent of the constituents are composed of one (or more) of the carbonate minerals in particles of intrabasinal origin, and the ratio of magnesium carbonate to calcite (plus aragonite) greater than 1 to 1.",
    "children": []
  },
  {
    "uuid": "634f1815bcbfb314ddee9db8",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "impure limestone",
    "definition": "Impure carbonate sedimentary rock with a calcite (plus aragonite) to dolomite ratio greater than 1 to 1.",
    "children": []
  },
  {
    "uuid": "634f1815bcbfb314ddee9db9",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "intermediate composition igneous material",
    "definition": "Igneous material with between 52 and 63 percent SiO2.",
    "children": []
  },
  {
    "uuid": "634f1815bcbfb314ddee9dba",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "intermediate composition igneous rock",
    "definition": "Igneous rock with between 52 and 63 percent SiO2.",
    "children": []
  },
  {
    "uuid": "634f1815bcbfb314ddee9dbb",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "iron rich sediment",
    "definition": "Sediment that consists of at least 50 percent iron-bearing minerals (hematite, magnetite, limonite-group, siderite, iron-sulfides), as determined by hand-lens or petrographic analysis. Corresponds to a rock typically containing 15 percent iron by weight.",
    "children": []
  },
  {
    "uuid": "634f1815bcbfb314ddee9dbc",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "iron rich sedimentary material",
    "definition": "Sedimentary material of unspecified consolidation state that consists of at least 50 percent iron-bearing minerals (hematite, magnetite, limonite-group, siderite, iron-sulfides), as determined by hand-lens or petrographic analysis. Corresponds to a rock typically containing 15 percent iron by weight.",
    "children": []
  },
  {
    "uuid": "634f1815bcbfb314ddee9dbd",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "iron rich sedimentary rock",
    "definition": "Sedimentary rock that consists of at least 50 percent iron-bearing minerals (hematite, magnetite, limonite-group, siderite, iron-sulfides), as determined by hand-lens or petrographic analysis. Corresponds to a rock typically containing 15 percent iron by weight.",
    "children": []
  },
  {
    "uuid": "634f1815bcbfb314ddee9dbe",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "kalsilitic and melilitic rocks",
    "definition": "Igneous rock containing greater than 10 percent melilite or kalsilite. Typically undersaturated, ultrapotassic (kalsilitic rocks) or calcium-rich (melilitic rocks) mafic or ultramafic rocks.",
    "children": []
  },
  {
    "uuid": "634f1815bcbfb314ddee9dbf",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "komatiitic rock",
    "definition": "Ultramafic, magnesium-rich volcanic rock, typically with spinifex texture of intergrown skeletal and bladed olivine and pyroxene crystals set in abundant glass. Includes komatiite and meimechite.",
    "children": []
  },
  {
    "uuid": "634f1815bcbfb314ddee9dc0",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "latite",
    "definition": "Latitic rock that contains between 0 and 5 percent quartz and no feldspathoid in the QAPF fraction. QAPF field 8.",
    "children": []
  },
  {
    "uuid": "634f1815bcbfb314ddee9dc1",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "latitic rock",
    "definition": "Trachytoid that has a plagioclase to total feldspar ratio between 0.35 and 0.65. QAPF fields 8, 8' and 8*.",
    "children": []
  },
  {
    "uuid": "634f1815bcbfb314ddee9dc2",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "lignite",
    "definition": "Coal that has a gross calorific value less than 24 MJ/kg (determined in conformance with ISO 1928), and vitrinite mean random reflectance less than 0.6% (determined in conformance with ISO 7404-5). Gross calorific value is recalculated to a moist, ash free basis using bed moisture (determined according to ISO 1015 or ISO 5068). Includes all low-rank coals, including sub-bitiminous coal. A consolidated, dull, soft brown to black coal having many readily discernible plant fragments set in a finer grained organic matrix. Tends to crack and fall apart on drying. Operationally sub-bituminous and bitiminous coal are qualitatively distinguished based on brown streak for sub-bitiminous coal and black streak for bituminous coal.",
    "children": []
  },
  {
    "uuid": "634f1815bcbfb314ddee9dc3",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "limestone",
    "definition": "Pure carbonate sedimentary rock with a calcite (plus aragonite) to dolomite ratio greater than 1 to 1. Includes limestone and dolomitic limestone.",
    "children": []
  },
  {
    "uuid": "634f1815bcbfb314ddee9dc4",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "marble",
    "definition": "Metamorphic rock consisting of greater than 75 percent fine- to coarse-grained recrystallized calcite and/or dolomite; usually with a granoblastic, saccharoidal texture.",
    "children": []
  },
  {
    "uuid": "634f1816bcbfb314ddee9dc5",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "material formed in surficial environment",
    "definition": "Material that is the product of weathering processes operating on pre-existing rocks or deposits, analogous to hydrothermal or metasomatic rocks, but formed at ambient Earth surface temperature and pressure.",
    "children": []
  },
  {
    "uuid": "634f1816bcbfb314ddee9dc6",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "metamorphic rock",
    "definition": "Rock formed by solid-state mineralogical, chemical and/or structural changes to a pre-existing rock, in response to marked changes in temperature, pressure, shearing stress and chemical environment.",
    "children": []
  },
  {
    "uuid": "634f1816bcbfb314ddee9dc7",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "metasomatic rock",
    "definition": "Rock that has fabric and composition indicating open-system mineralogical and chemical changes in response to interaction with a fluid phase, typically water rich.",
    "children": []
  },
  {
    "uuid": "634f1816bcbfb314ddee9dc8",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "mica schist",
    "definition": "A schist that consists of more than 50 percent mica minerals, typically muscovite or biotite. Special type included to distinguish this common variety of schist.",
    "children": []
  },
  {
    "uuid": "634f1816bcbfb314ddee9dc9",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "migmatite",
    "definition": "Silicate metamorphic rock that is pervasively heterogeneous on a decimeter to meter scale that typically consists of darker and lighter parts; the darker parts usually exhibit features of metamorphic rocks whereas the lighter parts are of igneous-looking appearance.",
    "children": []
  },
  {
    "uuid": "634f1816bcbfb314ddee9dca",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "monzodiorite",
    "definition": "Phaneritic crystalline igneous rock consisting of sodic plagioclase (An0 to An50), alkali feldspar, hornblende and biotite, with or without pyroxene, and 0 to 5 percent quartz. Includes rocks defined modally in QAPF field 9.",
    "children": []
  },
  {
    "uuid": "634f1816bcbfb314ddee9dcb",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "monzodioritic rock",
    "definition": "Phaneritic crystalline igneous rock consisting of sodic plagioclase (An0 to An50), alkali feldspar, hornblende and biotite, with or without pyroxene, and 0 to 10 percent feldspathoid or 0 to 20 percent quartz in the QAPF fraction. Plagioclase to total feldspar ratio in the QAPF fraction is between 0.65 and 0.9. Includes rocks defined modally in QAPF field 9, 9' and 9* as monzodiorite, foid-beaing monzodiorite, and quartz monzodiorite.",
    "children": []
  },
  {
    "uuid": "634f1816bcbfb314ddee9dcc",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "monzogabbro",
    "definition": "Monzogabbroic rock that contains between 0 an 5 percent quartz and no feldspathoid mineral in the QAPF fraction. Includes rocks defined modally in QAPF field 9 .",
    "children": []
  },
  {
    "uuid": "634f1816bcbfb314ddee9dcd",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "monzogabbroic rock",
    "definition": "Gabbroid with a plagioclase to total feldspar ratio between 0.65 and 0.9. QAPF field 9, 9 prime and 9 asterisk",
    "children": []
  },
  {
    "uuid": "634f1816bcbfb314ddee9dce",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "monzogranite",
    "definition": "Granite that has a plagiolcase to total feldspar ratio between 0.35 and 0.65. QAPF field 3b.",
    "children": []
  },
  {
    "uuid": "634f1816bcbfb314ddee9dcf",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "monzonite",
    "definition": "Monzonitic rock that contains 0-5 percent quartz and no feldspathoid mineral in the QAPF fraction. Includes rocks defined modally in QAPF Field 8.",
    "children": []
  },
  {
    "uuid": "634f1816bcbfb314ddee9dd0",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "monzonitic rock",
    "definition": "Syenitoid with a plagioclase to total feldspar ratio between 0.35 and 0.65. Includes rocks in QAPF fields 8, 8*, and 8'.",
    "children": []
  },
  {
    "uuid": "634f1816bcbfb314ddee9dd1",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "mud",
    "definition": "Clastic sediment consisting of less than 30 percent gravel-size (2 mm) particles and with a mud-size to sand-size particle ratio greater than 1. More than half of the particles are of epiclastic origin.",
    "children": []
  },
  {
    "uuid": "634f1817bcbfb314ddee9dd2",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "mud size sediment",
    "definition": "Sediment consisting of less than 30 percent gravel-size (2 mm) particles and with a mud-size to sand-size particle ratio greater than 1. Clasts may be of any composition or origin.",
    "children": []
  },
  {
    "uuid": "634f1807bcbfb314ddee9d5e",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "mudstone",
    "definition": "Clastic sedimentary rock consisting of less than 30 percent gravel-size (2 mm) particles and with a mud to sand ratio greater than 1.",
    "children": []
  },
  {
    "uuid": "634f1817bcbfb314ddee9dd3",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "mylonitic rock",
    "definition": "Metamorphic rock characterised by a foliation resulting from tectonic grain size reduction, in which more than 10 percent of the rock volume has undergone grain size reduction. Includes protomylonite, mylonite, ultramylonite, and blastomylonite.",
    "children": []
  },
  {
    "uuid": "634f1817bcbfb314ddee9dd4",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "natural unconsolidated material",
    "definition": "Unconsolidated material known to have natural, ie. not human-made, origin.",
    "children": []
  },
  {
    "uuid": "634f1817bcbfb314ddee9dd5",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "non clastic siliceous sediment",
    "definition": "Sediment that consists of at least 50 percent silicate mineral material, deposited directly by chemical or biological processes at the depositional surface, or in particles formed by chemical or biological processes within the basin of deposition.",
    "children": []
  },
  {
    "uuid": "634f1817bcbfb314ddee9dd6",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "non clastic siliceous sedimentary material",
    "definition": "Sedimentary material that consists of at least 50 percent silicate mineral material, deposited directly by chemical or biological processes at the depositional surface, or in particles formed by chemical or biological processes within the basin of deposition.",
    "children": []
  },
  {
    "uuid": "634f1817bcbfb314ddee9dd7",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "non clastic siliceous sedimentary rock",
    "definition": "Sedimentary rock that consists of at least 50 percent silicate mineral material, deposited directly by chemical or biological processes at the depositional surface, or in particles formed by chemical or biological processes within the basin of deposition.",
    "children": []
  },
  {
    "uuid": "634f1817bcbfb314ddee9dd8",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "ooze",
    "definition": "Biogenic sediment consisting of less than 1 percent gravel-size (greater than or equal to 2 mm) particles, with a sand to mud ratio less than 1 to 9, and less than 50 percent carbonate minerals.",
    "children": []
  },
  {
    "uuid": "634f1817bcbfb314ddee9dd9",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "organic bearing mudstone",
    "definition": "Mudstone that contains a significant amount of organic carbon, typically kerogen. commonly finely laminated, brown or black in color.",
    "children": []
  },
  {
    "uuid": "634f1817bcbfb314ddee9dda",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "organic rich sediment",
    "definition": "Sediment with color, composition, texture and apparent density indicating greater than 50 percent organic content by weight on a moisture-free basis.",
    "children": []
  },
  {
    "uuid": "634f1817bcbfb314ddee9ddb",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "organic rich sedimentary material",
    "definition": "Sedimentary material in which 50 percent or more of the primary sedimentary material is organic carbon.",
    "children": []
  },
  {
    "uuid": "634f1817bcbfb314ddee9ddc",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "organic rich sedimentary rock",
    "definition": "Sedimentary rock with color, composition, texture and apparent density indicating greater than 50 percent organic content by weight on a moisture-free basis.",
    "children": []
  },
  {
    "uuid": "634f1817bcbfb314ddee9ddd",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "orthogneiss",
    "definition": "A gneiss with mineralogy and texture indicating derivation from a phaneritic igneous rock protolith. Typically consists of abundant feldspar, with quartz, and variable hornblende, biotite, and muscovite, with a relatively homogeneous character.",
    "children": []
  },
  {
    "uuid": "634f1817bcbfb314ddee9dde",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "packstone",
    "definition": "Carbonate sedimentary rock with discernible grain supported depositional texture, containing greater than 10 percent grains, and constituent particles are of intrabasinal origin; intergranular spaces are filled by matrix.",
    "children": []
  },
  {
    "uuid": "634f1817bcbfb314ddee9ddf",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "paragneiss",
    "definition": "A gneiss with mineralogy and texture indicating derivation from a sedimentary rock protolith. Typically consists of abundant quartz, mica, or calcsilicate minerals; aluminosilicate minerals or garnet commonly present. composition of rock tends to be more variable on a decimetric scale that in orthogneiss.",
    "children": []
  },
  {
    "uuid": "634f1818bcbfb314ddee9de0",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "peat",
    "definition": "Unconsolidated organic-rich sediment composed of at least 50 percent semi-carbonised plant remains; individual remains commonly seen with unaided eye; yellowish brown to brownish black; generally fibrous texture; can be plastic or friable. In its natural state it can be readily cut and has a very high moisture content, generally greater than 90 percent. Liptinite to Inertinite ratio is less than one (Economic commission for Europe, committee on Sustainable Energy- United Nations (ECE-UN), 1998, International Classification of in-Seam Coals: Energy 19, 41 pp.)",
    "children": []
  },
  {
    "uuid": "634f1818bcbfb314ddee9de1",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "pebble gravel size sediment",
    "definition": "Sediment containing greater than 30 percent pebble-size particles (2.0 -64 mm in diameter)",
    "children": []
  },
  {
    "uuid": "634f1818bcbfb314ddee9de2",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "pegmatite",
    "definition": "Exceptionally coarse grained crystalline rock with interlocking crystals; most grains are 1cm or more diameter; composition is generally that of granite, but the term may refer to the coarse grained facies of any type of igneous rock;usually found as irregular dikes, lenses, or veins associated with plutons or batholiths.",
    "children": []
  },
  {
    "uuid": "634f1818bcbfb314ddee9de3",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "peridotite",
    "definition": "Ultramafic rock consisting of more than 40 percent (by volume) olivine with pyroxene and/or amphibole and little or no feldspar. commonly altered to serpentinite. Includes rocks defined modally in the ultramafic rock classification as dunite, harzburgite, lherzolite, wehrlite, olivinite, pyroxene peridotite, pyroxene hornblende peridotite or hornblende peridotite.",
    "children": []
  },
  {
    "uuid": "634f1818bcbfb314ddee9de4",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "phaneritic igneous rock",
    "definition": "Igneous rock in which the framework of the rock consists of individual crystals that can be discerned with the unaided eye. Bounding grain size is on the order of 32 to 100 microns. Igneous rocks with 'exotic' composition are excluded from this concept.",
    "children": []
  },
  {
    "uuid": "634f1818bcbfb314ddee9de5",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "phonolite",
    "definition": "Phonolitoid in which the plagioclase to total feldspar ratio is less than 0.1. Rock consists of alkali feldspar, feldspathoid minerals, and mafic minerals.",
    "children": []
  },
  {
    "uuid": "634f1818bcbfb314ddee9de6",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "phonolitic basanite",
    "definition": "Tephritoid that has a plagioclase to total feldspar ratio between 0.5 and 0.9, and contains more than 10 percent normative (CIPW) olivine.",
    "children": []
  },
  {
    "uuid": "634f1818bcbfb314ddee9de7",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "phonolitic foidite",
    "definition": "Foiditoid that contains less than 90 percent feldspathoid minerals in the QAPF fraction, and has a plagioclase to total feldspar ratio that is less than 0.5",
    "children": []
  },
  {
    "uuid": "634f1818bcbfb314ddee9de8",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "phonolitic tephrite",
    "definition": "Tephritoid that has a plagioclase to total feldspar ratio between 0.5 and 0.9, and contains less than 10 percent normative (CIPW) olivine.",
    "children": []
  },
  {
    "uuid": "634f1818bcbfb314ddee9de9",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "phonolitoid",
    "definition": "Fine grained igneous rock than contains less than 90 percent mafic minerals, between 10 and 60 percent feldspathoid mineral in the QAPF fraction and has a plagioclase to total feldspar ratio less than 0.5. Includes rocks defined modally in QAPF fields 11 and 12, and TAS field Ph.",
    "children": []
  },
  {
    "uuid": "634f1818bcbfb314ddee9dea",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "phosphate rich sediment",
    "definition": "Sediment in which at least 50 percent of the primary and/or recrystallized constituents are phosphate minerals.",
    "children": []
  },
  {
    "uuid": "634f1818bcbfb314ddee9deb",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "phosphate rich sedimentary material",
    "definition": "Sedimentary material in which at least 50 percent of the primary and/or recrystallized constituents are phosphate minerals.",
    "children": []
  },
  {
    "uuid": "634f1818bcbfb314ddee9dec",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "phosphorite",
    "definition": "Sedimentary rock in which at least 50 percent of the primary or recrystallized constituents are phosphate minerals. Most commonly occurs as a bedded primary or reworked secondary marine rock, composed of microcrystalline carbonate fluorapatite in the form of lamina, pellets, oolites and nodules, and skeletal, shell and bone fragments.",
    "children": []
  },
  {
    "uuid": "634f1819bcbfb314ddee9ded",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "phyllite",
    "definition": "Rock with a well developed, continuous schistosity, an average grain size between 0.1 and 0.5 millimeters, and a silvery sheen on cleavage surfaces. Individual phyllosilicate grains are barely visible with the unaided eye.",
    "children": []
  },
  {
    "uuid": "634f1819bcbfb314ddee9dee",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "phyllonite",
    "definition": "Mylonitic rock composed largely of fine-grained mica that imparts a sheen to foliation surfaces; may have flaser lamination, isoclinal folding, and deformed veins, which indicate significant shearing. Macroscopically resembles phyllite, but formed by mechanical degradation of initially coarser rock.",
    "children": []
  },
  {
    "uuid": "634f1819bcbfb314ddee9def",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "porphyry",
    "definition": "Igneous rock that contains conspicuous phenocrysts in a finer grained groundmass; groundmass itself may be phaneritic or fine-grained.",
    "children": []
  },
  {
    "uuid": "634f1819bcbfb314ddee9df0",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "pure calcareous carbonate sediment",
    "definition": "Carbonate sediment in which greater than 90 percent of the constituents are composed of one (or more) of the carbonate minerals in particles of intrabasinal origin, and a calcite (plus aragonite) to dolomite ratio greater than 1 to 1.",
    "children": []
  },
  {
    "uuid": "634f1819bcbfb314ddee9df1",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "pure carbonate mudstone",
    "definition": "Mudstone that consists of greater than 90 percent carbonate minerals of intrabasinal orign in the mud fraction, and contains less than 10 percent allochems. The original depositional texture is preserved and fabric is matrix supported. Carbonate mudstone of Dunham (1962)",
    "children": []
  },
  {
    "uuid": "634f1819bcbfb314ddee9df2",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "pure carbonate sediment",
    "definition": "Carbonate sediment in which greater than 90 percent of the constituents are composed of one (or more) of the carbonate minerals in particles of intrabasinal origin.",
    "children": []
  },
  {
    "uuid": "634f1819bcbfb314ddee9df3",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "pure carbonate sedimentary rock",
    "definition": "Sedimentary rock in which greater than 90 percent of the primary and/or recrystallized constituents are carbonate minerals.",
    "children": []
  },
  {
    "uuid": "634f1819bcbfb314ddee9df4",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "pure dolomitic sediment",
    "definition": "Carbonate sediment in which greater than 90 percent of the constituents are composed of one (or more) of the carbonate minerals in particles of intrabasinal origin, and a ratio of magnesium carbonate to calcite (plus aragonite) greater than 1 to 1.",
    "children": []
  },
  {
    "uuid": "634f1819bcbfb314ddee9df5",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "pyroclastic material",
    "definition": "Fragmental igneous material that consists of more than 75 percent of particles formed by disruption as a direct result of volcanic action.",
    "children": []
  },
  {
    "uuid": "634f1819bcbfb314ddee9df6",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "pyroclastic rock",
    "definition": "Fragmental igneous rock that consists of greater than 75 percent fragments produced as a direct result of eruption or extrusion of magma from within the earth onto its surface. Includes autobreccia associated with lava flows and excludes deposits reworked by epiclastic processes.",
    "children": []
  },
  {
    "uuid": "634f1819bcbfb314ddee9df7",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "pyroxenite",
    "definition": "Ultramafic phaneritic igneous rock composed almost entirely of one or more pyroxenes and occasionally biotite, hornblende and olivine. Includes rocks defined modally in the ultramafic rock classification as olivine pyroxenite, olivine-hornblende pyroxenite, pyroxenite, orthopyroxenite, clinopyroxenite and websterite.",
    "children": []
  },
  {
    "uuid": "634f181abcbfb314ddee9df8",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "quartz alkali feldspar syenite",
    "definition": "Alkali feldspar syenitic rock that contains 5 to 20 percent quartz and no feldspathoid in the QAPF fraction. QAPF field 6*.",
    "children": []
  },
  {
    "uuid": "634f181abcbfb314ddee9df9",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "quartz alkali feldspar trachyte",
    "definition": "Alkali feldspar trachytic rock that contains and between 5 and 20 percent quartz mineral in the QAPF fraction. QAPF field 6*.",
    "children": []
  },
  {
    "uuid": "634f181abcbfb314ddee9dfa",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "quartz anorthosite",
    "definition": "Anorthositic rock that contains between 5 and 20 percent quartz in the QAPF fraction. QAPF field 10*.",
    "children": []
  },
  {
    "uuid": "634f181bbcbfb314ddee9dfb",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "quartz diorite",
    "definition": "Dioritic rock that contains between 5 to 20 percent quartz in the QAPF fraction. QAPF field 10*.",
    "children": []
  },
  {
    "uuid": "634f181bbcbfb314ddee9dfc",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "quartz gabbro",
    "definition": "Gabbroic rock that contains between 5 and 20 percent quartz in the QAPF fraction. QAPF field 10*.",
    "children": []
  },
  {
    "uuid": "634f181bbcbfb314ddee9dfd",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "quartz latite",
    "definition": "Latitic rock that contains between 5 and 20 percent quartz in the QAPF fraction. QAPF field 8*.",
    "children": []
  },
  {
    "uuid": "634f181bbcbfb314ddee9dfe",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "quartz monzodiorite",
    "definition": "Monzodioritic rock that contains between 5 and 20 percent quartz.",
    "children": []
  },
  {
    "uuid": "634f181bbcbfb314ddee9dff",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "quartz monzogabbro",
    "definition": "Monzogabbroic rock that contains between 5 and 20 percent quartz in the QAPF fraction. QAPF field 9*.",
    "children": []
  },
  {
    "uuid": "634f181cbcbfb314ddee9e00",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "quartz monzonite",
    "definition": "Monzonitic rock that contains 5-20 percent quartz iin the QAPF fraction. Includes rocks defined modally in QAPF Field 8*.",
    "children": []
  },
  {
    "uuid": "634f181cbcbfb314ddee9e01",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "quartz rich igneous rock",
    "definition": "Phaneritic crystalline igneous rock that contains less than 90 percent mafic minerals and contains greater than 60 percent quartz in the QAPF fraction.",
    "children": []
  },
  {
    "uuid": "634f181cbcbfb314ddee9e02",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "quartz syenite",
    "definition": "Syenitic rock that contains between 5 and 20 percent quartz in the QAPF fraction. Defined modally in QAPF Field 7*.",
    "children": []
  },
  {
    "uuid": "634f181cbcbfb314ddee9e03",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "quartz trachyte",
    "definition": "Trachytic rock that contains between 5 and 20 percent quartz in the QAPF fraction. QAPF field 7*.",
    "children": []
  },
  {
    "uuid": "634f181cbcbfb314ddee9e04",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "quartzite",
    "definition": "Metamorphic rock consisting of greater than or equal to 75 percent quartz; typically granoblastic texture.",
    "children": []
  },
  {
    "uuid": "634f181cbcbfb314ddee9e05",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "residual material",
    "definition": "Material of composite origin resulting from weathering processes at the Earth's surface, with genesis dominated by removal of chemical constituents by aqueous leaching. Miinor clastic, chemical, or organic input may also contribute. Consolidation state is not inherent in definition, but typically material is unconsolidated or weakly consolidated.",
    "children": []
  },
  {
    "uuid": "634f181cbcbfb314ddee9e06",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "rhyolite",
    "definition": "rhyolitoid in which the ratio of plagioclase to total feldspar is between 0.1 and 0.65.",
    "children": []
  },
  {
    "uuid": "634f181dbcbfb314ddee9e07",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "rhyolitoid",
    "definition": "fine_grained_igneous_rock consisting of quartz and alkali feldspar, with minor plagioclase and biotite, in a microcrystalline, cryptocrystalline or glassy groundmass. Flow texture is common. Includes rocks defined modally in QAPF fields 2 and 3 or chemically in TAS Field R as rhyolite. QAPF normative definition is based on modal mineralogy thus: less than 90 percent mafic minerals, between 20 and 60 percent quartz in the QAPF fraction, and ratio of plagioclse to total feldspar is less than 0.65.",
    "children": []
  },
  {
    "uuid": "634f181dbcbfb314ddee9e08",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "rock",
    "definition": "Consolidated aggregate of one or more EarthMaterials, or a body of undifferentiated mineral matter, or of solid organic material. Includes mineral aggregates such as granite, shale, marble; glassy matter such as obsidian; and organic material such a coal. Excludes unconsolidated materials.",
    "children": []
  },
  {
    "uuid": "634f181dbcbfb314ddee9e0a",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "rock salt",
    "definition": "Evaporite composed of at least 50 percent halite.",
    "children": []
  },
  {
    "uuid": "634f181dbcbfb314ddee9e0b",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "sand",
    "definition": "Clastic sediment in which less than 30 percent of particles are gravel (greater than 2 mm in diameter) and the sand to mud ratio is at least 1. More than half of the particles are of epiclastic origin.",
    "children": []
  },
  {
    "uuid": "634f181dbcbfb314ddee9e0c",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "sand size sediment",
    "definition": "Sediment in which less than 30 percent of particles are gravel (greater than 2 mm in diameter) and the sand to mud ratio is at least 1. composition or genesis of clasts not specified.",
    "children": []
  },
  {
    "uuid": "634f1807bcbfb314ddee9d5f",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "sandstone",
    "definition": "Clastic sedimentary rock in which less than 30 percent of particles are greater than 2 mm in diameter (gravel) and the sand to mud ratio is at least 1.",
    "children": []
  },
  {
    "uuid": "634f181dbcbfb314ddee9e0d",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "sapropel",
    "definition": "Jelly like organic rich sediment composed of plant remains, usually algal. Liptinite to Inertinite ratio is greater than one (Economic commission for Europe, committee on Sustainable Energy- United Nations (ECE-UN), 1998, International Classification of in-Seam Coals: Energy 19, 41 pp.)",
    "children": []
  },
  {
    "uuid": "634f181dbcbfb314ddee9e0e",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "schist",
    "definition": "Foliated phaneritic metamorphic rock with well developed, continuous schistosity, meaning that greater than 50 percent of the rock by volume is mineral grains with a thin tabular, lamellar, or acicular prismatic crystallographic habit that are oriented in a continuous planar or linear fabric.",
    "children": []
  },
  {
    "uuid": "634f181dbcbfb314ddee9e0f",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "sediment",
    "definition": "Unconsolidated material consisting of an aggregation of particles transported or deposited by air, water or ice, or that accumulated by other natural agents, such as chemical precipitation, and that forms in layers on the Earth's surface. Includes epiclastic deposits.",
    "children": []
  },
  {
    "uuid": "634f181dbcbfb314ddee9e10",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "sedimentary material",
    "definition": "Material formed by accumulation of solid fragmental material deposited by air, water or ice, or material that accumulated by other natural agents such as chemical precipitation from solution or secretion by organisms. Includes both sediment and sedimentary rock. Includes epiclastic deposits. All stated composition criteria are based on the mineral/ compound material (GeoSciML term)/particulate fraction of the material, irrespective of porosity or the pore-fluid. No distinctions are made based on porosity or pore fluid composition (except organic rich sediment in which liquid hydrocarbon content may be considered).",
    "children": []
  },
  {
    "uuid": "634f181dbcbfb314ddee9e11",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "sedimentary rock",
    "definition": "Rock formed by accumulation and cementation of solid fragmental material deposited by air, water or ice, or as a result of other natural agents, such as precipitation from solution, the accumulation of organic material, or from biogenic processes, including secretion by organisms. Includes epiclastic deposits.",
    "children": []
  },
  {
    "uuid": "634f181dbcbfb314ddee9e12",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "serpentinite",
    "definition": "Rock consisting of more than 75 percent serpentine-group minerals, eg. antigorite, chrysotile or lizardite; accessory chlorite, talc and magnetite may be present; derived from hydration of ferromagnesian silicate minerals such as olivine and pyroxene.",
    "children": []
  },
  {
    "uuid": "634f181dbcbfb314ddee9e13",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "shale",
    "definition": "Laminated mudstone that will part or break along thin, closely spaced layers parallel to stratification.",
    "children": []
  },
  {
    "uuid": "634f181dbcbfb314ddee9e14",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "silicate mud",
    "definition": "Mud size sediment that consists of less than 50 percent carbonate minerals.",
    "children": []
  },
  {
    "uuid": "634f181ebcbfb314ddee9e15",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "silicate mudstone",
    "definition": "Mudstone that contains less than 10 percent carbonate minerals.",
    "children": []
  },
  {
    "uuid": "634f181ebcbfb314ddee9e16",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "siliceous ooze",
    "definition": "ooze that consists of more than 50 percent siliceous skeletal remains",
    "children": []
  },
  {
    "uuid": "634f181ebcbfb314ddee9e17",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "silt",
    "definition": "Mud that consists of greater than 50 percent silt-size grains.",
    "children": []
  },
  {
    "uuid": "634f181ebcbfb314ddee9e18",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "siltstone",
    "definition": "Mudstone that contains detectable silt. (see comments)",
    "children": []
  },
  {
    "uuid": "634f181ebcbfb314ddee9e19",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "skarn",
    "definition": "Metasomatic rock consisting mainly of Ca-, Mg-, Fe-, or Mn-silicate minerals, which are free from or poor in water. Typically formed at the contact between a silicate rock or magma and a carbonate rock.",
    "children": []
  },
  {
    "uuid": "634f181ebcbfb314ddee9e1a",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "slate",
    "definition": "compact, fine grained rock with an average grain size less than 0.032 millimeter and a well developed schistosity (slaty cleavage), and hence can be split into slabs or thin plates.",
    "children": []
  },
  {
    "uuid": "634f181ebcbfb314ddee9e1b",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "spilite",
    "definition": "Altered basic to intermediate composition fine-grained igneous rock in which the feldspar is partially or completely composed of of albite, typically accompanied by chlorite, calcite, quartz, epidote, prehnite, and low-tempaerature hydrous crystallization products. Preservation of eruptive volcanic features is typical.",
    "children": []
  },
  {
    "uuid": "634f181ebcbfb314ddee9e1c",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "syenite",
    "definition": "Syenitic rock that contains between 0 and 5 percent quartz and no feldspathoid mineral in the QAPF fraction. Defined modally in QAPF Field 7.",
    "children": []
  },
  {
    "uuid": "634f181ebcbfb314ddee9e1d",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "syenitic rock",
    "definition": "Syenitoid with a plagioclase to total feldspar ratio between 0.1 and 0.35. Includes rocks in QAPF fields 7, 7*, and 7'.",
    "children": []
  },
  {
    "uuid": "634f181ebcbfb314ddee9e1e",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "syenitoid",
    "definition": "Phaneritic crystalline igneous rock with M less than 90, consisting mainly of alkali feldspar and plagioclase; minor quartz or nepheline may be present, along with pyroxene, amphibole or biotite. Ratio of plagioclase to total feldspar is less than 0.65, quartz forms less than 20 percent of QAPF fraction, and feldspathoid minerals form less than 10 percent of QAPF fraction. Includes rocks classified in QAPF fields 6, 7 and 8 and their subdivisions.",
    "children": []
  },
  {
    "uuid": "634f181ebcbfb314ddee9e1f",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "syenogranite",
    "definition": "Granite that has a plagiolcase to total feldspar ratio between 0.10 and 0.35. QAPF field 3a.",
    "children": []
  },
  {
    "uuid": "634f181ebcbfb314ddee9e20",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "tephra",
    "definition": "Unconsolidated pyroclastic material in which greater than 75 percent of the fragments are deposited as a direct result of volcanic processes and the deposit has not been reworked by epiclastic processes. Includes ash, lapilli tephra, bomb tephra, block tephra and unconsolidated agglomerate.",
    "children": []
  },
  {
    "uuid": "634f181fbcbfb314ddee9e21",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "tephrite",
    "definition": "Tephritoid that has a plagioclase to total feldspar ratio greater than 0.9, and contains less than 10 percent normative (CIPW) olivine.",
    "children": []
  },
  {
    "uuid": "634f181fbcbfb314ddee9e22",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "tephritic foidite",
    "definition": "Foiditoid that contains less than 90 percent feldspathoid minerals in the QAPF fraction, and has a plagioclase to total feldspar ratio that is greater than 0.5, with less than 10 percent normative olivine",
    "children": []
  },
  {
    "uuid": "634f181fbcbfb314ddee9e23",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "tephritic phonolite",
    "definition": "Phonolitoid that has a plagioclase to total feldspar ratio between 0.1 and 0.5. Broadly corresponds to TAS tephriphonolite of TAS field U3.",
    "children": []
  },
  {
    "uuid": "634f181fbcbfb314ddee9e24",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "tephritoid",
    "definition": "Fine grained igneous rock than contains less than 90 percent mafic minerals, between 10 and 60 percent feldspathoid mineral in the QAPF fraction and has a plagioclase to total feldspar ratio greater than 0.5. Includes rocks classified in QAPF field 13 and 14 or chemically in TAS field U1 as basanite or tephrite.",
    "children": []
  },
  {
    "uuid": "634f181fbcbfb314ddee9e25",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "tholeiitic basalt",
    "definition": "Tholeiitic basalt is defined here to contain 2 pyroxene phases and interstitial quartz or tridymite or cristobalite in the groundmass. Pyroxene (augite and orthopyroxene or pigeonite) and calcium-rich plagioclase are common phenocryst minerals. Olivine may also be a phenocryst, and when present, may have rims of pigeonite. Only in tholeiitic basalt is olivine in reaction relationship with melt. Interstitial siliceous residue may be present, and is often glassy. Tholeiitic basalt is relatively poor in sodium. This category includes most basalts of the ocean floor, most large oceanic islands, and continental flood basalts such as the Columbia River Plateau.",
    "children": []
  },
  {
    "uuid": "634f181fbcbfb314ddee9e26",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "tonalite",
    "definition": "Granitoid consisting of quartz and intermediate plagioclase, usually with biotite and amphibole. Includes rocks defined modally in QAPF field 5; ratio of plagioclase to total feldspar is greater than 0.9.",
    "children": []
  },
  {
    "uuid": "634f181fbcbfb314ddee9e27",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "trachyte",
    "definition": "Trachytoid that has a plagioclase to total feldspar ratio between 0.1 and 0.35, between 0 and 5 percent quartz in the QAPF fraction, and no feldspathoid minerals. QAPF field 7.",
    "children": []
  },
  {
    "uuid": "634f181fbcbfb314ddee9e28",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "trachytic rock",
    "definition": "Trachytoid that has a plagioclase to total feldspar ratio between 0.1 and 0.35. QAPF fields 7, 7', and 7*.",
    "children": []
  },
  {
    "uuid": "634f181fbcbfb314ddee9e29",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "trachytoid",
    "definition": "Fine grained igneous rock than contains less than 90 percent mafic minerals, less than 10 percent feldspathoid mineral and less than 20 percent quartz in the QAPF fraction and has a plagioclase to total feldspar ratio less than 0.65. Mafic minerals typically include amphibole or mica; typically porphyritic. Includes rocks defined modally in QAPF fields 6, 7 and 8 (with subdivisions) or chemically in TAS Field T as trachyte or latite.",
    "children": []
  },
  {
    "uuid": "634f181fbcbfb314ddee9e2a",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "travertine",
    "definition": "Biotically or abiotically precipitated calcium carbonate, from spring-fed, heated, or ambient-temperature water. May be white and spongy, various shades of orange, tan or gray, and ranges to dense, banded or laminated rock. Macrophytes, bryophytes, algae, cyanobacteria and other organisms often colonize the surface of travertine and may be preserved, to produce the porous varieties.",
    "children": []
  },
  {
    "uuid": "634f181fbcbfb314ddee9e2b",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "tuff breccia agglomerate or pyroclastic breccia",
    "definition": "Pyroclastic rock in which greater than 25 percent of particles are greater than 64 mm in largest dimension. Includes agglomerate, pyroclastic breccia of Gillespie and Styles (1999)",
    "children": []
  },
  {
    "uuid": "634f181fbcbfb314ddee9e2c",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "tuffite",
    "definition": "Rock consists of more than 50 percent particles of indeterminate pyroclastic or epiclastic origin and less than 75 percent particles of clearly pyroclastic origin. commonly the rock is laminated or exhibits size grading. (based on LeMaitre et al. 2002; Murawski and Meyer 1998).",
    "children": []
  },
  {
    "uuid": "634f181fbcbfb314ddee9e2d",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "ultrabasic igneous rock",
    "definition": "Igneous rock with less than 45 percent SiO2.",
    "children": []
  },
  {
    "uuid": "634f181fbcbfb314ddee9e2e",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "ultramafic igneous rock",
    "definition": "Igneous rock that consists of greater than 90 percent mafic minerals.",
    "children": []
  },
  {
    "uuid": "634f1820bcbfb314ddee9e2f",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "unconsolidated material",
    "definition": "compoundMaterial composed of an aggregation of particles that do not adhere to each other strongly enough that the aggregate can be considered a solid in its own right.",
    "children": []
  },
  {
    "uuid": "634f1820bcbfb314ddee9e30",
    "parentId": "634f1802bcbfb314ddee9d27",
    "label": "wacke",
    "definition": "Clastic sandstone with more than 10 percent matrix of indeterminate detrital or diagenetic nature. Matrix is mud size silicate minerals (clay, feldspar, quartz, rock fragments, and alteration products).",
    "children": []
  }
]