[
  {
    "uuid": "a9f88ca9-5d19-45fa-8fbb-3c6ff5f1f190",
    "label": "Chronostratigraphic Units",
    "broader": null,
    "definition": "No definition available.",
    "children": [
      {
        "uuid": "0673738a-3751-4d6e-9df0-b2eda0bde993",
        "label": "NOT APPLICABLE",
        "broader": "a9f88ca9-5d19-45fa-8fbb-3c6ff5f1f190",
        "definition": "No definition available.",
        "children": [
          {
            "uuid": "c3103f11-b82a-45fc-82b5-2ac7e353950d",
            "label": "NOT APPLICABLE",
            "broader": "0673738a-3751-4d6e-9df0-b2eda0bde993",
            "definition": "No definition available.",
            "children": [
              {
                "uuid": "bf921c77-6ec0-494f-a9b8-54c01ca6560a",
                "label": "NOT APPLICABLE",
                "broader": "c3103f11-b82a-45fc-82b5-2ac7e353950d",
                "definition": "No definition available.",
                "children": [
                  {
                    "uuid": "9b163dab-3afd-4084-b6c8-380f96a40f75",
                    "label": "NOT APPLICABLE",
                    "broader": "bf921c77-6ec0-494f-a9b8-54c01ca6560a",
                    "definition": "No definition available.",
                    "children": [
                      {
                        "uuid": "13e26688-3e0e-49da-b7cb-0d25d51a9e59",
                        "label": "NOT APPLICABLE",
                        "broader": "9b163dab-3afd-4084-b6c8-380f96a40f75",
                        "definition": "No definition available.",
                        "children": []
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "uuid": "4407ca3c-3dc0-402c-bfc3-4dabd23f283a",
        "label": "PROTEROZOIC",
        "broader": "a9f88ca9-5d19-45fa-8fbb-3c6ff5f1f190",
        "definition": "The Proterozoic is a geological eon spanning from 2,500 million years ago - 541 million years ago. During this time, there was the appearance of oxygen in Earth's atmosphere and the proliferation of complex life (such as trilobites and corals) on the Earth. The Proterozoic is the longest eon of the Earth's geologic time scale and it is subdivided into three geologic eras (from oldest to youngest): the Paleoproterozoic, Mesoproterozoic, and Neoproterozoic.",
        "children": [
          {
            "uuid": "17813394-7d77-4d08-857a-d3b045d49600",
            "label": "MESOPROTEROZOIC",
            "broader": "4407ca3c-3dc0-402c-bfc3-4dabd23f283a",
            "definition": "The Mesoproterozoic Era is a geologic era that occurred from 1,600 to 1,000 million years ago. The Mesoproterozoic was the first period of Earth's history of which a fairly definitive geological record survives. Continents existed during the preceding era, but little is known about them. The continental masses of the Mesoproterozoic were more or less the same ones that exist today.",
            "children": [
              {
                "uuid": "4639c868-7e0e-46df-9c18-e04f9e0f042d",
                "label": "STENIAN",
                "broader": "17813394-7d77-4d08-857a-d3b045d49600",
                "definition": "The Stenian Period is the final geologic period in the Mesoproterozoic Era and lasted from 1200 Mya to 1000 Mya (million years ago). The name derives from narrow polymetamorphic belts formed over this period. The supercontinent Rodinia assembled during the Stenian. It would last into the Tonian period. This period includes the formation of the Keweenawan Rift at about 1100 Mya.",
                "children": []
              },
              {
                "uuid": "71103ecc-f291-48d4-a479-c1781850aee2",
                "label": "CALYMMIAN",
                "broader": "17813394-7d77-4d08-857a-d3b045d49600",
                "definition": "The Calymmian Period is the first geologic period in the Mesoproterozoic Era and lasted from 1600 Mya to 1400 Mya (million years ago). Instead of being based on stratigraphy, these dates are defined chronometrically. The period is characterised by expansion of existing platform covers, or by new platforms on recently cratonized basements. The supercontinent Columbia broke up during the Calymmian some 1500 Mya.",
                "children": []
              },
              {
                "uuid": "ee9ef5b8-884f-4f1d-97bb-463e2f06ac6e",
                "label": "ECTASIAN",
                "broader": "17813394-7d77-4d08-857a-d3b045d49600",
                "definition": "The Ectasian Period is the second geologic period in the Mesoproterozoic Era and lasted from 1400 Mya ago to 1200 Mya (million years ago). Instead of being based on stratigraphy, these dates are defined chronometrically. This period is interesting for the first evidence of sexual reproduction. The 1.2 billion years old Hunting Formation on Somerset Island, Canada, dates from the end of the Ectasian. It contains the microfossils of the multicellular filaments of Bangiomorpha pubescens (type of red algae), the first taxonomically resolved eukaryote. This was the first organism that exhibited sexual reproduction, which is an essential feature for complex multicellularity. Complex multicellularity is different from 'simple' multicellularity, such as colonies of organisms living together. True multicellular organisms contain cells that are specialized for different functions. This is, in fact, an essential feature of sexual reproduction as well, since the male and female gametes are specialized cells. Organisms that reproduce sexually must solve the problem of generating an entire organism from just the germ cells.",
                "children": []
              }
            ]
          },
          {
            "uuid": "a4a66454-acdb-4493-b5db-765653e5b824",
            "label": "PALEOPROTEROZOIC",
            "broader": "4407ca3c-3dc0-402c-bfc3-4dabd23f283a",
            "definition": "The Paleoproterozoic Era, spanning the time period from 2,500 to 1,600 million years ago (2.5–1.6 Ga), is the first of the three sub-divisions (eras) of the Proterozoic Eon. The Paleoproterozoic is also the longest era of the Earth's geological history. It was during this era that the continents first stabilized. Paleontological evidence suggests that the Earth's rotational rate during this era resulted in 20-hour days ~1.8 billion years ago, implying a total of ~450 days per year.",
            "children": [
              {
                "uuid": "0b4a037a-03fb-475e-b1c4-f18bca899b80",
                "label": "SIDERIAN",
                "broader": "a4a66454-acdb-4493-b5db-765653e5b824",
                "definition": "The Siderian Period is the first geologic period in the Paleoproterozoic Era and lasted from 2500 Ma to 2300 Ma (million years ago). The laying down of the banded iron formations (BIFs) peaked early in this period. BIFs were formed as anaerobic cyanobacteria produced waste oxygen that combined with iron, forming magnetite (Fe3O4, an iron oxide). This process removed iron from the Earth's oceans, presumably turning greenish seas clear. Eventually, with no remaining iron in the oceans to serve as an oxygen sink, the process allowed the buildup of an oxygen-rich atmosphere. This second, follow-on event is known as the oxygen catastrophe, which, some geologists believe triggered the Huronian glaciation.",
                "children": []
              },
              {
                "uuid": "10a82168-ba73-426c-9cc5-ecaae260cf39",
                "label": "STATHERIAN",
                "broader": "a4a66454-acdb-4493-b5db-765653e5b824",
                "definition": "The Statherian Period is the final geologic period in the Paleoproterozoic Era and lasted from 1800 Mya to 1600 Mya (million years ago). Instead of being based on stratigraphy, these dates are defined chronometrically. The period was characterized on most continents by either new platforms or final cratonization of fold belts. By the beginning of the Statherian, the supercontinent Columbia had assembled.",
                "children": []
              },
              {
                "uuid": "61627988-014a-4c16-a986-3d90009a4841",
                "label": "OROSIRIAN",
                "broader": "a4a66454-acdb-4493-b5db-765653e5b824",
                "definition": "The Orosirian Period is the third geologic period in the Paleoproterozoic Era and lasted from 2050 Mya to 1800 Mya (million years ago). The later half of the period was an episode of intensive orogeny on virtually all continents. Two of the largest known impact events on Earth occurred during the Orosirian. At the very beginning of the period, 2023 Mya, a large asteroid collision created the Vredefort impact structure. The event that created the Sudbury Basin structure occurred near the end of the period, 1850 Mya.",
                "children": []
              },
              {
                "uuid": "65e898c9-b329-4b1e-b34c-c3b36af720d3",
                "label": "RHYACIAN",
                "broader": "a4a66454-acdb-4493-b5db-765653e5b824",
                "definition": "The Rhyacian Period is the second geologic period in the Paleoproterozoic Era and lasted from 2300 Mya to 2050 Mya (million years ago). The Bushveld Igneous Complex and other similar intrusions formed during this period. The Huronian (Makganyene) global glaciation began at the start of the Rhyacian and lasted 100 million years.",
                "children": []
              }
            ]
          },
          {
            "uuid": "d0ab2b43-d68f-4ab0-8e5a-fd55974c3f29",
            "label": "NEOPROTEROZOIC",
            "broader": "4407ca3c-3dc0-402c-bfc3-4dabd23f283a",
            "definition": "The Neoproterozoic Era is the unit of geologic time from 1,000 to 541 million years ago. It is the last era of the Precambrian Supereon and the Proterozoic Eon; it is subdivided into the Tonian, Cryogenian, and Ediacaran Periods. It is preceded by the Mesoproterozoic era and succeeded by the Paleozoic era of the Phanerozoic eon. The most severe glaciation known in the geologic record occurred during the Cryogenian, when ice sheets may have reached the equator and formed a 'Snowball Earth'. The earliest fossils of complex multicellular life are found in the Ediacaran period. These organisms make up the Ediacaran biota, including the oldest definitive animals in the fossil record. The sum of the continental crust formed in the Pan-African orogeny and the Grenville orogeny makes the Neoproterozoic the period of Earth's history that has produced most continental crust.",
            "children": [
              {
                "uuid": "8081c24d-2a51-4f26-825c-8406b5bbf1f0",
                "label": "EDIACARAN",
                "broader": "d0ab2b43-d68f-4ab0-8e5a-fd55974c3f29",
                "definition": "The Ediacaran Period spans 94 million years from the end of the Cryogenian Period 635 million years ago (Mya), to the beginning of the Cambrian Period 541 Mya. It marks the end of the Proterozoic Eon, and the beginning of the Phanerozoic Eon. It is named after the Ediacara Hills of South Australia.",
                "children": []
              },
              {
                "uuid": "cc40a250-0fea-4668-9bc5-33ba16ccb2a6",
                "label": "TONIAN",
                "broader": "d0ab2b43-d68f-4ab0-8e5a-fd55974c3f29",
                "definition": "The Tonian is the first geologic period of the Neoproterozoic Era. It lasted from 1000 Mya to 720 Mya (million years ago). Instead of being based on stratigraphy, these dates are defined by the ICS based on radiometric chronometry. The Tonian is preceded by the Stenian Period of the Mesoproterozoic era and followed by the Cryogenian.Rifting leading to the breakup of supercontinent Rodinia, which had formed in the mid-Stenian, occurred during this period, starting from 900 to 850 Mya.",
                "children": []
              },
              {
                "uuid": "e26ff122-9c3a-4184-b580-bf74c5f1ba85",
                "label": "CRYOGENIAN",
                "broader": "d0ab2b43-d68f-4ab0-8e5a-fd55974c3f29",
                "definition": "The Cryogenian is a geologic period that lasted from 720 to 635 million years ago. It forms the second geologic period of the Neoproterozoic Era, preceded by the Tonian Period and followed by the Ediacaran. The Sturtian and Marinoan glaciations occurred during the Cryogenian period, which are the greatest ice ages known to have occurred on Earth. These events are the subject of much scientific controversy. The main debate contests whether these glaciations covered the entire planet (the so-called 'Snowball Earth') or a band of open sea survived near the equator (termed 'slushball Earth').",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "uuid": "7160e90a-d7c4-4817-9b1c-e82211688bdb",
        "label": "ARCHAEAN",
        "broader": "a9f88ca9-5d19-45fa-8fbb-3c6ff5f1f190",
        "definition": "The Archean Eon is one of the four geologic eons of Earth history, occurring 4,000 to 2,500 million years ago (4 to 2.5 billion years ago). During the Archean, the Earth's crust had cooled enough to allow the formation of continents and life started to form.",
        "children": [
          {
            "uuid": "27660bb3-982e-414c-991a-707abd861f46",
            "label": "MESOARCHEAN",
            "broader": "7160e90a-d7c4-4817-9b1c-e82211688bdb",
            "definition": "The Mesoarchean is a geologic era within the Archean Eon, spanning 3,200 to 2,800 million years ago. The era is defined chronometrically and is not referenced to a specific level in a rock section on Earth. Fossils from Australia show that stromatolites have grown on Earth since the Mesoarchean.",
            "children": []
          },
          {
            "uuid": "2cd7912b-8cf2-41a1-99b9-8797dcd94fa7",
            "label": "PALEOARCHEAN",
            "broader": "7160e90a-d7c4-4817-9b1c-e82211688bdb",
            "definition": "The Paleoarchean is a geologic era within the Archaean Eon. It spans the period of time 3,600 to 3,200 million years ago. The era is defined chronometrically and is not referenced to a specific level of a rock section on Earth. During this era, a large asteroid, about 37 to 58 kilometres (23–36 mi) wide, collided with the Earth in the area of South Africa about 3.26 billion years ago, creating the features known as the Barberton greenstone belt.",
            "children": []
          },
          {
            "uuid": "8dff752e-939d-4b16-a735-bb4af8dbd785",
            "label": "EOARCHEAN",
            "broader": "7160e90a-d7c4-4817-9b1c-e82211688bdb",
            "definition": "The Eoarchean is the first era of the Archean Eon of the geologic record for which the Earth has a solid crust. It spans 400 million years from the end of the Hadean Eon 4 billion years ago (4000 Mya) to the start of the Paleoarchean Era 3600 Mya. The beginnings of life on Earth have been dated to this era and evidence of cyanobacteria date to 3500 Mya, just outside this era. At that time, the atmosphere was without oxygen and the pressure values ranged from 10 to 100 bar (around 10 to 100 atmospheres).",
            "children": []
          },
          {
            "uuid": "d2d0ac71-d27d-46cb-b95b-39a6f796c501",
            "label": "NEOARCHEAN",
            "broader": "7160e90a-d7c4-4817-9b1c-e82211688bdb",
            "definition": "The Neoarchean spans the period from 2,800 to 2,500 million years ago. During this era, oxygenic photosynthesis first evolved, releasing an abundance of oxygen, that first reacted with minerals and afterward was free to react with greenhouse gases of the atmosphere, leaving the Earth's surface free to radiate its energy to space. This is known as the oxygen catastrophe which was to happen later in the Paleoproterozoic from a poisonous buildup of oxygen in the atmosphere, released by these oxygen producing photoautotrophs, which evolved earlier in the Neoarchean.",
            "children": []
          }
        ]
      },
      {
        "uuid": "af145656-986a-4969-bb77-6e5b2cff1ede",
        "label": "PHANEROZOIC",
        "broader": "a9f88ca9-5d19-45fa-8fbb-3c6ff5f1f190",
        "definition": "The Phanerozoic Eon is the current geologic eon in the geologic time scale, and the one during which abundant animal and plant life has existed. It covers 541 million years to the present, and began with the Cambrian Period when animals first developed hard shells preserved in the fossil record.",
        "children": [
          {
            "uuid": "0e098a6e-2123-4566-9069-6a3401775ca3",
            "label": "PALEOZOIC",
            "broader": "af145656-986a-4969-bb77-6e5b2cff1ede",
            "definition": "The Paleozoic Era, which ran from about 542 million years ago to 251 million years ago, was a time of great change on Earth. The era began with the breakup of one super-continent and the formation of another. Plants became widespread. And the first vertebrate animals colonized land.",
            "children": [
              {
                "uuid": "02f8be65-6bdd-4f4d-9e69-adac5aec33f6",
                "label": "ORDOVICIAN",
                "broader": "0e098a6e-2123-4566-9069-6a3401775ca3",
                "definition": "The Ordovician Period lasted almost 45 million years, beginning 488.3 million years ago and ending 443.7 million years ago. During this period, the area north of the tropics was almost entirely ocean, and most of the world's land was collected into the southern supercontinent Gondwana. Throughout the Ordovician, Gondwana shifted towards the South Pole and much of it was submerged underwater. The Ordovician is best known for its diverse marine invertebrates, including graptolites, trilobites, brachiopods, and the conodonts (early vertebrates). A typical marine community consisted of these animals, plus red and green algae, primitive fish, cephalopods, corals, crinoids, and gastropods. More recently, tetrahedral spores that are similar to those of primitive land plants have been found, suggesting that plants invaded the land at this time. From the Lower to Middle Ordovician, the Earth experienced a milder climate — the weather was warm and the atmosphere contained a lot of moisture. However, when Gondwana finally settled on the South Pole during the Upper Ordovician, massive glaciers formed, causing shallow seas to drain and sea levels to drop. This likely caused the mass extinctions that characterize the end of the Ordovician in which 60% of all marine invertebrate genera and 25% of all families went extinct.",
                "children": [
                  {
                    "uuid": "00c6f0f3-5734-4500-a69e-f6780e365985",
                    "label": "EARLY",
                    "broader": "02f8be65-6bdd-4f4d-9e69-adac5aec33f6",
                    "definition": "No definition available.",
                    "children": [
                      {
                        "uuid": "a58844b9-65e5-4b5a-98ab-b99968769d4a",
                        "label": "FLOIAN",
                        "broader": "00c6f0f3-5734-4500-a69e-f6780e365985",
                        "definition": "The Floian is the second stage of the Ordovician geologic period. It succeeds the Tremadocian with which it forms the Lower Ordovician epoch. It precedes the Dapingian stage of the Middle Ordovician. The Floian extended from 477.7 to 470 million years ago.",
                        "children": []
                      },
                      {
                        "uuid": "cb8eee5d-fd20-4465-a917-051562f5fcd1",
                        "label": "TREMADOCIAN",
                        "broader": "00c6f0f3-5734-4500-a69e-f6780e365985",
                        "definition": "The Tremadocian is the lowest stage of Ordovician. Together with the later Floian stage it forms the Lower Ordovician epoch. The Tremadocian lasted from 485.4 to 477.7 million years ago.",
                        "children": []
                      }
                    ]
                  },
                  {
                    "uuid": "479caf3a-2744-4cef-b992-745c1ffd3e96",
                    "label": "LATE",
                    "broader": "02f8be65-6bdd-4f4d-9e69-adac5aec33f6",
                    "definition": "No definition available.",
                    "children": [
                      {
                        "uuid": "00b13a7e-4d16-4d89-bc47-2839331545e6",
                        "label": "HIRNANTIAN",
                        "broader": "479caf3a-2744-4cef-b992-745c1ffd3e96",
                        "definition": "The Hirnantian is the seventh and final internationally recognized stage of the Ordovician Period of the Paleozoic Era. It was of short duration, lasting about 1.4 million years, from 445.2 to 443.8 Ma (million years ago). The early part of the Hirnantian was characterized by cold temperatures, major glaciation, and a severe drop in sea level. In the latter part of the Hirnantian, temperatures rose, the glaciers melted, and sea level returned to the same or to a slightly higher level than it had been prior to the glaciation. Most scientists believe that this climatic oscillation caused the major extinction event that took place during this time. In fact, the Hirnantian (also known as the End Ordovician and the Ordovician-Silurian) mass extinction event represents the second largest such event in geologic history. Approximately 85% of marine (sea-dwelling) species died. Only the End Permian mass extinction was larger. Unlike many smaller extinction events, however, the long-term consequences of the End Ordovician event were relatively small. Following the climatic oscillation, the climate returned to its previous state, and the species that survived soon (within two or three million years) evolved into species very similar to the ones that existed before.",
                        "children": []
                      },
                      {
                        "uuid": "08eaa5b8-60b3-4872-a0ad-d3dc4bb00d83",
                        "label": "SANDBIAN",
                        "broader": "479caf3a-2744-4cef-b992-745c1ffd3e96",
                        "definition": "The Sandbian is the first stage of the Upper Ordovician. It follows the Darriwilian and is succeeded by the Katian. Its lower boundary is defined as the first appearance datum of the graptolite species Nemagraptus gracilis around 458.4 million years ago. The Sandbian lasted for about 5.4 million years until the beginning of the Katian around 453 million years ago.",
                        "children": []
                      },
                      {
                        "uuid": "cda85cc0-7711-471d-ab14-c034ce53f24b",
                        "label": "KATIAN",
                        "broader": "479caf3a-2744-4cef-b992-745c1ffd3e96",
                        "definition": "The Katian is the second stage of the Upper Ordovician. It is preceded by the Sandbian and succeeded by the Hirnantian stage. The Katian began 453 million years ago and lasted for about 7.8 million years until the beginning of the Hirnantian 445.2 million years ago.",
                        "children": []
                      }
                    ]
                  },
                  {
                    "uuid": "e941d527-8935-4b63-b76f-5febd609b9b5",
                    "label": "MIDDLE",
                    "broader": "02f8be65-6bdd-4f4d-9e69-adac5aec33f6",
                    "definition": "No definition available.",
                    "children": [
                      {
                        "uuid": "51b449af-bc34-4bee-9f61-61ba9721717d",
                        "label": "DARRIWILIAN",
                        "broader": "e941d527-8935-4b63-b76f-5febd609b9b5",
                        "definition": "The Darriwilian is the upper stage of the Middle Ordovician. It is preceded by the Dapingian and succeeded by the Upper Ordovician Sandbian stage. The lower boundary of the Darriwilian is defined as the first appearance of the graptolite species Undulograptus austrodentatus around 467.3 million years ago. It lasted for about 8.9 million years until the beginning of the Sandbian around 458.4 million years ago.",
                        "children": []
                      },
                      {
                        "uuid": "d8843625-1941-4c7e-85f3-86e0b552518f",
                        "label": "DAPINGIAN",
                        "broader": "e941d527-8935-4b63-b76f-5febd609b9b5",
                        "definition": "The Dapingian is the third stage of the Ordovician and the first stage of the Middle Ordovician. It is preceded by the Floian and succeeded by the Darriwilian. The top of the Floian is defined as the first appearance of the conodont species Baltoniodus triangularis which happened about 470 million years ago.",
                        "children": []
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "167bba30-03d3-4898-8c53-6e50828d1749",
                "label": "CAMBRIAN",
                "broader": "0e098a6e-2123-4566-9069-6a3401775ca3",
                "definition": "The Cambrian Period was the first geological period of the Paleozoic Era, and of the Phanerozoic Eon. The Cambrian lasted 55.6 million years from the end of the preceding Ediacaran Period 541 million years ago (mya) to the beginning of the Ordovician Period 485.4 mya. The Cambrian is unique in its unusually high proportion of lagerstätte sedimentary deposits, sites of exceptional preservation where 'soft' parts of organisms are preserved as well as their more resistant shells. As a result, our understanding of the Cambrian biology surpasses that of some later periods. The Cambrian marked a profound change in life on Earth; prior to the Cambrian, the majority of living organisms on the whole were small, unicellular and simple; the Precambrian Charnia being exceptional. Complex, multicellular organisms gradually became more common in the millions of years immediately preceding the Cambrian, but it was not until this period that mineralized—hence readily fossilized—organisms became common. The rapid diversification of life forms in the Cambrian, known as the Cambrian explosion, produced the first representatives of all modern animal phyla. Phylogenetic analysis has supported the view that during the Cambrian radiation, metazoa (animals) evolved monophyletically from a single common ancestor: flagellated colonial protists similar to modern choanoflagellates. Although diverse life forms prospered in the oceans, the land is thought to have been comparatively barren—with nothing more complex than a microbial soil crust and a few molluscs that emerged to browse on the microbial biofilm. Most of the continents were probably dry and rocky due to a lack of vegetation. Shallow seas flanked the margins of several continents created during the breakup of the supercontinent Pannotia. The seas were relatively warm, and polar ice was absent for much of the period.",
                "children": [
                  {
                    "uuid": "411f36cf-8c87-474c-bfaf-614723a4b938",
                    "label": "TERRENEUVIAN",
                    "broader": "167bba30-03d3-4898-8c53-6e50828d1749",
                    "definition": "The Terreneuvian is the lowermost and oldest series of the Cambrian geological system. Its base is defined by the first appearance datum of the trace fossil Treptichnus pedum around 541 million years ago. Its top is defined as the first appearance of trilobites in the stratigraphic record around 521 million years ago.",
                    "children": [
                      {
                        "uuid": "81cc3a0f-1084-42b4-9e40-637aad46aff4",
                        "label": "STAGE 2",
                        "broader": "411f36cf-8c87-474c-bfaf-614723a4b938",
                        "definition": "Stage 2 of the Cambrian is the unnamed upper stage of the Terreneuvian series. It lies atop the Fortunian and below Stage 3 of the Cambrian. It is commonly referred to as the Tommotian, after the Cambrian stratigraphy of Siberia. Neither the upper nor lower boundary has yet been defined by the International Commission on Stratigraphy.",
                        "children": []
                      },
                      {
                        "uuid": "c0fcada2-4e5b-4349-9611-5879f541d4e4",
                        "label": "FORTUNIAN",
                        "broader": "411f36cf-8c87-474c-bfaf-614723a4b938",
                        "definition": "The Fortunian stage marks the beginning of the Phanerozoic eon, the Paleozoic era, and the Cambrian period. It is the first of the two stages of the Terreneuvian series. It's base is defined as the first appearance of the trace fossil Treptichnus pedum 541 million years ago. The top of the Fortunian which is the base of the Stage 2 of the Cambrian has not been formally defined yet, but will correspond to the appearance of an Archeocyatha species or 'Small shelly fossils' approximately 529 million years ago.",
                        "children": []
                      }
                    ]
                  },
                  {
                    "uuid": "c98a4c91-1b1d-464d-8380-497a186db7eb",
                    "label": "SERIES 2",
                    "broader": "167bba30-03d3-4898-8c53-6e50828d1749",
                    "definition": "Cambrian Series 2 is the unnamed 2nd series of the Cambrian. It lies above the Terreneuvian series and below the Miaolingian. Series 2 has not been formally defined by the International Commission on Stratigraphy, lacking a precise lower boundary and subdivision into stages. The proposed lower boundary is the first appearance of trilobites which is estimated to be around 521 million years ago.",
                    "children": [
                      {
                        "uuid": "16e234b5-5ecb-4e03-b4ec-7a5e03db8017",
                        "label": "STAGE 3",
                        "broader": "c98a4c91-1b1d-464d-8380-497a186db7eb",
                        "definition": "Cambrian Stage 3 is the still unnamed third stage of the Cambrian. It succeeds Cambrian Stage 2 and precedes Cambrian Stage 4, although neither its base nor top have been formally defined. The plan is for its lower boundary to correspond approximately to the first appearance of trilobites, about 521 million years ago, though the globally asynchronous appearance of trilobites warrants the use of a separate, globally synchronous marker to define the base. The upper boundary and beginning of Cambrian Stage 4 is informally defined as the first appearance of the trilobite genera Olenellus or Redlichia around 514 million years ago.",
                        "children": []
                      },
                      {
                        "uuid": "81103299-c23d-4a11-9a04-c1041fea5d1b",
                        "label": "STAGE 4",
                        "broader": "c98a4c91-1b1d-464d-8380-497a186db7eb",
                        "definition": "Cambrian Stage 4 is the still unnamed fourth stage of the Cambrian and the upper stage of Cambrian Series 2. It follows Cambrian Stage 3 and lies below the Wuliuan. The lower boundary has not been formally defined by the International Commission on Stratigraphy. One proposal is the first appearance of two trilobite genera, Olenellus or Redlichia. Another proposal is the first appearance of the trilobite species Arthricocephalus chauveaui. Both proposals will set the lower boundary close to 514 million years ago. The upper boundary corresponds to the beginning of the Wuliuan.",
                        "children": []
                      }
                    ]
                  },
                  {
                    "uuid": "d5a694f5-630e-4164-8789-aaa164a5e34a",
                    "label": "FURONGIAN",
                    "broader": "167bba30-03d3-4898-8c53-6e50828d1749",
                    "definition": "The Furongian is the fourth and final series of the Cambrian. It lasted from 497 to 485.4 million years ago. It succeeds the Miaolingian series of the Cambrian and precedes the Lower Ordovician Tremadocian stage. It is subdivided into three stages: the Paibian, Jiangshanian and the unnamed 10th stage of the Cambrian.",
                    "children": [
                      {
                        "uuid": "1349b331-a168-48fc-a548-5c0c962271cf",
                        "label": "JIANGSHANIAN",
                        "broader": "d5a694f5-630e-4164-8789-aaa164a5e34a",
                        "definition": "The Jiangshanian is the middle stage of the Furongian series. It follows the Paibian stage and is succeeded by the still unnamed Stage 10 of the Cambrian. The base is defined as the first appearance of the trilobite Agnostotes orientalis which is estimated to be 494 million years ago. The Jiangshanian lasted until approximately 489.5 million years ago.",
                        "children": []
                      },
                      {
                        "uuid": "a00ebef2-3976-401b-a9fe-6bbcfe536737",
                        "label": "PAIBIAN",
                        "broader": "d5a694f5-630e-4164-8789-aaa164a5e34a",
                        "definition": "The Paibian is the lowest stage of Furongian series of the Cambrian. It follows the Guzhangian (3rd series of the Cambrian) and is succeeded by the Jiangshanian stage. The base is defined as the first appearance of the trilobite Glyptagnostus reticulatus around 497 million years ago. The top, or the base of the Jiangshanian is defined as the first appearance of the trilobite Agnostotes orientalis around 494 million years ago.",
                        "children": []
                      },
                      {
                        "uuid": "d1d5b9db-42c5-4dea-a9c6-c0074eb3f3e8",
                        "label": "STAGE 10",
                        "broader": "d5a694f5-630e-4164-8789-aaa164a5e34a",
                        "definition": "Stage 10 of the Cambrian is the still unnamed third and final stage of the Furongian series. It follows the Jiangshanian and precedes the Ordovician Tremadocian stage. The proposed lower boundary is the first appearance of the trilobite Lotagnostus americanus around 489.5 million years ago, but other fossils are also being discussed (see below). The upper boundary is defined as the appearance of the conodont Iapetognathus fluctivagus which marks the beginning of the Tremadocian and is radiometrically dated as 485.4 million years ago.",
                        "children": []
                      }
                    ]
                  },
                  {
                    "uuid": "ea5250b7-79a4-4f27-a5c5-9ebd41ab627b",
                    "label": "MIAOLINGIAN",
                    "broader": "167bba30-03d3-4898-8c53-6e50828d1749",
                    "definition": "The Miaolingian is the third Series of the Cambrian period. It lasted from about 509 to 497 million years ago and is divided into 3 stages: the Wuliuan, the Drumian, and the Guzhangian. The Miaolingian is preceded by the unnamed Cambrian Series 2 and succeeded by the Furongian series.",
                    "children": [
                      {
                        "uuid": "5172e1c2-f89f-4155-aca3-ff51eba0a976",
                        "label": "GUZHANGIAN",
                        "broader": "ea5250b7-79a4-4f27-a5c5-9ebd41ab627b",
                        "definition": "The Guzhangian is an uppermost stage of the Miaolingian Series of the Cambrian. It follows the Drumian Stage and precedes the Paibian Stage of the Furongian Series. The base is defined as the first appearance of the trilobite Lejopyge laevigata around 500.5 million years ago. The Guzhangian-Paibian boundary is marked by the first appearance of the trilobite Glyptagnostus reticulatus around 497 million years ago.",
                        "children": []
                      },
                      {
                        "uuid": "639cf686-6c06-42a9-8ed1-79fe81c690fa",
                        "label": "WULIUAN",
                        "broader": "ea5250b7-79a4-4f27-a5c5-9ebd41ab627b",
                        "definition": "The Wuliuan stage is the fifth stage of the Cambrian, and the first stage of the Miaolingian Series of the Cambrian. Its base is defined by the first appearance of the trilobite species Oryctocephalus indicus; it ends with the beginning of the Drumian stage, marked by the first appearance of the trilobite Ptychagnostus atavus around 504.5 million years ago.",
                        "children": []
                      },
                      {
                        "uuid": "dddaa5c1-3f72-44aa-9147-9b171782956b",
                        "label": "DRUMIAN",
                        "broader": "ea5250b7-79a4-4f27-a5c5-9ebd41ab627b",
                        "definition": "The Drumian is a stage of the Miaolingian Series of the Cambrian. It succeeds the Wuliuan and precedes the Guzhangian. The base is defined as the first appearance of the trilobite Ptychagnostus atavus around 504.5 million years ago. The top is defined as the first appearance of another trilobite Lejopyge laevigata around 500.5 million years ago.",
                        "children": []
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "3be2d037-28aa-40c7-8877-530fbcaa2c03",
                "label": "SILURIAN",
                "broader": "0e098a6e-2123-4566-9069-6a3401775ca3",
                "definition": "The Silurian is a geologic period and system spanning 24.6 million years from the end of the Ordovician Period, at 443.8 million years ago (Mya), to the beginning of the Devonian Period, 419.2 Mya. The Silurian is the shortest period of the Paleozoic Era. As with other geologic periods, the rock beds that define the period's start and end are well identified, but the exact dates are uncertain by several million years. The base of the Silurian is set at a series of major Ordovician–Silurian extinction events when up to 60% of marine genera were wiped out. A significant evolutionary milestone during the Silurian was the diversification of jawed fish and bony fish. Multi-cellular life also began to appear on land in the form of small, bryophyte-like and vascular plants that grew beside lakes, streams, and coastlines, and terrestrial arthropods are also first found on land during the Silurian. However, terrestrial life would not greatly diversify and affect the landscape until the Devonian.",
                "children": [
                  {
                    "uuid": "15256b96-f71f-43d2-8c1b-ab5dca5dd3db",
                    "label": "LUDLOW",
                    "broader": "3be2d037-28aa-40c7-8877-530fbcaa2c03",
                    "definition": "The Ludlow epoch (from 427.4 ± 0.5 million years ago to 423.0 ± 2.3 million years ago) occurred during the Silurian period, after the end of the Homerian age.",
                    "children": [
                      {
                        "uuid": "a5bf9cd1-657c-4669-8794-2ca79d769677",
                        "label": "GORSTIAN",
                        "broader": "15256b96-f71f-43d2-8c1b-ab5dca5dd3db",
                        "definition": "The Gorstian is the age of the Ludlow epoch of the Silurian period of the Paleozoic era of the Phanerozoic eon that is comprehended between 427.4 ± 0.5 Ma and 425.6 ± 0.9 Ma (million years ago), approximately. The Gorstian age succeeds the Homerian age and precedes the Ludfordian age.",
                        "children": []
                      },
                      {
                        "uuid": "da923214-120f-4ee4-8f62-9fde989e3c75",
                        "label": "LUDFORDIAN",
                        "broader": "15256b96-f71f-43d2-8c1b-ab5dca5dd3db",
                        "definition": "The Ludfordian is the age of the Ludlow epoch of the Silurian period of the Paleozoic era of the Phanerozoic eon that occurred between 425.6 ± 0.9Ma and 423. ± 2.3 Ma (million years ago). The Ludfordian age succeeds the Gorstian age and precedes the Pridoli epoch. The Lau event is a rapid pulse of cooling during the Ludfordian, about 420 million years ago; it is identified by a pulse of extinctions and oceanic changes. It is one of the series of fast sea-level and excursions in oxygen isotope ratios that signal fast switches between warm and cold climate states, characteristic of the Silurian climatic instability. The Lau Event occurred during an extended period of elevated seawater saturation state, explained by reservoirs of the planet's fresh water being locked up in massive polar ice caps. The sudden reappearance in normally saline marine environments of stromatolites and a mass occurrence of oncoids during the event suggested that minor extinction events like the Lau Event also resulted in periods of reduced grazing pressures on surviving 'disaster biota', which can be compared to the aftermath of the more catastrophic end-Ordovician and end-Permian mass extinctions.",
                        "children": []
                      }
                    ]
                  },
                  {
                    "uuid": "38271019-de23-4b2e-85ed-15af2f3a11bc",
                    "label": "PRIDOLI",
                    "broader": "3be2d037-28aa-40c7-8877-530fbcaa2c03",
                    "definition": "The Pridoli epoch of the Silurian period of the Paleozoic era of the Phanerozoic eon is comprehended between 423 ± 2.3 and 419.2 ± 3.2 mya (million years ago), approximately. The Pridoli epoch succeeds the Ludfordian age and precedes the Lochkovian age of the Devonian.",
                    "children": []
                  },
                  {
                    "uuid": "cda42e0a-bac4-4ca6-b20d-c09b45e8717b",
                    "label": "WENLOCK",
                    "broader": "3be2d037-28aa-40c7-8877-530fbcaa2c03",
                    "definition": "The Wenlock is the second series of the Silurian. It is preceded by the Llandovery epoch and followed by the Ludlow Group. Radiometric dates constrain the Wenlockian between 433.4 and 427.4 million years ago.",
                    "children": [
                      {
                        "uuid": "a4ceb190-02b5-4eeb-b9c8-0d1445006f8e",
                        "label": "SHEINWOODIAN",
                        "broader": "cda42e0a-bac4-4ca6-b20d-c09b45e8717b",
                        "definition": "The Sheinwoodian is the age of the Wenlock epoch of the Silurian period of the Paleozoic era of the Phanerozoic eon that is comprehended between 433.4 ± 0.8 Ma and 430.5 ± 0.7 Ma (million years ago), approximately. The Sheinwoodian age succeeds the Telychian age and precedes the Homerian age.",
                        "children": []
                      },
                      {
                        "uuid": "a67468bf-980b-4053-a26c-64fc5d9aa611",
                        "label": "HOMERIAN",
                        "broader": "cda42e0a-bac4-4ca6-b20d-c09b45e8717b",
                        "definition": "The Homerian is the age of the Wenlock epoch of the Silurian period of the Paleozoic era of the Phanerozoic eon that is comprehended between 430.5 ± 0.7 Ma and 427.4 ± 0.5 Ma (million years ago), approximately. The Homerian age succeeds the Sheinwoodian age and precedes the Gorstian age.",
                        "children": []
                      }
                    ]
                  },
                  {
                    "uuid": "ec205df2-0e6a-4ffe-a7f6-8f20592345f7",
                    "label": "LLANDOVERY",
                    "broader": "3be2d037-28aa-40c7-8877-530fbcaa2c03",
                    "definition": "The Llandovery epoch (from 443.8 ± 1.5 million years ago to 433.4 ± 0.8 million years ago) occurred at the beginning of the Silurian period. The Llandoverian epoch follows the massive Ordovician-Silurian extinction events, which led to a large decrease in biodiversity and an opening up of ecosystems. Widespread reef building started in this period and continued into the Devonian period when rising water temperatures are thought to have bleached out the coral by killing their photo symbionts. The Llandoverian epoch ended with the Ireviken event which killed off 50% of trilobite species, and 80% of the global conodont species.",
                    "children": [
                      {
                        "uuid": "3f87a2a4-2e77-4955-83a4-f3ecad41ec1c",
                        "label": "AERONIAN",
                        "broader": "ec205df2-0e6a-4ffe-a7f6-8f20592345f7",
                        "definition": "The Aeronian is the age of the Llandovery epoch of the Silurian period of the Paleozoic era of the Phanerozoic eon that began 440.8 ± 1.2 Ma and ended 438.5 ± 1.1 Ma (million years ago). The Aeronian age succeeds the Rhuddanian age and precedes the Telychian age, all in the same epoch.",
                        "children": []
                      },
                      {
                        "uuid": "4b67850f-0a8a-4e35-b6db-ea37d8cbfbea",
                        "label": "RHUDDANIAN",
                        "broader": "ec205df2-0e6a-4ffe-a7f6-8f20592345f7",
                        "definition": "The Rhuddanian is the first age of the Silurian period and of the Llandovery epoch. The Silurian is in the Paleozoic era of the Phanerozoic eon. The Rhuddanian age began 443.8 ± 1.5 Ma and ended 440.8 ± 1.2 Ma (million years ago). It succeeds the Himantian Age (the last age of the Ordovician Period) and precedes the Aeronian age.",
                        "children": []
                      },
                      {
                        "uuid": "608cfddd-ac10-4617-815c-1171a00ab54a",
                        "label": "TELYCHIAN",
                        "broader": "ec205df2-0e6a-4ffe-a7f6-8f20592345f7",
                        "definition": "The Telychian is the age of the Llandovery epoch of the Silurian period of the Paleozoic era of the Phanerozoic eon that is comprehended between 438.5 ± 1.2 Ma and 433.4 ± 0.8 Ma (million years ago), approximately. The Telychian age succeeds the Aeronian age and precedes the Sheinwoodian age.",
                        "children": []
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "50437b21-5bf8-4e7e-abe0-007b56c09cca",
                "label": "PERMIAN",
                "broader": "0e098a6e-2123-4566-9069-6a3401775ca3",
                "definition": "The Permian is a geologic period and system which spans 47 million years from the end of the Carboniferous period 298.9 million years ago (Mya), to the beginning of the Triassic period 251.902 Mya. It is the last period of the Paleozoic era; the following Triassic period belongs to the Mesozoic era. The Permian witnessed the diversification of the early amniotes into the ancestral groups of the mammals, turtles, lepidosaurs, and archosaurs. The world at the time was dominated by two continents known as Pangaea and Siberia, surrounded by a global ocean called Panthalassa. The Carboniferous rainforest collapse left behind vast regions of desert within the continental interior. Amniotes, which could better cope with these drier conditions, rose to dominance in place of their amphibian ancestors.",
                "children": [
                  {
                    "uuid": "219be745-055a-4b37-883a-a0fece613e4f",
                    "label": "LOPINGIAN",
                    "broader": "50437b21-5bf8-4e7e-abe0-007b56c09cca",
                    "definition": "The Lopingian is the uppermost series/last epoch of the Permian. It is the last epoch of the Paleozoic. The Lopingian was preceded by the Guadalupian and followed by the Early Triassic. The Lopingian is often synonymous with the informal terms late Permian or upper Permian.",
                    "children": [
                      {
                        "uuid": "4d1a1c38-1c05-4bae-8810-aa1bb03ed1d2",
                        "label": "WUCHIAPINGIAN",
                        "broader": "219be745-055a-4b37-883a-a0fece613e4f",
                        "definition": "The Wuchiapingian or Wujiapingian is an age or stage of the Permian. It is also the lower or earlier of two subdivisions of the Lopingian epoch or series. The Wuchiapingian spans the time between 259.1 and 254.14 million years ago (Ma).",
                        "children": []
                      },
                      {
                        "uuid": "677882a4-d01c-4858-b889-575f405dccb9",
                        "label": "CHANGHSINGIAN",
                        "broader": "219be745-055a-4b37-883a-a0fece613e4f",
                        "definition": "The Changhsingian or Changxingian is the latest age or uppermost stage of the Permian. It is also the upper or latest of two subdivisions of the Lopingian epoch or series. The Changhsingian lasted from 254.14 to 251.902 million years ago (Ma). It was preceded by the Wuchiapingian and followed by the Induan. The greatest mass extinction in the Phanerozoic eon, the Permian–Triassic extinction event, occurred during this age. The extinction rate peaked about a million years before the end of this stage.",
                        "children": []
                      }
                    ]
                  },
                  {
                    "uuid": "7cf7423c-bc51-44ae-bccd-d0cffa85bed9",
                    "label": "CISURALIAN",
                    "broader": "50437b21-5bf8-4e7e-abe0-007b56c09cca",
                    "definition": "The Cisuralian is the first series/epoch of the Permian. The Cisuralian was preceded by the Pennsylvanian and followed by the Guadalupian. The series saw the appearance of beetles and flies and was a relatively stable warming period of about 21 million years.",
                    "children": [
                      {
                        "uuid": "2ef634c0-2e47-419e-873e-4649974f7e64",
                        "label": "KUNGURIAN",
                        "broader": "7cf7423c-bc51-44ae-bccd-d0cffa85bed9",
                        "definition": "The Kungurian is an age or stage of the Permian. It is the latest or upper of four subdivisions of the Cisuralian epoch or series. The Kungurian lasted between 283.5 and 272.95 million years ago (Ma).",
                        "children": []
                      },
                      {
                        "uuid": "d5b05025-2467-4ba9-95cd-2e6c9568d33d",
                        "label": "ARTINSKIAN",
                        "broader": "7cf7423c-bc51-44ae-bccd-d0cffa85bed9",
                        "definition": "The Artinskian is an age or stage of the Permian. It is a subdivision of the Cisuralian epoch or series. The Artinskian likely lasted between 290.1 and 283.5 million years ago (Ma).",
                        "children": []
                      },
                      {
                        "uuid": "d8919fb7-eb9e-4ec6-ac4a-80d6251562f4",
                        "label": "ASSELIAN",
                        "broader": "7cf7423c-bc51-44ae-bccd-d0cffa85bed9",
                        "definition": "The Asselian is the earliest geochronologic age or lowermost chronostratigraphic stage of the Permian. It is a subdivision of the Cisuralian epoch or series. The Asselian lasted between 298.9 and 295 million years ago (Ma).",
                        "children": []
                      },
                      {
                        "uuid": "feb84480-e62e-4999-b8ce-ad7df84dae5d",
                        "label": "SAKMARIAN",
                        "broader": "7cf7423c-bc51-44ae-bccd-d0cffa85bed9",
                        "definition": "The Sakmarian is an age or stage of the Permian. It is a subdivision of the Cisuralian epoch or series. The Sakmarian lasted between 295 and 290.1 million years ago (Ma). It was preceded by the Asselian and followed by the Artinskian.",
                        "children": []
                      }
                    ]
                  },
                  {
                    "uuid": "c78b1ba6-5187-474e-a7ad-fd46cd6d93ae",
                    "label": "GUADALUPIAN",
                    "broader": "50437b21-5bf8-4e7e-abe0-007b56c09cca",
                    "definition": "The Guadalupian is the second and middle series/epoch of the Permian. The Guadalupian was preceded by the Cisuralian and followed by the Lopingian. It is named after the Guadalupe Mountains of New Mexico and date between 272.3 ± 0.5 – 259.8 ± 0.4 Mya. The series saw the rise of the therapsids, a minor extinction event called Olson’s Extinction and a significant mass extinction called the end-Capitanian extinction event.",
                    "children": [
                      {
                        "uuid": "5ba80ec4-1060-4228-ab97-d7c24980c97e",
                        "label": "ROADIAN",
                        "broader": "c78b1ba6-5187-474e-a7ad-fd46cd6d93ae",
                        "definition": "The Roadian is an age or stage of the Permian. It is the earliest or lower of three subdivisions of the Guadalupian epoch or series. The Roadian lasted between 272.95 and 268.8 million years ago (Ma).",
                        "children": []
                      },
                      {
                        "uuid": "92c8e901-67e5-4d5a-8744-1ffb7f5ec4cb",
                        "label": "WORDIAN",
                        "broader": "c78b1ba6-5187-474e-a7ad-fd46cd6d93ae",
                        "definition": "The Wordian is an age or stage of the Permian. It is the middle of three subdivisions of the Guadalupian epoch or series. The Wordian lasted between 268.8 and 265.1 million years ago (Ma).",
                        "children": []
                      },
                      {
                        "uuid": "93443b1e-9f1e-4f35-9b3b-222bf35a51c0",
                        "label": "CAPITANIAN",
                        "broader": "c78b1ba6-5187-474e-a7ad-fd46cd6d93ae",
                        "definition": "The Capitanian is an age or stage of the Permian. It is also the uppermost or latest of three subdivisions of the Guadalupian epoch or series. The Capitanian lasted between 265.1 and 259.1 million years ago. It was preceded by the Wordian and followed by the Wuchiapingian. A significant mass extinction event (the End-Capitanian extinction event) occurred at the end of this stage, which was associated with anoxia and acidification in the oceans and possibly caused by the volcanic eruptions that produced the Emeishan Traps.",
                        "children": []
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "866fbfc3-7395-4a77-bc1e-29272e8b795c",
                "label": "DEVONIAN",
                "broader": "0e098a6e-2123-4566-9069-6a3401775ca3",
                "definition": "The Devonian is a geologic period and system of the Paleozoic, spanning 60 million years from the end of the Silurian, 419.2 million years ago (Mya), to the beginning of the Carboniferous, 358.9 Mya. The first significant adaptive radiation of life on dry land occurred during the Devonian. Free-sporing vascular plants began to spread across dry land, forming extensive forests which covered the continents. By the middle of the Devonian, several groups of plants had evolved leaves and true roots, and by the end of the period the first seed-bearing plants appeared. Various terrestrial arthropods also became well-established. Fish reached substantial diversity during this time, leading the Devonian to often be dubbed the Age of Fishes. The placoderms began dominating almost every known aquatic environment. The ancestors of all four-limbed vertebrates (tetrapods) began adapting to walking on land, as their strong pectoral and pelvic fins gradually evolved into legs. In the oceans, primitive sharks became more numerous than in the Silurian and Late Ordovician. The first ammonites, species of molluscs, appeared. Trilobites, the mollusc-like brachiopods and the great coral reefs, were still common. The Late Devonian extinction which started about 375 million years ago severely affected marine life, killing off all placodermi, and all trilobites, save for a few species of the order Proetida.",
                "children": [
                  {
                    "uuid": "599af9b7-4517-45c2-8505-a46fc204e524",
                    "label": "EARLY",
                    "broader": "866fbfc3-7395-4a77-bc1e-29272e8b795c",
                    "definition": "In the Lower Devonian, ammonoids appeared, leaving us large limestone deposits from their shells. Bivalves, crinoid and blastoid echinoderms, graptolites, and trilobites were all present, though most groups of trilobites disappeared by the close of the Devonian.",
                    "children": [
                      {
                        "uuid": "2c142df4-aede-4962-b141-3b84cea639b0",
                        "label": "PRAGIAN",
                        "broader": "599af9b7-4517-45c2-8505-a46fc204e524",
                        "definition": "The Pragian is one of three faunal stages in the Early Devonian epoch. It lasted from 411.2 ± 2.8 million years ago to 407 ± 2.8 million years ago. It was preceded by the Lochkovian stage and followed by the Emsian stage. The most important lagerstätte of the Pragian is Rhynie chert in Scotland.",
                        "children": []
                      },
                      {
                        "uuid": "6d53c67e-1019-4c4f-9ed5-b0fadab11f55",
                        "label": "EMSIAN",
                        "broader": "599af9b7-4517-45c2-8505-a46fc204e524",
                        "definition": "The Emsian is one of three faunal stages in the Early Devonian epoch. It lasted from 407.6 ± 2.6 million years ago to 393.3 ± 1.2 million years ago. It was preceded by the Pragian stage and followed by the Eifelian stage. During this period, earliest known agoniatitid ammonoid fossils began appearing within this stage after first appearing in previous stage and began to evolutionarily radiate within this stage, in which a new ammonoid order Goniatitida rises in the end of Zlichovian stage (Siberian representation; corresponds to early Eifelian and after the end of Early Devonian, before 391.9 mya). Later agoniatitid ammonoids would die out in the Taghanic event in the upper middle Givetian. Goniatite ammonoids would give rise to further ammonoid orders, thus starting ammonoid dominance of marine fossils in further periods until their end at the Cretaceous-Paleogene mass extinction event.",
                        "children": []
                      },
                      {
                        "uuid": "8ec111c5-b689-4482-9bfe-a9884c44f7f3",
                        "label": "LOCHKOVIAN",
                        "broader": "599af9b7-4517-45c2-8505-a46fc204e524",
                        "definition": "The Lochkovian is one of three faunal stages in the Early Devonian epoch. It lasted from 419.2 ± 3.2 million years ago to 410.8 ± 2.8 million years ago. It marked the beginning of the Devonian Period, and was followed by the Pragian stage.",
                        "children": []
                      }
                    ]
                  },
                  {
                    "uuid": "62e5494d-c515-47dc-a4af-f870874add3d",
                    "label": "MIDDLE",
                    "broader": "866fbfc3-7395-4a77-bc1e-29272e8b795c",
                    "definition": "The Middle Devonian began 393.3± 2.7 million years ago. During this time, the first ammonoids appeared, descending from bactritoid nautiloids. Ammonoids during this time period were simple and differed little from their nautiloid counterparts.",
                    "children": [
                      {
                        "uuid": "d002ab48-1cd0-42e3-9fc1-608db632e75c",
                        "label": "EIFELIAN",
                        "broader": "62e5494d-c515-47dc-a4af-f870874add3d",
                        "definition": "The Eifelian is one of two faunal stages in the Middle Devonian epoch. It lasted from 393.3 ± 1.2 million years ago to 387.7 ± 0.8 million years ago. It was preceded by the Emsian stage and followed by the Givetian stage.",
                        "children": []
                      },
                      {
                        "uuid": "f6913b28-5a77-4042-97ef-fcbf743c2982",
                        "label": "GIVETIAN",
                        "broader": "62e5494d-c515-47dc-a4af-f870874add3d",
                        "definition": "The Givetian is one of two faunal stages in the Middle Devonian period. It lasted from 387.7 million years ago to 382.7 million years ago. It was preceded by the Eifelian stage and followed by the Frasnian stage.",
                        "children": []
                      }
                    ]
                  },
                  {
                    "uuid": "d6b9b49c-667e-4da7-bd72-32b4b5d89c0e",
                    "label": "LATE",
                    "broader": "866fbfc3-7395-4a77-bc1e-29272e8b795c",
                    "definition": "The Upper or Late Devonian started with the Frasnian, 382.7 ± 2.8 to 372.2 ± 2.5, during which the first forests took shape on land. The first tetrapods appeared in the fossil record in the ensuing Famennian subdivision, the beginning and end of which are marked with extinction events. This lasted until the end of the Devonian, 358.9± 2.5 million years ago.",
                    "children": [
                      {
                        "uuid": "2cdd9d46-afee-4566-9469-d043dc6d8acd",
                        "label": "FAMENNIAN",
                        "broader": "d6b9b49c-667e-4da7-bd72-32b4b5d89c0e",
                        "definition": "The Famennian is the latter of two faunal stages in the Late Devonian epoch. It lasted from 372.2 million years ago to 358.9 million years ago. It was preceded by the Frasnian stage and followed by the Tournaisian stage. It was during this age that tetrapods first appeared. In the seas, a novel major group of ammonoid cephalopods called clymeniids appeared, underwent tremendous diversification and spread worldwide, then just as suddenly went extinct. The beginning of the Famennian is marked by a major extinction event, the Kellwasser Event, and the end with a smaller but still quite severe extinction event, the Hangenberg Event.",
                        "children": []
                      },
                      {
                        "uuid": "55c20bf0-31dd-4a82-a9a4-928f1a84f219",
                        "label": "FRASNIAN",
                        "broader": "d6b9b49c-667e-4da7-bd72-32b4b5d89c0e",
                        "definition": "The Frasnian is one of two faunal stages in the Late Devonian period. It lasted from 382.7 million years ago to 372.2 million years ago. It was preceded by the Givetian stage and followed by the Famennian stage. Major reef-building was under way during the Frasnian stage, particularly in western Canada and Australia. On land, the first forests were taking shape. In North America, the Antler and Taconic orogenies peaked, which were contemporary with the Bretonic phase of the Variscan orogeny in Europe.",
                        "children": []
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "b5b2981d-1623-4988-8b28-4cb8085a62e1",
                "label": "CARBONIFEROUS",
                "broader": "0e098a6e-2123-4566-9069-6a3401775ca3",
                "definition": "The Carboniferous is a geologic period and system that spans 60 million years from the end of the Devonian Period 358.9 million years ago (Mya), to the beginning of the Permian Period, 298.9 Mya. Terrestrial animal life was well established by the Carboniferous period. Amphibians were the dominant land vertebrates, of which one branch would eventually evolve into amniotes, the first solely terrestrial vertebrates. Arthropods were also very common, and many (such as Meganeura) were much larger than those of today. Vast swaths of forest covered the land, which would eventually be laid down and become the coal beds characteristic of the Carboniferous stratigraphy evident today. The atmospheric content of oxygen also reached its highest levels in geological history during the period, 35%, compared with 21% today, allowing terrestrial invertebrates to evolve to great size.",
                "children": [
                  {
                    "uuid": "a9aac8e7-10bc-4fe9-bf8e-c45db58b5eca",
                    "label": "MISSISSIPPIAN",
                    "broader": "b5b2981d-1623-4988-8b28-4cb8085a62e1",
                    "definition": "The Mississippian is a subperiod in the geologic timescale or a subsystem of the geologic record. It is the earliest/lowermost of two subperiods of the Carboniferous period lasting from roughly 358.9 to 323.2 million years ago. The Mississippian was a period of marine transgression in the Northern Hemisphere: the sea level was so high that only the Fennoscandian Shield and the Laurentian Shield were dry land. The cratons were surrounded by extensive delta systems and lagoons, and carbonate sedimentation on the surrounding continental platforms, covered by shallow seas. In North America, where the interval consists primarily of marine limestones, it is treated as a geologic period between the Devonian and the Pennsylvanian. During the Mississippian an important phase of orogeny occurred in the Appalachian Mountains. It is a major rock-building period named for the exposures in the Mississippi Valley region. The USGS geologic time scale shows its relation to other periods. In Europe, the Mississippian and Pennsylvanian are one more-or-less continuous sequence of lowland continental deposits and are grouped together as the Carboniferous system, and sometimes called the Upper Carboniferous and Lower Carboniferous instead.",
                    "children": [
                      {
                        "uuid": "03796134-4406-43d2-88e9-8334843e9153",
                        "label": "LATE",
                        "broader": "a9aac8e7-10bc-4fe9-bf8e-c45db58b5eca",
                        "definition": "No definition available.",
                        "children": [
                          {
                            "uuid": "a5aede69-96cd-45bf-8a53-fe5c8fa3f3dc",
                            "label": "SERPUKHOVIAN",
                            "broader": "03796134-4406-43d2-88e9-8334843e9153",
                            "definition": "The Serpukhovian is the uppermost stage or youngest age of the Mississippian, the lower subsystem of the Carboniferous. The Serpukhovian age lasted from 330.9 Ma to 323.2 Ma. It is preceded by the Visean and is followed by the Bashkirian.",
                            "children": []
                          }
                        ]
                      },
                      {
                        "uuid": "0f8853f9-6fc0-4a72-9e61-8b8a5e1fdae7",
                        "label": "MIDDLE",
                        "broader": "a9aac8e7-10bc-4fe9-bf8e-c45db58b5eca",
                        "definition": "No definition available.",
                        "children": [
                          {
                            "uuid": "e7f66704-f02e-4480-89d8-f0d5c28a18a3",
                            "label": "VISEAN",
                            "broader": "0f8853f9-6fc0-4a72-9e61-8b8a5e1fdae7",
                            "definition": "The Visean is an age in in the stratigraphic column. It is the second stage of the Mississippian, the lower subsystem of the Carboniferous. The Visean lasted from 346.7 to 330.9 Ma. It follows the Tournaisian age/stage and is followed by the Serpukhovian age/stage.",
                            "children": []
                          }
                        ]
                      },
                      {
                        "uuid": "c0489a3d-7571-44f8-ae10-bc56da60a29e",
                        "label": "EARLY",
                        "broader": "a9aac8e7-10bc-4fe9-bf8e-c45db58b5eca",
                        "definition": "No definition available.",
                        "children": [
                          {
                            "uuid": "a3e3914d-7777-4e91-80ca-60264adb1e73",
                            "label": "TOURNAISIAN",
                            "broader": "c0489a3d-7571-44f8-ae10-bc56da60a29e",
                            "definition": "The Tournaisian is the lowest stage or oldest age of the Mississippian, the oldest subsystem of the Carboniferous. The Tournaisian age lasted from 358.9 Ma to 346.7 Ma. It is preceded by the Famennian (the uppermost stage of the Devonian) and is followed by the Viséan.",
                            "children": []
                          }
                        ]
                      }
                    ]
                  },
                  {
                    "uuid": "b99b0ad0-93d2-4acf-912c-13d5a1ba12a6",
                    "label": "PENNSYLVANIAN",
                    "broader": "b5b2981d-1623-4988-8b28-4cb8085a62e1",
                    "definition": "The Pennsylvanian is the younger of two subperiods (or upper of two subsystems) of the Carboniferous Period. It lasted from roughly 323.2 million years ago to 298.9 million years ago. As with most other geochronologic units, the rock beds that define the Pennsylvanian are well identified, but the exact date of the start and end are uncertain by a few hundred thousand years.",
                    "children": [
                      {
                        "uuid": "26d10402-338b-433e-a90e-5952e3ae044d",
                        "label": "MIDDLE",
                        "broader": "b99b0ad0-93d2-4acf-912c-13d5a1ba12a6",
                        "definition": "No definition available.",
                        "children": [
                          {
                            "uuid": "c9924714-7cba-41ff-b2e8-f2395d00583a",
                            "label": "MOSCOVIAN",
                            "broader": "26d10402-338b-433e-a90e-5952e3ae044d",
                            "definition": "The Moscovian is a stage or age in the Pennsylvanian, the youngest subsystem of the Carboniferous. The Moscovian age lasted from 315.2 to 307 Ma, is preceded by the Bashkirian and is followed by the Kasimovian. The Moscovian overlaps with the European regional Westphalian stage and the North American Atokan and Desmoinesian stages.",
                            "children": []
                          }
                        ]
                      },
                      {
                        "uuid": "5fab652d-b69a-4005-b6cf-6d9d4a533703",
                        "label": "LATE",
                        "broader": "b99b0ad0-93d2-4acf-912c-13d5a1ba12a6",
                        "definition": "No definition available.",
                        "children": [
                          {
                            "uuid": "47a51602-f1de-4188-ab8d-9aedd88a1936",
                            "label": "GZHELIAN",
                            "broader": "5fab652d-b69a-4005-b6cf-6d9d4a533703",
                            "definition": "The Gzhelian is the youngest stage of the Pennsylvanian and the youngest subsystem of the Carboniferous. The Gzhelian lasted from 303.7 to 298.9 Ma. It follows the Kasimovian age/stage and is followed by the Asselian age/stage, the oldest subdivision of the Permian system.",
                            "children": []
                          },
                          {
                            "uuid": "b8d669b7-ed07-4bcc-8698-cbab463fefc8",
                            "label": "KASIMOVIAN",
                            "broader": "5fab652d-b69a-4005-b6cf-6d9d4a533703",
                            "definition": "The Kasimovian is the third stage in the Pennsylvanian (late Carboniferous), lasting from 307 to 303.7 Ma. The Kasimovian stage follows the Moscovian and is followed by the Gzhelian. The Kasimovian saw an extinction event which occurred around 305 mya, referred to as the Carboniferous Rainforest Collapse.",
                            "children": []
                          }
                        ]
                      },
                      {
                        "uuid": "981c3e53-263e-4a91-a2ca-f5896635bbbd",
                        "label": "EARLY",
                        "broader": "b99b0ad0-93d2-4acf-912c-13d5a1ba12a6",
                        "definition": "No definition available.",
                        "children": [
                          {
                            "uuid": "1e8dafc0-21c0-4f49-82a6-9d38d8b9f16d",
                            "label": "EARLY",
                            "broader": "981c3e53-263e-4a91-a2ca-f5896635bbbd",
                            "definition": "No definition available.",
                            "children": []
                          },
                          {
                            "uuid": "20a0db39-423d-4fd9-a89c-7f760d14f844",
                            "label": "BASHKIRIAN",
                            "broader": "981c3e53-263e-4a91-a2ca-f5896635bbbd",
                            "definition": "The Bashkirian is the lowest stage or oldest age of the Pennsylvanian. The Bashkirian age lasted from 323.2 to 315.2 Ma,  is preceded by the Serpukhovian and is followed by the Moscovian.",
                            "children": []
                          }
                        ]
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "uuid": "a0bd8bda-adb6-4ea2-ae02-5caef1557ad6",
            "label": "MESOZOIC",
            "broader": "af145656-986a-4969-bb77-6e5b2cff1ede",
            "definition": "The Mesozoic Era is divided into three time periods: the Triassic (251-199.6 million years ago), the Jurassic (199.6-145.5 million years ago), and the Cretaceous (145.5-65.5 million years ago).",
            "children": [
              {
                "uuid": "0d7a2c62-d0b0-4a13-8412-d7cc8d68aeff",
                "label": "CRETACEOUS",
                "broader": "a0bd8bda-adb6-4ea2-ae02-5caef1557ad6",
                "definition": "The Cretaceous is usually noted for being the last portion of the 'Age of Dinosaurs', but that does not mean that new kinds of dinosaurs did not appear then. It is during the Cretaceous that the first ceratopsian and pachycepalosaurid dinosaurs appeared. Also during this time, we find the first fossils of many insect groups, modern mammal and bird groups, and the first flowering plants.\n\nThe breakup of the world-continent Pangea, which began to disperse during the Jurassic, continued. This led to increased regional differences in floras and faunas between the northern and southern continents.\n\nThe end of the Cretaceous brought the end of many previously successful and diverse groups of organisms, such as non-avian dinosaurs and ammonites. This laid open the stage for those groups which had previously taken secondary roles to come to the forefront. The Cretaceous was thus the time in which life as it now exists on Earth came together.",
                "children": [
                  {
                    "uuid": "d3928482-e056-4d2d-ae5a-1e7097099c2b",
                    "label": "LATE",
                    "broader": "0d7a2c62-d0b0-4a13-8412-d7cc8d68aeff",
                    "definition": "The Upper Cretaceous is the last geological epoch in the Cretaceous. It began 100.5 million years ago, and ended 66 million years ago.\n\nThe Cretaceous is traditionally divided into Lower Cretaceous (early), and Upper Cretaceous (late), because of the different rocks. The rocks reflect the conditions in which they were formed.\n\nThe Upper Cretaceous is the chalk. It is composed of countless millions of calcareous (CaCO3) plates called coccoliths. They are so small they can only just be seen with a light microscope; details require an electron microscope. The plates are formed by single-celled planktonic algae called coccolithophores, and were laid down in the off-shore seas.\n\nThe only other rock found in chalk is the flint, which is siliceous (silica, SiO2). This derives from those algae and animals which have skeletons of silica.\n\nThe Cretaceous was the last period when dinosaurs were the dominant land animals. Triceratops, Tyrannosaurus and Velociraptor lived at this time. The huge Mosasaurus was the dominant marine predator. In the Cretaceous period, birds became more diverse. Flowering plants developed more, and became the dominant plants on land. The Upper Cretaceous ended with the K/T extinction event.",
                    "children": [
                      {
                        "uuid": "2fc19a25-4320-4513-a4a3-f20548ed1daa",
                        "label": "SANTONIAN",
                        "broader": "d3928482-e056-4d2d-ae5a-1e7097099c2b",
                        "definition": "The Santonian is an age in the geologic timescale or a chronostratigraphic stage. It is a subdivision of the Late Cretaceous epoch or Upper Cretaceous series. It spans the time between 86.3 ± 0.7 mya (million years ago) and 83.6 ± 0.7 mya. The Santonian is preceded by the Coniacian and is followed by the Campanian.",
                        "children": []
                      },
                      {
                        "uuid": "4912ab7c-dd62-48df-975c-e3e107a4b09b",
                        "label": "TURONIAN",
                        "broader": "d3928482-e056-4d2d-ae5a-1e7097099c2b",
                        "definition": "The Turonian is, in the ICS' geologic timescale, the second age in the Late Cretaceous epoch, or a stage in the Upper Cretaceous series. It spans the time between 93.9 ± 0.8 Ma and 89.8 ± 1 Ma (million years ago). The Turonian is preceded by the Cenomanian stage and underlies the Coniacian stage.\n\nAt the beginning of the Turonian an anoxic event took place which is called the Cenomanian-Turonian boundary event or the 'Bonarelli Event'.",
                        "children": []
                      },
                      {
                        "uuid": "66543c1a-4855-4ded-a610-c38a80cf158a",
                        "label": "CENOMANIAN",
                        "broader": "d3928482-e056-4d2d-ae5a-1e7097099c2b",
                        "definition": "The Cenomanian is, in the ICS' geological timescale the oldest or earliest age of the Late Cretaceous epoch or the lowest stage of the Upper Cretaceous series. An age is a unit of geochronology: it is a unit of time; the stage is a unit in the stratigraphic column deposited during the corresponding age. Both age and stage bear the same name.\n\nAs a unit of geologic time measure, the Cenomanian age spans the time between 100.5 ± 0.9 Ma and 93.9 ± 0.8 Ma (million years ago). In the geologic timescale it is preceded by the Albian and is followed by the Turonian. The Upper Cenomanian starts approximately at 95 M.a.\n\nThe Cenomanian is coeval with the Woodbinian of the regional timescale of the Gulf of Mexico and the early part of the Eaglefordian of the regional timescale of the East Coast of the United States.\n\nAt the end of the Cenomanian an anoxic event took place, called the Cenomanian-Turonian boundary event or the 'Bonarelli Event', that is associated with a minor extinction event for marine species.",
                        "children": []
                      },
                      {
                        "uuid": "8ce20eea-74f0-40cd-b611-4686427c5fa4",
                        "label": "MAASTRICHTIAN",
                        "broader": "d3928482-e056-4d2d-ae5a-1e7097099c2b",
                        "definition": "The Maastrichtian is, in the ICS geologic timescale, the latest age (uppermost stage) of the Late Cretaceous epoch or Upper Cretaceous series, the Cretaceous period or system, and of the Mesozoic era or erathem. It spanned the interval from 72.1 to 66 million years ago. The Maastrichtian was preceded by the Campanian and succeeded by the Danian (part of the Paleogene and Paleocene).\n\nAt the end of this period, there was a mass extinction known as the Cretaceous–Paleogene extinction event (formerly known as the Cretaceous–Tertiary extinction event).[a] In this extinction event, many commonly recognized groups such as non-avian dinosaurs, plesiosaurs and mosasaurs, as well as many other lesser-known groups, died out. The cause of the extinction is most commonly linked to an asteroid about 10 to 15 kilometres (6.2 to 9.3 mi) wide colliding with Earth at the end of the Cretaceous.",
                        "children": []
                      },
                      {
                        "uuid": "96713563-fdf4-4e05-ad85-36cf66a74260",
                        "label": "CAMPANIAN",
                        "broader": "d3928482-e056-4d2d-ae5a-1e7097099c2b",
                        "definition": "The Campanian is the fifth of six ages of the Late Cretaceous epoch on the geologic timescale of the International Commission on Stratigraphy (ICS). In chronostratigraphy, it is the fifth of six stages in the Upper Cretaceous series. Campanian spans the time from 83.6 (± 0.7) to 72.1 (± 0.6) million years ago. It is preceded by the Santonian and it is followed by the Maastrichtian.\n\nThe Campanian was an age when a worldwide sea level rise covered many coastal areas. The morphology of some of these areas has been preserved: it is an unconformity beneath a cover of marine sedimentary rocks.",
                        "children": []
                      },
                      {
                        "uuid": "f431ccfe-5f30-4faa-84d0-4621fb602f10",
                        "label": "CONIACIAN",
                        "broader": "d3928482-e056-4d2d-ae5a-1e7097099c2b",
                        "definition": "The Coniacian is an age or stage in the geologic timescale. It is a subdivision of the Late Cretaceous epoch or Upper Cretaceous series and spans the time between 89.8 ± 1 Ma and 86.3 ± 0.7 Ma (million years ago). The Coniacian is preceded by the Turonian and followed by the Santonian.",
                        "children": []
                      }
                    ]
                  },
                  {
                    "uuid": "db06b2a9-4ed5-4222-8533-fbf3ed3bdc23",
                    "label": "EARLY",
                    "broader": "0d7a2c62-d0b0-4a13-8412-d7cc8d68aeff",
                    "definition": "The Lower Cretaceous is the earlier or lower of the two major divisions of the Cretaceous. It is usually considered to stretch from 146 Ma to 100 Ma. \n\nDuring this time many new types of dinosaur appeared or came into prominence, including ceratopsians, spinosaurids, carcharodontosaurids and coelurosaurs, while survivors from the Late Jurassic continued to persist.\n\nAngiosperms (flowering plants) appeared for the first time during the Early Cretaceous; Archaefructaceae, the oldest (124.6 Ma) was found in the Yixian Formation, China. This time also saw the evolution of the first members of the Neornithes (modern birds).\n\nSinodelphys, a 125 Ma-old boreosphenidan mammal found in the Yixian Formation, China, is one of the oldest mammal fossils found. The fossil location indicates early mammals began to diversify from Asia during the Early Cretaceous. Sinodelphys was more closely related to metatherians (marsupials) than eutherians (placentals) and had feet adapted from climbing trees. Steropodon is the oldest monotreme (egg-lying mammal) discovered. It lived in Gondwana (now Australia) at 105 Ma.",
                    "children": [
                      {
                        "uuid": "4542d23f-a390-4e21-a905-79ec5e9c66ec",
                        "label": "APTIAN",
                        "broader": "db06b2a9-4ed5-4222-8533-fbf3ed3bdc23",
                        "definition": "The Aptian is an age in the geologic timescale or a stage in the stratigraphic column. It is a subdivision of the Early or Lower Cretaceous epoch or series and encompasses the time from 125.0 ± 1.0 Ma to 113.0 ± 1.0 Ma (million years ago), approximately. The Aptian succeeds the Barremian and precedes the Albian, all part of the Lower/Early Cretaceous.\n\nThe Aptian partly overlaps the upper part of the regionally used (in Western Europe) stage Urgonian.\n\nThe Selli Event, also known as OAE1a, was one of two oceanic Anoxic events in the Cretaceous period, which occurred around 120 Ma and lasted approximately 1 to 1.3 million years. The Aptian extinction was a minor extinction event hypothesized to have occurred around 116 to 117 Ma.",
                        "children": []
                      },
                      {
                        "uuid": "9d050d2d-3397-439c-86a5-0e41c3e8dfdc",
                        "label": "BERRIASIAN",
                        "broader": "db06b2a9-4ed5-4222-8533-fbf3ed3bdc23",
                        "definition": "In the geological timescale, the Berriasian is an age or stage of the Early Cretaceous. It is the oldest, or lowest, subdivision in the entire Cretaceous. It spanned the time between 145.0 ± 4.0 Ma and 139.8 ± 3.0 Ma (million years ago). The Berriasian succeeds the Tithonian (part of the Jurassic) and precedes the Valanginian.",
                        "children": []
                      },
                      {
                        "uuid": "9ff94259-fc2a-4899-b878-736daf6b3f94",
                        "label": "VALANGINIAN",
                        "broader": "db06b2a9-4ed5-4222-8533-fbf3ed3bdc23",
                        "definition": "In the geologic timescale, the Valanginian is an age or stage of the Early or Lower Cretaceous. It spans between 139.8 ± 3.0 Ma and 132.9 ± 2.0 Ma (million years ago). The Valanginian stage succeeds the Berriasian stage of the Lower Cretaceous and precedes the Hauterivian stage of the Lower Cretaceous.",
                        "children": []
                      },
                      {
                        "uuid": "a26a2ddd-4eb0-4aa8-a6db-8b47622b5dbe",
                        "label": "BARREMIAN",
                        "broader": "db06b2a9-4ed5-4222-8533-fbf3ed3bdc23",
                        "definition": "The Barremian is an age in the geologic timescale (or a chronostratigraphic stage) between 129.4 ± 1.5 Ma (million years ago) and 125.0 ± 1.0 Ma). It is a subdivision of the Early Cretaceous epoch (or Lower Cretaceous series). It is preceded by the Hauterivian and followed by the Aptian stage.",
                        "children": []
                      },
                      {
                        "uuid": "f270c702-4bc6-45bd-82ee-b8637073c96f",
                        "label": "HAUTERIVIAN",
                        "broader": "db06b2a9-4ed5-4222-8533-fbf3ed3bdc23",
                        "definition": "The Hauterivian is, in the geologic timescale, an age in the Early Cretaceous epoch or a stage in the Lower Cretaceous series. It spans the time between 132.9 ± 2 Ma and 129.4 ± 1.5 Ma (million years ago). The Hauterivian is preceded by the Valanginian and succeeded by the Barremian.",
                        "children": []
                      },
                      {
                        "uuid": "f4da3849-801c-4b51-9403-45ec421dfa03",
                        "label": "ALBIAN",
                        "broader": "db06b2a9-4ed5-4222-8533-fbf3ed3bdc23",
                        "definition": "The Albian is both an age of the geologic timescale and a stage in the stratigraphic column. It is the youngest or uppermost subdivision of the Early/Lower Cretaceous epoch/series. Its approximate time range is 113.0 ± 1.0 Ma to 100.5 ± 0.9 Ma (million years ago). The Albian is preceded by the Aptian and followed by the Cenomanian.",
                        "children": []
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "2fc65458-428c-4d02-ae15-f4b0a1c1dc39",
                "label": "JURASSIC",
                "broader": "a0bd8bda-adb6-4ea2-ae02-5caef1557ad6",
                "definition": "Great plant-eating dinosaurs roaming the earth, feeding on lush ferns and palm-like cycads and bennettitaleans smaller but vicious carnivores stalking the great herbivores … oceans full of fish, squid, and coiled ammonites, plus great ichthyosaurs and long-necked plesiosaurs … vertebrates taking to the air, like the pterosaurs and the first birds. This was the Jurassic Period, 199.6 to 145.5 million years ago* — a 54-million-year chunk of the Mesozoic Era.\n\nNamed for the Jura Mountains on the border between France and Switzerland, where rocks of this age were first studied, the Jurassic has become a household word with the success of the movie Jurassic Park. Outside of Hollywood, the Jurassic is still important to us today, both because of its wealth of fossils and because of its economic importance — the oilfields of the North Sea, for instance, are Jurassic in age.",
                "children": [
                  {
                    "uuid": "2df3bf58-8e9d-4c08-8370-3678b7bc94f6",
                    "label": "MIDDLE",
                    "broader": "2fc65458-428c-4d02-ae15-f4b0a1c1dc39",
                    "definition": "The Middle Jurassic is the second epoch of the Jurassic Period. It lasted from about 174 to 163 million years ago. Fossil-bearing rocks from the Middle Jurassic are relatively rare, but some important formations include the Forest Marble Formation in England, the Kilmaluag Formation in Scotland, the Daohugou Beds in China, Itat Formation in Russia, and the Isalo III Formation of western Madagasca.",
                    "children": [
                      {
                        "uuid": "1386b377-26fd-49af-a7e3-7c8be3320997",
                        "label": "BAJOCIAN",
                        "broader": "2df3bf58-8e9d-4c08-8370-3678b7bc94f6",
                        "definition": "In the geologic timescale, the Bajocian is an age and stage in the Middle Jurassic. It lasted from approximately 170.3 Ma to around 168.3 Ma (million years ago). The Bajocian age succeeds the Aalenian age and precedes the Bathonian age.",
                        "children": []
                      },
                      {
                        "uuid": "4e10cbfa-f2d3-4397-a353-752126197158",
                        "label": "CALLOVIAN",
                        "broader": "2df3bf58-8e9d-4c08-8370-3678b7bc94f6",
                        "definition": "In the geologic timescale, the Callovian is an age and stage in the Middle Jurassic, lasting between 166.1 ± 4.0 Ma (million years ago) and 163.5 ± 4.0 Ma. It is the last stage of the Middle Jurassic, following the Bathonian and preceding the Oxfordian.",
                        "children": []
                      },
                      {
                        "uuid": "8d25cd2c-cb4e-4133-af8b-dcde0775c558",
                        "label": "AALENIAN",
                        "broader": "2df3bf58-8e9d-4c08-8370-3678b7bc94f6",
                        "definition": "The Aalenian ( /ɑːˈliːniən/) is a subdivision of the Middle Jurassic epoch/series of the geologic timescale that extends from about 174.1 Ma to about 170.3 Ma (million years ago). It was preceded by the Toarcian and succeeded by the Bajocian.",
                        "children": []
                      },
                      {
                        "uuid": "cd6d09ee-0c39-4a4f-9285-3bf616b0aae3",
                        "label": "BATHONIAN",
                        "broader": "2df3bf58-8e9d-4c08-8370-3678b7bc94f6",
                        "definition": "In the geologic timescale the Bathonian is an age and stage of the Middle Jurassic. It lasted from approximately 168.3 Ma to around 166.1 Ma (million years ago). The Bathonian age succeeds the Bajocian age and precedes the Callovian age.",
                        "children": []
                      }
                    ]
                  },
                  {
                    "uuid": "47a5e636-ac8a-4c32-a356-d8c6a7172a8f",
                    "label": "LATE",
                    "broader": "2fc65458-428c-4d02-ae15-f4b0a1c1dc39",
                    "definition": "The Upper Jurassic is the last geological epoch in the Jurassic that began 163.5 million years ago (mya), and ended at 145 mya. It was followed by the Lower Cretaceous.",
                    "children": [
                      {
                        "uuid": "19b97ca1-f6ae-4a27-be69-c67cd2bbd985",
                        "label": "KIMMERIDGIAN",
                        "broader": "47a5e636-ac8a-4c32-a356-d8c6a7172a8f",
                        "definition": "In the geologic timescale, the Kimmeridgian is an age or stage in the Late or Upper Jurassic epoch or series. It spans the time between 157.3 ± 1.0 Ma and 152.1 ± 0.9 Ma (million years ago). The Kimmeridgian follows the Oxfordian and precedes the Tithonian.",
                        "children": []
                      },
                      {
                        "uuid": "97bead3b-1194-49ba-b39a-42f5462a36a4",
                        "label": "OXFORDIAN",
                        "broader": "47a5e636-ac8a-4c32-a356-d8c6a7172a8f",
                        "definition": "The Oxfordian is, in the ICS' geologic timescale, the earliest age of the Late Jurassic epoch, or the lowest stage of the Upper Jurassic series. It spans the time between 163.5 ± 4 Ma and 157.3 ± 4 Ma (million years ago). The Oxfordian is preceded by the Callovian and is followed by the Kimmeridgian.",
                        "children": []
                      },
                      {
                        "uuid": "a600cd3f-c92f-4a5b-a381-24e6f4904c9c",
                        "label": "TITHONIAN",
                        "broader": "47a5e636-ac8a-4c32-a356-d8c6a7172a8f",
                        "definition": "In the geological timescale, the Tithonian is the latest age of the Late Jurassic epoch or the uppermost stage of the Upper Jurassic series. It spans the time between 152.1 ± 4 Ma and 145.0 ± 4 Ma (million years ago). It is preceded by the Kimmeridgian and followed by the Berriasian stage (part of the Cretaceous).",
                        "children": []
                      }
                    ]
                  },
                  {
                    "uuid": "bc9f3b87-69ff-4841-a227-309c69c952c2",
                    "label": "EARLY",
                    "broader": "2fc65458-428c-4d02-ae15-f4b0a1c1dc39",
                    "definition": "The Early Jurassic epoch (in chronostratigraphy corresponding to the Lower Jurassic series) is the earliest of three epochs of the Jurassic period. The Early Jurassic starts immediately after the Triassic-Jurassic extinction event, 201.3 Ma (million years ago), and ends at the start of the Middle Jurassic 174.1 Ma.",
                    "children": [
                      {
                        "uuid": "071a00d6-29c6-460a-9d59-d593e430d263",
                        "label": "SINEMURIAN",
                        "broader": "bc9f3b87-69ff-4841-a227-309c69c952c2",
                        "definition": "In the geologic timescale, the Sinemurian is an age and stage in the Early or Lower Jurassic epoch or series. It spans the time between 199.3 ± 2 Ma and 190.8 ± 1.5 Ma (million years ago). The Sinemurian is preceded by the Hettangian and is followed by the Pliensbac",
                        "children": []
                      },
                      {
                        "uuid": "07d16792-c709-4db2-a744-97619e9bc680",
                        "label": "TOARCIAN",
                        "broader": "bc9f3b87-69ff-4841-a227-309c69c952c2",
                        "definition": "The Toarcian is, in the ICS' geologic timescale, an age and stage in the Early or Lower Jurassic. It spans the time between 182.7 Ma (million years ago) and 174.1 Ma. It follows the Pliensbachian and is followed by the Aalenian. The Toarcian age began with the Toarcian turnover, the extinction event that sets its fossil faunas apart from the previous Pliensbachian age.",
                        "children": []
                      },
                      {
                        "uuid": "2dd020ac-d5ee-4f39-8a55-3d80a84854a7",
                        "label": "PLIENSBACHIAN",
                        "broader": "bc9f3b87-69ff-4841-a227-309c69c952c2",
                        "definition": "The Pliensbachian is an age of the geologic timescale and stage in the stratigraphic column. It is part of the Early or Lower Jurassic epoch or series and spans the time between 190.8 ± 1.5 Ma and 182.7 ± 1.5 Ma (million years ago). The Pliensbachian is preceded by the Sinemurian and followed by the Toarcian.",
                        "children": []
                      },
                      {
                        "uuid": "fb29222e-8aaf-4b46-8672-8525a58e2b8d",
                        "label": "HETTANGIAN",
                        "broader": "bc9f3b87-69ff-4841-a227-309c69c952c2",
                        "definition": "The Hettangian is the earliest age and lowest stage of the Jurassic period of the geologic timescale. It spans the time between 201.3 ± 0.2 Ma and 199.3 ± 0.3 Ma (million years ago). The Hettangian follows the Rhaetian (part of the Triassic period) and is followed by the Sinemurian.\n\nIn European stratigraphy the Hettangian is a part of the time span in which the Lias was deposited. An example is the British Blue Lias, which has an upper Rhaetian to Sinemurian age. Another example is the lower Lias from the Northern Limestone Alps where well-preserved but very rare ammonites, including Alsatites, have been found.",
                        "children": []
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "b44427cd-4b20-42a3-9e14-8d1f6d8399d5",
                "label": "TRIASSIC",
                "broader": "a0bd8bda-adb6-4ea2-ae02-5caef1557ad6",
                "definition": "In many ways, the Triassic, lasting from 251.0 mya to 199.6 mya, was a time of transition. It was at this time that the world-continent of Pangea existed, altering global climate and ocean circulation. The Triassic also follows the largest extinction event in the history of life, and so is a time when the survivors of that event spread and recolonized.\n\nThe organisms of the Triassic can be considered to belong to one of three groups: holdovers from the Permo-Triassic extinction, new groups which flourished briefly, and new groups which went on to dominate the Mesozoic world. The holdovers included the lycophytes, glossopterids, and dicynodonts. While those that went on to dominate the Mesozoic world include modern conifers, cycadeoids, and the dinosaurs.",
                "children": [
                  {
                    "uuid": "35aa6f1d-da5b-473d-b95c-24ba82cc0780",
                    "label": "LATE",
                    "broader": "b44427cd-4b20-42a3-9e14-8d1f6d8399d5",
                    "definition": "The Late (Upper) Triassic is the third and final of three epochs of the Triassic Period in the geologic timescale. The Triassic-Jurassic extinction event began during this epoch and is one of the five major mass extinction events of the Earth. The corresponding series is known as the Upper Triassic. In Europe the epoch was called the Keuper, after a German lithostratigraphic group (a sequence of rock strata) that has a roughly corresponding age. The Late Triassic spans the time between 237 Ma and 201.3 Ma (million years ago). The Late Triassic is divided into the Carnian, Norian and Rhaetian ages.\n\nMany of the first dinosaurs evolved during the Late Triassic, including Plateosaurus, Coelophysis, and Eoraptor.\n\nThe extinction event that began during the Late Triassic resulted in the disappearance of about 76% of all terrestrial and marine life species, as well as almost 20% of taxonomic families. Although the Late Triassic Epoch did not prove to be as destructive as the preceding Permian Period, which took place approximately 50 million years earlier and destroyed about 70% of land species, 57% of insect families as well as 95% of marine life, it resulted in great decreased in population sizes of many living organism populations.\n\nSpecifically, the Late Triassic had negative effects on the conodonts and ammonoid groups. These groups once served as vital index fossils, which made it possible to identify feasible life span to multiple strata of the Triassic strata. These groups were severely affected during the epoch, and became extinct soon after. Despite the large populations that withered away with the coming of the Late Triassic, many families, such as the pterosaurs, crocodiles, mammals and fish were very minimally affected. However, such families as the bivalves, gastropods, marine reptiles and brachiopods were greatly affected and many species became extinct during this time",
                    "children": [
                      {
                        "uuid": "11fdca69-e5fb-4b41-97e5-de678fd7eade",
                        "label": "NORIAN",
                        "broader": "35aa6f1d-da5b-473d-b95c-24ba82cc0780",
                        "definition": "The Norian is a division of the Triassic geological period. It has the rank of an age (geochronology) or stage (chronostratigraphy). The Norian lasted from ~227 to 208.5 million years ago. It was preceded by the Carnian and succeeded by the Rhaetian.",
                        "children": []
                      },
                      {
                        "uuid": "db75736c-28be-470c-b532-71b81ca3fbcd",
                        "label": "CARNIAN",
                        "broader": "35aa6f1d-da5b-473d-b95c-24ba82cc0780",
                        "definition": "The Carnian is the lowermost stage of the Upper Triassic series (or earliest age of the Late Triassic epoch). It lasted from 237 to 227 million years ago (Ma). The Carnian is preceded by the Ladinian and is followed by the Norian. Its boundaries are not characterized by major extinctions or biotic turnovers, but a climatic event (known as the Carnian Pluvial Event) occurred during the Carnian and seems to be associated with important extinctions or biotic radiations.",
                        "children": []
                      },
                      {
                        "uuid": "ff133a4b-a23a-4710-93d3-2b802b21c8c4",
                        "label": "RHAETIAN",
                        "broader": "35aa6f1d-da5b-473d-b95c-24ba82cc0780",
                        "definition": "The Rhaetian is, in geochronology, the latest age of the Triassic period or in chronostratigraphy the uppermost stage of the Triassic system. It lasted from 208.5 to 201.3 million years ago. It was preceded by the Norian and succeeded by the Hettangian (the lowermost stage or earliest age of the Jurassic).",
                        "children": []
                      }
                    ]
                  },
                  {
                    "uuid": "5cf3e2f7-3753-4c2f-ae82-4b8eebf4547f",
                    "label": "EARLY",
                    "broader": "b44427cd-4b20-42a3-9e14-8d1f6d8399d5",
                    "definition": "The Early (Lower) Triassic is the first of three epochs of the Triassic Period of the geologic timescale. It spans the time between 251.902 Ma and 247.2 Ma (million years ago). Rocks from this epoch are collectively known as the Lower Triassic, which is a unit in chronostratigraphy. The Early Triassic is the oldest epoch of the Mesozoic Era and is divided into the Induan and Olenekian ages.\n\nThe Lower Triassic series is coeval with the Scythian stage, which is today not included in the official timescales but can be found in older literature. In Europe, most of the Lower Triassic is composed of Buntsandstein, a lithostratigraphic unit of continental red beds.",
                    "children": [
                      {
                        "uuid": "38c83387-bfa9-46d4-8f17-43fc46ac891e",
                        "label": "OLENEKIAN",
                        "broader": "5cf3e2f7-3753-4c2f-ae82-4b8eebf4547f",
                        "definition": "In the geologic timescale, the Olenekian is an age in the Early Triassic epoch or a stage in the Lower Triassic series. It spans the time between 251.2 Ma and 247.2 Ma (million years ago). The Olenekian follows the Induan and is followed by the Anisian. The Olenekian saw the deposition of a large part of the Buntsandstein in Europe. Archosaurs - a group encompassing crocodiles, pterosaurs, dinosaurs, and ultimately birds - are diapsid reptiles that first evolved from Archosauriform ancestors during the Olenekian.",
                        "children": []
                      },
                      {
                        "uuid": "b7e63199-3f21-4dd3-900c-e9bfc68c158a",
                        "label": "INDUAN",
                        "broader": "5cf3e2f7-3753-4c2f-ae82-4b8eebf4547f",
                        "definition": "The Induan is, in the geologic timescale, the first age of the Early Triassic epoch or the lowest stage of the Lower Triassic series. It spans the time between 251.902 Ma and 251.2 Ma (million years ago).",
                        "children": []
                      }
                    ]
                  },
                  {
                    "uuid": "ee019c00-2300-4675-9dea-8f993a744a67",
                    "label": "MIDDLE",
                    "broader": "b44427cd-4b20-42a3-9e14-8d1f6d8399d5",
                    "definition": "In the geologic timescale, the Middle Triassic is the second of three epochs of the Triassic period or the middle of three series in which the Triassic system is divided. It spans the time between 247.2 Ma and 237 Ma (million years ago). The Middle Triassic is divided into the Anisian and Ladinian ages or stages.\n\nFormerly the middle series in the Triassic was also known as Muschelkalk. This name is now only used for a specific unit of rock strata with approximately Middle Triassic age, found in western Europe.\n\nDuring this time there were no flowering plants, but instead there were ferns and mosses. Small dinosaurs began to appear, like Nyasasaurus and the ichnogenus Iranosauripus.",
                    "children": [
                      {
                        "uuid": "4eb7b9e2-0478-478d-8674-1798e5fb1b2b",
                        "label": "LADINIAN",
                        "broader": "ee019c00-2300-4675-9dea-8f993a744a67",
                        "definition": "The Ladinian is a stage and age in the Middle Triassic series or epoch. It spans the time between 242 Ma and ~237 Ma (million years ago). The Ladinian was preceded by the Anisian and succeeded by the Carnian (part of the Upper or Late Triassic).",
                        "children": []
                      },
                      {
                        "uuid": "a4d1651b-a5c2-463d-afea-c211da0d1ea5",
                        "label": "ANISIAN",
                        "broader": "ee019c00-2300-4675-9dea-8f993a744a67",
                        "definition": "In the geologic timescale, the Anisian is the lower stage or earliest age of the Middle Triassic series or epoch and lasted from 247.2 million years ago until 242 million years ago. The Anisian age succeeds the Olenekian age (part of the Lower Triassic epoch) and precedes the Ladinian age.",
                        "children": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "uuid": "db5be985-d8dc-4063-abff-4cbd8eb39653",
            "label": "CENOZOIC",
            "broader": "af145656-986a-4969-bb77-6e5b2cff1ede",
            "definition": "The Cenozoic Era is the most recent of the three major subdivisions of animal history. The other two are the Mesozoic and Paleozoic Eras. The Cenozoic spans only about 65 million years, from the end of the Cretaceous Period and the extinction of non-avian dinosaurs to the present. The Cenozoic is sometimes called the Age of Mammals, because the largest land animals have been mammals during that time. This is a misnomer for several reasons. First, the history of mammals began long before the Cenozoic began. Second, the diversity of life during the Cenozoic is far wider than mammals. The Cenozoic could have been called the 'Age of Flowering Plants' or the 'Age of Insects' or the 'Age of Teleost Fish' or the 'Age of Birds' just as accurately.\n\nThe Cenozoic (65.5 million years ago to present) is divided into three periods: the Paleogene (65.5 to 23.03 million years ago), Neogene (23.03 to 2.6 million years ago) and the Quaternary (2.6 million years ago to present). Paleogene and Neogene are relatively new terms that now replace the deprecated term, Tertiary. The Paleogene is subdivided into three epochs: the Paleocene (65.5 to 55.8 million years ago), the Eocene (55.8 to 33.9 million years ago), and the Oligocene (33.9 to 23.03 million years ago). The Neogene is subdivided into two epochs: the Miocene (23.03 to 5.332 million years ago) and Pliocene (5.332 to 2.588 million years ago).",
            "children": [
              {
                "uuid": "a77f665d-345c-49b0-9e9b-f9f78a1415cc",
                "label": "PALEOGENE",
                "broader": "db5be985-d8dc-4063-abff-4cbd8eb39653",
                "definition": "The Paleogene is a geologic period and system that spans 43 million years from the end of the Cretaceous Period 66 million years ago (Mya) to the beginning of the Neogene Period 23.03 Mya. It is the beginning of the Cenozoic Era of the present Phanerozoic Eon. The earlier term Tertiary Period was used to define the span of time now covered by the Paleogene and subsequent Neogene periods; despite no longer being recognized as a formal stratigraphic term, 'Tertiary' is still widely found in earth science literature and remains in informal use. The Paleogene is most notable for being the time during which mammals diversified from relatively small, simple forms into a large group of diverse animals in the wake of the Cretaceous–Paleogene extinction event that ended the preceding Cretaceous Period. The United States Geological Survey uses the abbreviation PE for the Paleogene, but the more commonly used abbreviation is PG with the PE being used for Paleocene.\n\nThis period consists of the Paleocene, Eocene, and Oligocene epochs. The end of the Paleocene (55.5/54.8 Mya) was marked by the Paleocene–Eocene Thermal Maximum, one of the most significant periods of global change during the Cenozoic, which upset oceanic and atmospheric circulation and led to the extinction of numerous deep-sea benthic foraminifera and on land, a major turnover in mammals. The term 'Paleogene System' is applied to the rocks deposited during the 'Paleogene Period'.",
                "children": [
                  {
                    "uuid": "5e89981e-0ef5-4aec-b118-54fdf197eb05",
                    "label": "OLIGOCENE",
                    "broader": "a77f665d-345c-49b0-9e9b-f9f78a1415cc",
                    "definition": "The Oligocene Epoch, which is right in the middle of the Tertiary Period (and end of the Paleogene), lasted from about 33.9 to 23 million years ago. Although it lasted a 'short' 11 million years, a number of major changes occurred during this time. These changes include the appearance of the first elephants with trunks, early horses, and the appearance of many grasses — plants that would produce extensive grasslands in the following epoch, the Miocene.",
                    "children": [
                      {
                        "uuid": "9388f3a4-18df-45f6-ba3d-7a78579f6a6d",
                        "label": "CHATTIAN",
                        "broader": "5e89981e-0ef5-4aec-b118-54fdf197eb05",
                        "definition": "The Chattian is, in the geologic timescale, the younger of two ages or upper of two stages of the Oligocene epoch/series. It spans the time between 28.1 and 23.03 Ma. The Chattian is preceded by the Rupelian and is followed by the Aquitanian (the lowest stage of the Miocene).",
                        "children": []
                      },
                      {
                        "uuid": "bb81d8bd-f837-4893-b560-921c28359975",
                        "label": "RUPELIAN",
                        "broader": "5e89981e-0ef5-4aec-b118-54fdf197eb05",
                        "definition": "The Rupelian is, in the geologic timescale, the older of two ages or the lower of two stages of the Oligocene epoch/series. It spans the time between 33.9 and 28.1 Ma. It is preceded by the Priabonian stage (part of the Eocene) and is followed by the Chattian stage.",
                        "children": []
                      }
                    ]
                  },
                  {
                    "uuid": "afd62c36-fd25-4673-a56d-85be8d47f3d0",
                    "label": "EOCENE",
                    "broader": "a77f665d-345c-49b0-9e9b-f9f78a1415cc",
                    "definition": "The Eocene is the second of five epochs in the Tertiary Period — the second of three epochs in the Paleogene — and lasted from about 55.8 to 33.9 million years ago. The oldest known fossils of most of the modern orders of mammals appear in a brief period during the early Eocene and all were small, under 10 kg. Both groups of modern ungulates, Artiodactyla and Perissodactyla, became prevalent mammals at this time, due to a major radiation between Europe and North America.",
                    "children": [
                      {
                        "uuid": "1fbdcab5-811a-4221-899a-3a0610cdcb26",
                        "label": "LUTETIAN",
                        "broader": "afd62c36-fd25-4673-a56d-85be8d47f3d0",
                        "definition": "The Lutetian is, in the geologic timescale, a stage or age in the Eocene. It spans the time between 47.8 and 41.2 Ma. The Lutetian is preceded by the Ypresian and is followed by the Bartonian. Together with the Bartonian it is sometimes referred to as the Middle Eocene subepoch.",
                        "children": []
                      },
                      {
                        "uuid": "67246f68-1e2e-48a8-b8c8-be04d247a4c2",
                        "label": "BARTONIAN",
                        "broader": "afd62c36-fd25-4673-a56d-85be8d47f3d0",
                        "definition": "The Bartonian is a stage or age in the middle Eocene epoch or series. The Bartonian age spans the time between 41.2 and 37.8 Ma. It is preceded by the Lutetian and is followed by the Priabonian age.",
                        "children": []
                      },
                      {
                        "uuid": "788fb9ec-4963-40cc-8409-398dede7754b",
                        "label": "PRIABONIAN",
                        "broader": "afd62c36-fd25-4673-a56d-85be8d47f3d0",
                        "definition": "The Priabonian is the latest age or the upper stage of the Eocene epoch or series. It spans the time between 37.8 and 33.9 Ma. The Priabonian is preceded by the Bartonian and is followed by the Rupelian, the lowest stage of the Oligocene.",
                        "children": []
                      },
                      {
                        "uuid": "b5657be8-24d2-4cf0-90c2-c01922c74079",
                        "label": "YPRESIAN",
                        "broader": "afd62c36-fd25-4673-a56d-85be8d47f3d0",
                        "definition": "In the geologic timescale the Ypresian is the oldest age or lowest stratigraphic stage of the Eocene. It spans the time between 56 and 47.8 Ma, is preceded by the Thanetian age (part of the Paleocene) and is followed by the Eocene Lutetian age. The Ypresian age begins during the throes of the Paleocene–Eocene Thermal Maximum (PETM). The Fur Formation in Denmark and the Messel shales in Germany are from this age.",
                        "children": []
                      }
                    ]
                  },
                  {
                    "uuid": "cb277225-be9e-4c22-954e-fe7352e9faa6",
                    "label": "PALEOCENE",
                    "broader": "a77f665d-345c-49b0-9e9b-f9f78a1415cc",
                    "definition": "The Paleocene is a geological epoch that lasted from about 66 to 56 million years ago (mya). It is the first epoch of the Paleogene Period in the modern Cenozoic Era. \n\nThe epoch is bracketed by two major events in Earth's history: the K-Pg extinction event and the Paleocene–Eocene thermal maximum. The K-Pg extinction event, brought on by an asteroid impact and an ensuing impact winter, marked the beginning of the Paleocene and killed off 75% of life on Earth, most famously the non-avian dinosaurs. The end of the epoch was marked by the Paleocene–Eocene thermal maximum, which was a major climatic event wherein about 2,500–4,500 gigatons of carbon was released into the atmosphere and ocean systems en masse, causing a spike in global temperatures and ocean acidification.\n\nThe Paleocene continued many geological processes initiated in Mesozoic, and the continents continued moving towards their present positions. The Northern Hemisphere continents were still connected via some land bridges as well as the Southern Hemisphere continents, the Rocky Mountains were being uplifted, the Americas had not yet joined, and the Indian Plate had begun its collision with Asia. In the oceans, the thermohaline circulation probably was much different than it is today, with downwellings occurring in the North Pacific rather than the North Atlantic, and water density was mainly controlled by salinity rather than temperature.\n\nThe extinction event caused a floral and faunal turnover of species, with previously abundant species being replaced by previously uncommon ones. With a global average temperature of about 24–25 °C (75–77 °F), compared to 14 °C (57 °F) in more recent times, the Earth had a greenhouse climate without permanent ice sheets at the poles. As such, there were forests worldwide–including at the poles–with low species richness in regards to plant life, populated by mainly small creatures which were rapidly evolving to take advantage of the recently-emptied Earth. Though some animals attained enormous size, most remained rather small. The forests grew quite dense in the general absence of large herbivores. Mammals proliferated in the Paleocene, and the earliest placentals and marsupials are recorded from this time, but most Paleocene taxa have ambiguous affinities. In the seas, ray-finned fish rose to dominate open ocean and reef ecosystems.",
                    "children": [
                      {
                        "uuid": "1f28f84d-f0ab-484e-8eea-2c9f5c141558",
                        "label": "SELANDIAN",
                        "broader": "cb277225-be9e-4c22-954e-fe7352e9faa6",
                        "definition": "The Selandian is in the geologic timescale an age or stage in the Paleocene. It spans the time between 61.6 and 59.2 Ma. It is preceded by the Danian and followed by the Thanetian. Sometimes the Paleocene is subdivided in subepochs, in which the Selandian forms the 'Middle Paleocene'.",
                        "children": []
                      },
                      {
                        "uuid": "979bcb67-30f0-49c8-8e8e-fb7412e75efa",
                        "label": "THANETIAN",
                        "broader": "cb277225-be9e-4c22-954e-fe7352e9faa6",
                        "definition": "The Thanetian is, in the ICS Geologic timescale, the latest age or uppermost stratigraphic stage of the Paleocene Epoch or series. It spans the time between 59.2 and 56 Ma. The Thanetian is preceded by the Selandian age and followed by the Ypresian age (part of the Eocene). The Thanetian is sometimes referred to as the Late Paleocene.",
                        "children": []
                      },
                      {
                        "uuid": "f2053865-d144-4d79-b18b-4fd361be25ae",
                        "label": "DANIAN",
                        "broader": "cb277225-be9e-4c22-954e-fe7352e9faa6",
                        "definition": "The Danian is the oldest age or lowest stage of the Paleocene epoch or series, the Paleogene period or system and the Cenozoic era or erathem. The beginning of the Danian age (and the end of the preceding Maastrichtian age) is at the Cretaceous–Paleogene extinction event 66 Ma. The age ended 61.6 Ma, being followed by the Selandian age.",
                        "children": []
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "c7e7fb38-44ef-4c5b-aa1d-b3fdcf89d838",
                "label": "QUATERNARY",
                "broader": "db5be985-d8dc-4063-abff-4cbd8eb39653",
                "definition": "The Quaternary is the current and most recent of the three periods of the Cenozoic Era in the geologic time scale of the International Commission on Stratigraphy (ICS). It follows the Neogene Period and spans from 2.588 ± 0.005 million years ago to the present. The Quaternary Period is divided into two epochs: the Pleistocene (2.588 million years ago to 11.7 thousand years ago) and the Holocene (11.7 thousand years ago to today). The informal term 'Late Quaternary' refers to the past 0.5–1.0 million years. The Quaternary Period is typically defined by the cyclic growth and decay of continental ice sheets associated with Milankovitch cycles and the associated climate and environmental changes that occurred.",
                "children": [
                  {
                    "uuid": "a686e751-3639-4cd0-840b-c8ad25c441c1",
                    "label": "PLEISTOCENE",
                    "broader": "c7e7fb38-44ef-4c5b-aa1d-b3fdcf89d838",
                    "definition": "The Pleistocene, often colloquially referred to as the Ice Age) is the geological epoch which lasted from about 2,580,000 to 11,700 years ago, spanning the world's most recent period of repeated glaciations. The end of the Pleistocene corresponds with the end of the last glacial period and also with the end of the Paleolithic age used in archaeology.\n\nThe Pleistocene is the first epoch of the Quaternary Period or sixth epoch of the Cenozoic Era. In the ICS timescale, the Pleistocene is divided into four stages or ages, the Gelasian, Calabrian, Middle Pleistocene (unofficially the 'Chibanian') and Upper Pleistocene (unofficially the 'Tarantian'). In addition to this international subdivision, various regional subdivisions are often used.",
                    "children": [
                      {
                        "uuid": "4a8e2b77-e46a-4646-8a9d-1a99b6d8a4b0",
                        "label": "CALABRIAN",
                        "broader": "a686e751-3639-4cd0-840b-c8ad25c441c1",
                        "definition": "Calabrian is a subdivision of the Pleistocene Epoch of the geologic time scale, defined as ~1.8 Ma.—781,000 years ago ± 5,000 years, a period of ~1.019 million years.\n\nThe end of the stage is defined by the last magnetic pole reversal (781 ± 5 Ka) and plunge into an ice age and global drying possibly colder and drier than the late Miocene (Messinian) through early Pliocene (Zanclean) cold period. Originally the Calabrian was a European faunal stage primarily based on mollusk fossils. It has become the second geologic age in the Early Pleistocene. Many of the mammalian faunal assemblages of the Early Pleistocene start in the Gelasian. For example, the Platygonus and other Blancan fauna appear first in the Gelasian.",
                        "children": []
                      },
                      {
                        "uuid": "750b7e7e-8dd6-41ec-8e09-c3026baffd2b",
                        "label": "MIDDLE",
                        "broader": "a686e751-3639-4cd0-840b-c8ad25c441c1",
                        "definition": "The Middle Pleistocene is a subdivision of the Pleistocene Epoch, from 781,000 to 126,000 years ago (781–126 ka). It is preceded by the Calabrian stage, beginning with the Brunhes–Matuyama reversal, and succeeded by the Tarantian stage (equivalent to the Late or Upper Pleistocene), taken as beginning with the last interglacial (MIS 5).\n\nThe tripartite subdivision of the Pleistocene into Lower (Early), Middle and Upper (Late) has been in use since the 1930s. It is in use as a provisional or 'quasi-formal' designation by  the International Union of Geological Sciences (IUGS) as of 2018,  pending the ratification of the 2017 proposal by the International Commission on Stratigraphy (Subcommission on Quaternary Stratigraphy, ICSSQS) of the Chibanian stage.",
                        "children": []
                      },
                      {
                        "uuid": "9f54bcf3-64dc-480b-ba75-3298c2299f35",
                        "label": "LATE",
                        "broader": "a686e751-3639-4cd0-840b-c8ad25c441c1",
                        "definition": "The Upper Pleistocene is defined by the base of the Eemian interglacial phase before the final glacial episode of the Pleistocene 126,000 ± 5,000 years ago. Its end is defined at the end of the Younger Dryas, some 11,700 years ago. The age represents the end of the Pleistocene epoch and is followed by the Holocene epoch.\n\nMuch of the Late Pleistocene age was dominated by glaciations, such as the Wisconsin glaciation in North America and the Weichselian glaciation and Würm glaciation in Eurasia. Many megafauna became extinct during this age, a trend that continued into the Holocene. The Late Pleistocene contains the Upper Paleolithic stage of human development, including the out-of-Africa migration and dispersal of anatomically modern humans and the extinction of the last remaining archaic human species.",
                        "children": []
                      },
                      {
                        "uuid": "ea3e9d14-1969-4add-83f3-a4c486b922e9",
                        "label": "GELASIAN",
                        "broader": "a686e751-3639-4cd0-840b-c8ad25c441c1",
                        "definition": "The Gelasian is an age in the international geologic timescale or a stage in chronostratigraphy, being the earliest or lowest subdivision of the Quaternary period/system and Pleistocene epoch/series. It spans the time between 2.588 ± 0.005 Ma (million years ago) and 1.806 ± 0.005 Ma. It follows the Piacenzian stage (part of the Pliocene) and is followed by the Calabrian stage.",
                        "children": []
                      }
                    ]
                  },
                  {
                    "uuid": "e000088a-8252-4603-ba55-38189c45612c",
                    "label": "HOLOCENE",
                    "broader": "c7e7fb38-44ef-4c5b-aa1d-b3fdcf89d838",
                    "definition": "The Holocene is the name given to the last 11,700 years of the Earth's history — the time since the end of the last major glacial epoch, or 'ice age.' Since then, there have been small-scale climate shifts — notably the 'Little Ice Age' between about 1200 and 1700 A.D. — but in general, the Holocene has been a relatively warm period in between ice ages.",
                    "children": [
                      {
                        "uuid": "007cc0a7-cccf-47c9-a55d-af36592055b3",
                        "label": "GREENLANDIAN",
                        "broader": "e000088a-8252-4603-ba55-38189c45612c",
                        "definition": "The Greenlandian is the earliest age or lowest stage of the Holocene epoch or series, part of the Quaternary. It is one of three subdivisions of the Holocene. The lower boundary of the Greenlandian Age is the GSSP sample from the North Greenland Ice Core Project in central Greenland (75.1000°N 42.3200°W). The Greenlandian GSSP has been correlated with the end of Younger Dryas (from near-glacial to interglacial) and a “shift in deuterium excess values.",
                        "children": []
                      },
                      {
                        "uuid": "078b8751-408f-4410-9925-0840a52e0b5c",
                        "label": "MEGHALAYAN",
                        "broader": "e000088a-8252-4603-ba55-38189c45612c",
                        "definition": "The Meghalayan is the latest age or uppermost stage of the Quaternary. It is also the upper, or latest, of three subdivisions of the Holocene epoch or series. Its Global Boundary Stratotype Section and Point (GSSP) is a Krem Mawmluh Cave formation in Meghalaya, northeast India. Mawmluh cave is one of the longest and deepest caves in India, and conditions here were suitable for preserving chemical signs of the transition in ages. The global auxiliary stratotype is an ice core from Mount Logan in Canada.\n\nThe Meghalayan begins 4,200 years BP, i.e., before 1950 (c. 2250 BCE or 7750 HE), leaving open room for the possible creation of the Anthropocene from 1950 forward. The age began with a 200-year drought that impacted human civilizations in Egypt, Greece, Syria, Canaan, Mesopotamia, the Indus Valley and the Yangtze River Valley. 'The fact that the beginning of this age coincides with a cultural shift caused by a global climate event makes it unique,' according to Stanley Finney, Secretary General of the International Union of Geological Sciences.",
                        "children": []
                      },
                      {
                        "uuid": "faa0de65-292f-4a5e-9dc7-1893ca82180c",
                        "label": "NORTHGRIPPIAN",
                        "broader": "e000088a-8252-4603-ba55-38189c45612c",
                        "definition": "In the geologic time scale, the Northgrippian is the middle of the three ages of the Holocene epoch which lies in the Quaternary period. It was officially ratified by the International Commission on Stratigraphy in July 2018 along with the Greenlandian and the Meghalayan.\n\nThe age began 8,236 years prior to the year 2000 (6236 BCE or 3764 HE), near the 8.2 kiloyear event, and goes up to the start of the Meghalayan, which began 4,200 years prior to the year 1950 (2250 BCE or 7750 HE), near the 4.2 kiloyear event.",
                        "children": []
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "e5a3aed9-de46-4903-a999-f9f8bcdf1cd7",
                "label": "NEOGENE",
                "broader": "db5be985-d8dc-4063-abff-4cbd8eb39653",
                "definition": "The Neogene is a geologic period and system that spans 20.45 million years from the end of the Paleogene Period 23.03 million years ago (Mya) to the beginning of the present Quaternary Period 2.58 Mya. The Neogene is sub-divided into two epochs, the earlier Miocene and the later Pliocene. Some geologists assert that the Neogene cannot be clearly delineated from the modern geological period, the Quaternary. \n\nDuring this period, mammals and birds continued to evolve into roughly modern forms, while other groups of life remained relatively unchanged. Early hominids, the ancestors of humans, appeared in Africa near the end of the period.  Some continental movement took place, the most significant event being the connection of North and South America at the Isthmus of Panama, late in the Pliocene. This cut off the warm ocean currents from the Pacific to the Atlantic Ocean, leaving only the Gulf Stream to transfer heat to the Arctic Ocean. The global climate cooled considerably over the course of the Neogene, culminating in a series of continental glaciations in the Quaternary Period that follows.",
                "children": [
                  {
                    "uuid": "32bf646d-d80c-49be-aee8-87ccdd4785af",
                    "label": "MIOCENE",
                    "broader": "e5a3aed9-de46-4903-a999-f9f8bcdf1cd7",
                    "definition": "The Miocene Epoch, 23.03 to 5.3 million years ago, was a time of warmer global climates than those in the preceeding Oligocene or the following Pliocene and it's notable in that two major ecosystems made their first appearances: kelp forests and grasslands. The expansion of grasslands is correlated to a drying of continental interiors as the global climate first warmed and then cooled.\n\nThe overall pattern of biological change for the Miocene is one of expanding open vegetation systems (such as deserts, tundra, and grasslands) at the expense of diminishing closed vegetation (such as forests). This led to a rediversification of temperate ecosystems and many morphological changes in animals. Mammals and birds in particular developed new forms, whether as fast-running herbivores, large predatory mammals and birds, or small quick birds and rodents.\n\nPlant studies of the Miocene have focused primarily on spores and pollen. Such studies show that by the end of the Miocene 95% of modern seed plant families existed, and that no such families have gone extinct since the middle of the Miocene. A mid-Miocene warming, followed by a cooling is considered responsible for the retreat of tropical ecosystems, the expansion of northern coniferous forests, and increased seasonality. With this change came the diversification of modern graminoids, especially grasses and sedges.\n\nIn addition to changes on land, important new ecosystems in the sea led to new forms there. Kelp forests appeared for the first time, as did sea otters and other critters unique to those environments. At the same time, such ocean-going mammals as the Desmostylia went extinct.",
                    "children": [
                      {
                        "uuid": "027286de-800d-4141-b17b-6df71fbef30c",
                        "label": "AQUITANIAN",
                        "broader": "32bf646d-d80c-49be-aee8-87ccdd4785af",
                        "definition": "The Aquitanian is, in the ICS' geologic timescale, the oldest age or lowest stage in the Miocene. It spans the time between 23.03 ± 0.05 Ma and 20.43 ± 0.05 Ma (million years ago) during the Early Miocene. It is a dry, cooling period. The Aquitanian succeeds the Chattian (the youngest age of the Oligocene) and precedes the Burdigalian.",
                        "children": []
                      },
                      {
                        "uuid": "4faea12f-7425-42c4-abcc-e9253d312e57",
                        "label": "LANGHIAN",
                        "broader": "32bf646d-d80c-49be-aee8-87ccdd4785af",
                        "definition": "The Langhian is, in the ICS geologic timescale, an age or stage in the middle Miocene epoch/series. It spans the time between 15.97 ± 0.05 Ma and 13.65 ± 0.05 Ma (million years ago) during the Middle Miocene. The Langhian was a continuing warming period defined by Lorenzo Pareto in 1865, it was originally established in the Langhe area north of Ceva in northern Italy, hence the name. The Langhian is preceded by the Burdigalian and followed by the Serravallian stage.",
                        "children": []
                      },
                      {
                        "uuid": "630bb839-bbf4-4183-92a2-d0aa25de6dcb",
                        "label": "MESSINIAN",
                        "broader": "32bf646d-d80c-49be-aee8-87ccdd4785af",
                        "definition": "The Messinian is in the geologic timescale the last age or uppermost stage of the Miocene. It spans the time between 7.246 ± 0.005 Ma and 5.333 ± 0.005 Ma (million years ago). It follows the Tortonian and is followed by the Zanclean, the first age of the Pliocene.\n\nThe Messinian overlaps the Turolian European Land Mammal Mega Zone (more precisely MN 12 and 13) and the Pontian Central European Paratethys stage. It also overlaps the late Huayquerian and early Montehermosan South American Land Mammal Ages, and falls inside the more extensive Hemphillian North American Land Mammal Age.",
                        "children": []
                      },
                      {
                        "uuid": "8f22650c-e749-4775-a99a-9978a89456d0",
                        "label": "SERRAVALLIAN",
                        "broader": "32bf646d-d80c-49be-aee8-87ccdd4785af",
                        "definition": "The Serravallian is in the geologic timescale an age or a stage in the middle Miocene epoch/series, that spans the time between 13.82 Ma and 11.63 Ma (million years ago). The Serravallian follows the Langhian and is followed by the Tortonian.\n\nIt overlaps with the middle of the Astaracian European Land Mammal Mega Zone, the upper Barstovian and lower Clarendonian North American Land Mammal Ages and the Laventan and lower Mayoan South American Land Mammal Ages. It is also coeval with the Sarmatian and upper Badenian stages of the Paratethys time scale of Central and eastern Europe.",
                        "children": []
                      },
                      {
                        "uuid": "a9eca563-b06d-433d-b00b-deb3a3572f02",
                        "label": "TORTONIAN",
                        "broader": "32bf646d-d80c-49be-aee8-87ccdd4785af",
                        "definition": "The Tortonian is in the geologic time scale an age or stage of the late Miocene that spans the time between 11.608 ± 0.005 Ma and 7.246 ± 0.005 Ma (million years ago). It follows the Serravallian and is followed by the Messinian.\n\nThe Tortonian roughly overlaps with the regional Pannonian stage of the Paratethys timescale of Central Europe. It also overlaps the upper Astaracian, Vallesian and lower Turolian European land mammal ages, the upper Clarendonian and lower Hemphillian North American land mammal ages and the upper Chasicoan and lower Huayquerian South American land mammal ages.",
                        "children": []
                      },
                      {
                        "uuid": "d76017a5-c60a-4910-81f7-58a559d32990",
                        "label": "BURDIGALIAN",
                        "broader": "32bf646d-d80c-49be-aee8-87ccdd4785af",
                        "definition": "The Burdigalian is, in the geologic timescale, an age or stage in the early Miocene. It spans the time between 20.43 ± 0.05 Ma and 15.97 ± 0.05 Ma (million years ago). Preceded by the Aquitanian, the Burdigalian was the first and longest warming period of the Miocene and is succeeded by the Langhian.",
                        "children": []
                      }
                    ]
                  },
                  {
                    "uuid": "6cb96c3b-1a1c-4d26-a894-2638d5cd05d1",
                    "label": "PLIOCENE",
                    "broader": "e5a3aed9-de46-4903-a999-f9f8bcdf1cd7",
                    "definition": "The Pliocene, 5.3 to 2.6 million years ago, was a time of global cooling after the warmer Miocene. The cooling and drying of the global environment may have contributed to the enormous spread of grasslands and savannas during this time. The change in vegetation undoubtedly was a major factor in the rise of long-legged grazers who came to live in these areas.\n\nAdditionally, the Panamanian land-bridge between North and South America appeared during the Pliocene, allowing migrations of plants and animals into new habitats. Of even greater impact was the accumulation of ice at the poles, which would lead to the extinction of most species living there, as well as the advance of glaciers and ice ages of the Late Pliocene and the following Pleistocene.",
                    "children": [
                      {
                        "uuid": "430b7535-b720-4b3e-a497-5517eb571a75",
                        "label": "PIACENZIAN",
                        "broader": "6cb96c3b-1a1c-4d26-a894-2638d5cd05d1",
                        "definition": "The Piacenzian is in the international geologic time scale the upper stage or latest age of the Pliocene. It spans the time between 3.6 ± 0.005 Ma and 2.588 ± 0.005 Ma (million years ago). The Piacenzian is after the Zanclean and is followed by the Gelasian (part of the Pleistocene).\n\nThe Piacenzian is roughly coeval with the European land mammal age MN 16, overlaps the late Chapadmalalan and early Uquian South American land mammal age and falls inside the more extensive Blancan North American land mammal age. It also correlates with the Astian, Redonian, Reuverian and Romanian regional stages of Europe. Some authorities describe the British Red Crag Formation and Waltonian stage as late Piacenzian, while others regard them as early Pleistocene.",
                        "children": []
                      },
                      {
                        "uuid": "cd16d901-1c9f-4373-ab7d-d5292049b7a6",
                        "label": "ZANCLEAN",
                        "broader": "6cb96c3b-1a1c-4d26-a894-2638d5cd05d1",
                        "definition": "The Zanclean is the lowest stage or earliest age on the geologic time scale of the Pliocene. It spans the time between 5.332 ± 0.005 Ma and 3.6 ± 0.005 Ma (million years ago). It is preceded by the Messinian age of the Miocene epoch, and followed by the Piacenzian age.\n\nThe Zanclean can be correlated with regionally used stages, such as the Tabianian or Dacian of Central Europe. It also corresponds to the late Hemphillian to mid-Blancan North American Land Mammal Ages. In California, the Zanclean roughly corresponds to the mid-Delmontian Californian Stage of from 7.5 To 2.9 Ma ago.",
                        "children": []
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "uuid": "c7626c29-a1d3-4d0c-a263-616fe060f164",
        "label": "HADEAN",
        "broader": "a9f88ca9-5d19-45fa-8fbb-3c6ff5f1f190",
        "definition": "Hadean time (4.6 to 4 billion years ago) is not a geological period as such. No rocks on the Earth are this old, except for meteorites. During Hadean time, the Solar System was forming, probably within a large cloud of gas and dust around the sun, called an accretion disc. The relative abundance of heavier elements in the Solar System suggests that this gas and dust was derived from a supernova, or supernovas — the explosion of an old, massive star.",
        "children": []
      }
    ]
  }
]